[
    {
        "url": "https://www.sephora.com/ca/en/product/genius-ultimate-anti-aging-vitamin-c-serum-P392945",
        "error": "",
        "scrape_timestamp": "08/21/2023, 07:59:02",
        "product_name": "GENIUS Ultimate Anti-Aging Vitamin C+ Serum",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$159.00"
                ],
                "sku": "Item 1675974"
            }
        ],
        "rating": "width:80.17%",
        "product_reviews": "235",
        "ingredients": "-Alguronic Acid: Improves the appearance of firmness which results in more toned and younger looking skin.\n-Microalgae Oil: Keeps skin hydrated up to five times longer than untreated skin over a 24-hour period.\n-Vitamin C+: Helps to reduce the appearance of discoloration and boost radiance in the skin.\n-Plant Collagen: Hydrates and conditions the skin while promoting a more youthful appearance.\n\nWater, Glycerin, Butylene Glycol, 3-O-Ethyl Ascorbic Acid, Polymethylsilsesquioxane, Sodium Citrate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Niacinamide, Ethoxydiglycol, Algae Exopolysaccharides, Chlorella Protothecoides Oil, Vinyl Dimethicone/ Methicone Silsesquioxane Crosspolymer, Citric Acid, Algae Extract, Peg-12 Dimethicone, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7, Caprylyl Glycol, Xanthan Gum, Vegetable Collagen, Ethylhexylglycerin, Hexylene Glycol, Disodium EDTA, Plantago Lanceolata Leaf Extract, Sorbitan Isostearate, Polysorbate 60, Sodium Lauroyl Lactylate, Carbomer, Polysorbate 20, Ceramide NP, Ceramide AP, Ceramide EOP, Phytosphingosine, Cholesterol, Leuconostoc/Radish Root Ferment Filtrate, Phenoxyethanol, Fragrance, Coumarin.\n",
        "n_loves": "10.4K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/algenist-triple-algae-eye-renewal-balm-with-multi-peptide-complex-P467602",
        "error": "",
        "scrape_timestamp": "08/21/2023, 07:59:14",
        "product_name": "Triple Algae Eye Renewal Balm Eye Cream",
        "brand_name": "Algenist",
        "options": [],
        "rating": "width:90.34599999999999%",
        "product_reviews": "1.2K",
        "ingredients": "-Patented Alguronic Acid: Hydrates and reduces the appearance of fine lines and wrinkles. -Triple Algae (Red, Brown, and Green): Help target the look of varying causes and tones of dark circles.-Multi-Peptide Complex: Help eye area appear firmer and smoother.Aqua (Water/Eau), Stearic Acid, Isopropyl Isostearate, Dimethicone, Glycerin, PentyleneGlycol, Glyceryl Stearate SE, Cetearyl Alcohol, Butyrospermum Parkii (Shea) Butter, C12-15 Alkyl Benzoate, Limnanthes Alba (Meadowfoam) Seed Oil, Parachlorella Beijerinckii Exopolysaccharides, Corallina Officinalis Extract, Dunaliella Salina Extract, Undaria Pinnatifida Extract, Dipeptide-2, Palmitoyl Tetrapeptide-7, Palmitoyl Hexapeptide-12, Palmitoyl Tripeptide-5, Sodium Hyaluronate, Caffeine, Coffea Arabica (Coffee) Seed Oil, Tribehenin, Ceramide NG, PEG-10 Phytosterol, Tetrahexyldecyl Ascorbate, Aloe Barbadensis Leaf Juice, Tocopheryl Acetate, Bambusa Vulgaris Leaf/Stem Extract, Pisum Sativum (Pea)Extract, Glucosamine HCl, Leuconostoc/Radish Root Ferment Filtrate, Camellia Sinensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Dimethicone Crosspolymer, Panthenol, Pantolactone, Caprylyl/Capryl Glucoside, Pfaffia Paniculata Root Extract, Ptychopetalum Olacoides Bark/Stem Extract, Lilium Candidum Flower Extract, Rubus Idaeus (Raspberry) Leaf Extract, Aloe Barbadensis Leaf Juice Powder, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Phospholipids, Ceteareth-20, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Aminomethyl Propanol, Caprylyl Glycol, Lactic Acid, Ethylhexylglycerin, Hexylene Glycol, Hesperidin Methyl Chalcone, Steareth-20, Citric Acid, Sodium Citrate, Chlorhexidine Digluconate, Phenoxyethanol, Potassium Sorbate, Benzyl Alcohol, Sodium Benzoate.",
        "n_loves": "20K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/algenist-algae-niacinamide-moisture-veil-P471000",
        "error": "",
        "scrape_timestamp": "08/21/2023, 07:59:24",
        "product_name": "Algae Niacinamide Moisture Veil",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$88.00"
                ],
                "sku": "Item 2456457"
            }
        ],
        "rating": "width:93.604%",
        "product_reviews": "172",
        "ingredients": "-Patented, Exclusive Alguronic Acid: Hydrates and reduces the appearance of lines and wrinkles. -Sebum-Fighting Algae Concentrate: Visibly reduces excess surface oil and shine. -Niacinamide (Vitamin B3): Visibly brightens and improves skin texture and tone. Water (Aqua, Eau), Caprylic/Capric Triglyceride, Butylene Glycol, Glycerin, Isododecane, Dimethicone, Isostearyl isostearate, Niacinamide, Polymethylsilsesquioxane, Neopentyl Glycol Diheptanoate, Polyglyceryl-6 Polyhydroxystearate, Polyglyceryl-6 Polyricinoleate, Magnesium Sulfate, Sodium Chloride, Parachlorella Beijerinckii Exopolysaccharides, Phloretin, Fucus Spiralis Extract, Tetraselmis Chui Extract, Spiraea Ulmaria Extract, Hydrolyzed Algin, Sorbitan Oleate Decylglucoside Crosspolymer, Disteardimonium Hectorite, Polyglycerin-6, Xanthan Gum, Triethyl Citrate, Lavandula Angustifolia (Lavender) Extract, Eucalyptus Globulus Leaf Extract, Bergamot/Grapefruit/Orange/Tangerine Fruit Ferment Extract, Mica, Citrus Limon (Lemon) Fruit Extract, Ethylhexylglycerin, Triethoxycaprylylsilane, Phenoxyethanol, Titanium Dioxide (CI 77891).",
        "n_loves": "5.7K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-ultimate-anti-aging-eye-cream-P388262",
        "error": "",
        "scrape_timestamp": "08/21/2023, 07:59:35",
        "product_name": "GENIUS Ultimate Anti-Aging Eye Cream",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$100.00"
                ],
                "sku": "Item 1644376"
            }
        ],
        "rating": "width:75.518%",
        "product_reviews": "116",
        "ingredients": " -Alguronic Acid: Combats fine lines and wrinkles and brightens the skin as a scientifically tested, patented regenerative compound produced from microalgae.   \n-Microalgae Oil: Hydrates five times longer than untreated skin for up to 24 hours.  \n-Plant Collagen: Hydrates and conditions the skin as a vegetable source of collagen for a more youthful glow. \n-Persian Silk Tree Extract: Creates a lifted appearance, targeting the upper eyelid as a naturally derived extract.   \n\nWater, Caprylic/Capric Triglyceride, Glycerin, Butyrospermum Parkii (Shea) Butter, Hydrogenated Polyisobutene, Chlorella Protothecoides Oil, Dimethicone, Glyceryl Stearate, PEG-100 Stearate, Cetearyl Alcohol, Cetyl Alcohol, Pentylene Glycol, Silica, Algae Exopolysaccharides, Vegetable Collagen, Algae Extract, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7, Copper Lysine Prolinate, Methyl Glucoside Phosphate, Albiza Julibrissin Bark Extract, Kigelia Africana Fruit Extract, Plantago Lanceolata Leaf Extract, Chrysin, Darutoside, Sodium PCA, Leuconostoc/Radish Root Ferment Filtrate, Stearic Acid, Ceteareth-20, Caprylyl Glycol, Steareth-20, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Butylene Glycol, Sodium Benzoate, Potassium Sorbate, Xanthan Gum, Chlorhexidine Digluconate, N-Hydroxysuccinimide, Chlorphenesin, Sodium Citrate, Disodium EDTA, Citric Acid, Sodium Hydroxide, Phenoxyethanol.",
        "n_loves": "7.6K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/power-recharging-night-pressed-serum-P416552",
        "error": "",
        "scrape_timestamp": "08/21/2023, 07:59:47",
        "product_name": "POWER Recharging Night Pressed Serum",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$128.00"
                ],
                "sku": "Item 1898634"
            }
        ],
        "rating": "width:88.88000000000001%",
        "product_reviews": "250",
        "ingredients": " -Alguronic Acid: Reduces the appearance of fine lines and wrinkles, as well as brightens the overall appearance of the skin.  \n-Algaprotein: Visibly improves skin's firmness and elasticity while improving the appearance of skin's overall texture and suppleness.  \n-Coconut Water: Highly concentrated water packed with essential amino acids, antioxidants, and phytonutrients.\n-Ribose: Helps improve skin firmness, smoothness, and suppleness, making skin appear revitalized and less dull.  \nCocos Nucifera (Coconut) Water, Water (Aqua, Eau), Dimethicone, Glycerin, Methyl Trimethicone, Butylene Glycol, Ceresin, Cyclopentasiloxane, Ozokerite, Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides, Algin, Hydrolyzed F-Fucoidan, Tripleurospermum Maritimum Extract, Camellia Sinensis Leaf Extract, Palmitoyl Hexapeptide-52, Passiflora Incarnata Extract, Ribose, Collagen, Bidens Pilosa Extract, Linum Usitatissimum (Linseed) Seed Oil, Adenosine, Elaeis Guineensis (Palm) Oil, Gossypium Herbaceum (Cotton) Seed Oil, Tocopherol, Biosaccharide Gum-4, Alpha-Glucan Oligosaccharide, BHT, Citric Acid, Leuconostoc/Radish Root Ferment Filtrate, Dimethicone/Vinyl Dimethicone Crosspolymer, Dimethicone/PEG-10/15 Crosspolymer, Dipropylene Glycol, Sodium Chloride, Lauryl PEG-9 Polydimethylsiloxyethyl Dimethicone, Propanediol, Sodium Citrate, Caprylyl Glycol, Chlorphenesin, Potassium Sorbate, Sodium Benzoate, Benzyl Alcohol, Dehydroacetic Acid, Phenoxyethanol, Fragrance (Parfum), Butylphenyl Methylpropional, Hexyl Cinnamal.  \n",
        "n_loves": "11.1K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/reveal-concentrated-luminizing-drops-P411232",
        "error": "Product not available",
        "scrape_timestamp": "08/21/2023, 08:00:00"
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-liquid-collagen-hand-cream-P449163",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:00:09",
        "product_name": "GENIUS Liquid Collagen Hand Cream",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$51.50"
                ],
                "sku": "Item 2239945"
            }
        ],
        "rating": "width:83.902%",
        "product_reviews": "41",
        "ingredients": " -Alguronic Acid: A patented and powerful compound that demonstrates significant properties to rejuvenate the skin for a more youthful appearance. -Vitamins E and C: Brighten and even skin tone. -Active Vegan Collagen: Helps to strengthen and condition the skin to visibly improve resiliency and bounce. ",
        "n_loves": "6.2K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Hand Cream & Foot Cream"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/gentle-rejuvenating-cleanser-P296413",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:00:21",
        "product_name": "Gentle Rejuvenating Cleanser",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 120 mL"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 1357821"
            }
        ],
        "rating": "width:85.094%",
        "product_reviews": "267",
        "ingredients": " -Alguronic Acid: Supports natural cell regeneration and elastin synthesis.-Oat Amino Acids: Deeply cleanse without drying the skin.-Witch Hazel: Removes impurities and refines the look of pores.-Mixed Fruit Acid Complex: Supports natural cell turnover and renewal to refine skin texture.Water, Sodium Cocoyl Isethionate, Glyceryl Stearate SE, Stearic Acid, Cocamidopropyl Betaine, Cetyl Alcohol, Dimethicone PEG-8 Meadowfoamate, Hamamelis Virginiana Water (Hamamelis Virginiana (Witch Hazel) Water), Algae Exopolysaccharides, Tocopheryl Acetate, Sodium Lauroyl Oat Amino Acids, Camellia Sinensis Leaf Extract, Pyrus Malus Fruit Extract (Pyrus Malus (Apple) Fruit Extract), Citrus Medica Limonum Fruit Extract (Citrus Medica Limonum (Lemon) Fruit Extract), Citrus Aurantium Dulcis Fruit Extract (Citrus Aurantium Dulcis (Orange) Fruit Extract), Saccharum Officinarum Extract (Saccharum Officinarum (Sugar Cane) Extract), Arctostaphylos Uva Ursi Leaf Extract, Glycyrrhiza Glabra Root Extract (Glycyrrhiza Glabra (Licorice) Root Extract), Jojoba Alcohol, Potassium Jojobate, Glycerin, Lauryl Lactyl Lactate, Butylene Glycol, Benzoic Acid, Phenoxyethanol, Caprylyl Glycol, Hexylene Glycol, Sodium Chloride, Xanthan Gum, Ethylhexylglycerin.",
        "n_loves": "8.3K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/elevate-advanced-lift-contouring-cream-P420638",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:00:33",
        "product_name": "ELEVATE Advanced Lift Contouring Cream",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$130.00"
                ],
                "sku": "Item 1957208"
            }
        ],
        "rating": "width:86.48599999999999%",
        "product_reviews": "37",
        "ingredients": " -Alguronic Acid: Provides anti-aging and anti-wrinkle benefits.    \n-Tripeptide-2: Helps promote and reinforce a visibly firmer skin structure.    \n-Gold Delivery System: Provides continuous and extended activity of peptides to help fortify skin texture and tone.Water, Dimethicone, Dimethicone Crosspolymer, Butylene Glycol, Glycerin, Caprylic/Capric Triglyceride, Pentylene Glycol, Parachlorella Beijerinckii Exopolysaccharides, Dunaliella Salina Extract, Plankton Extract, Trifluoroacetyl Tripeptide-2, Hydrolyzed Wheat Protein, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Palmitoyl Tripeptide-5, Sodium Hyaluronate, Gold, Arginine/Lysine Polypeptide, Hydrolyzed Rice Protein, Hydrolyzed Oat Protein, Potassium Palmitoyl Hydrolyzed Oat Protein, Avena Sativa (Oat) Kernel Extract, Silica, Acetyl Hydroxyproline, Biosaccharide Gum-1, Tocopherol, Sodium Ascorbate, Ethylhexylglycerin, Citric Acid, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Squalane, Sodium Polyacrylate Starch, Dimethicone/PEG-10/15 Crosspolymer, Polysorbate 60, Adenosine, Sorbitan Isostearate, Lecithin, Panthenol, Magnesium Chloride, Dextran, Pantolactone, Titanium Dioxide, Caprylyl Glycol, Chlorphenesin, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Fragrance, Citronellol, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Limonene, Linalool.    \n\n",
        "n_loves": "3.5K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-collagen-nourishing-lip-balm-P501322",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:00:46",
        "product_name": "GENIUS Collagen Nourishing Lip Balm",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: .35 oz / 10 g"
                ],
                "price": [
                    "$39.00"
                ],
                "sku": "Item 2612299"
            }
        ],
        "rating": "width:90%",
        "product_reviews": "2",
        "ingredients": "-Patented Alguronic Acid®: Minimizes the look of lines and wrinkles, smooths, and adds visible radiance.-Vegan Collagen: Conditions and moisturizes. -Exclusive Non-GMO Strain Microalgae Oil: Hydrates, nourishes, and visibly restores radiance.Ricinus Communis (Castor) Seed Oil, Butyrospermum Parkii (Shea) Butter, Glyceryl Rosinate, Oleic/Linoleic/Linolenic Polyglycerides, Glyceryl Behenate, Water (Aqua, Eau), Jojoba Esters, Olea Europaea (Olive) Oil Unsaponifiables, Helianthus Annuus (Sunflower) Seed Wax, Rhus Verniciflua Peel Wax, Behenyl Behenate, Collagen (Vegan), Collagen Amino Acids (Vegan), Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides Oil, Caprylyl Glycol, Acacia Decurrens Flower Wax, Polyglycerin-3, Tocopheryl Acetate, Euphorbia Cerifera (Candelilla) Wax/Euphorbia Cerifera Cera/Cire de Candelilla, Polyhydroxystearic Acid, Rebaudioside A, Tocopherol, Leuconostoc/Radish Root Ferment Filtrate, Flavor (Aroma), Linalool.",
        "n_loves": "943",
        "categories": [
            "Skincare",
            "Lip Balms & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/alive-prebiotic-balancing-moisturizer-P444973",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:00:59",
        "product_name": "ALIVE Prebiotic Balancing Moisturizer",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 2233237"
            }
        ],
        "rating": "width:58.824%",
        "product_reviews": "17",
        "ingredients": " -Zinc Oxide 13.65%: Sunscreen.Water, Caprylic/Capric Triglyceride, Coco-Caprylate, Glycerin, Glyceryl Behenate, Coco-Glucoside, Simmondsia Chinensis (Jojoba) Seed Oil, Cetearyl Alcohol, Glyceryl Caprylate, Sodium Stearoyl Glutamate, Parachlorella Beijerinckii Exopolysaccharides, Chlorella Vulgaris Extract, Lactococcus Ferment Lysate, Alteromonas Ferment Extract, Caesalpinia Spinosa Fruit Pod Extract, Helianthus Annuus (Sunflower) Sprout Extract, Caprylyl Glycol, Microcrystalline Cellulose, Polyglyceryl-3 Polyricinoleate, Xanthan Gum, Butylene Glycol, Isostearic Acid, Caprylhydroxamic Acid, Algin, Calcium Alginate, Propanediol, Maltodextrin, Lactic Acid, Sodium Benzoate, Sodium Chloride.",
        "n_loves": "609",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/algenist-blue-algae-vitamin-c-skinclarity-brightening-serum-P474809",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:01:13",
        "product_name": "Blue Algae Vitamin C Skinclarity Brightening Serum",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$98.00"
                ],
                "sku": "Item 2456465"
            }
        ],
        "rating": "width:91.48400000000001%",
        "product_reviews": "209",
        "ingredients": "-Patented Alguronic Acid: Reduces the appearance of lines and wrinkles and targets environmental stressors that cause visible signs of aging in skin.-Exclusive Blue Algae Vitamin C 100% (L-Ascorbic Acid from Spirulina): The most well-known form of blue-green algae that brightens complexion, visibly evens skin tone, and helps reduce the appearance of blemishes.-Skin-Forward Marine Ferment: A high protein content reinforces the skin matrix, reduces the appearance of pores, targets oxidative stress, and rejuvenates and hydrates skin.Water (Aqua, Eau), Caprylic/Capric Triglyceride, Propanediol, Glycerin, Butylene Glycol, Ascorbic Acid, Triheptanoin, Pseudoalteromonas Ferment Extract, C13-15 Alkane, Parachlorella Beijerinckii Exopolysaccharides, Biosaccharide Gum-1, Bakuchiol, Beta Vulgaris Root Extract, Hydrolyzed Corn Starch, Sodium Hyaluronate, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Corallina Officinalis Extract, Coccinia Indica Fruit Extract, Solanum Melongena Fruit Extract, Aloe Barbadensis Flower Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Curcuma Longa Root Extract, Ocimum Basilicum Flower/Leaf Extract, Ocimum Sanctum Leaf Extract, Salicylic Acid, Tocopherol, Sodium Polyacryloyldimethyl Taurate, Sodium Citrate, Phycocyanin, Lavandula Angustifolia Oil, Tanacetum Vulgare Extract, Tetrasodium Glutamate Diacetate, Potassium Sorbate, Caprylyl Glycol, Ethylhexylglycerin, Phenoxyethanol, Sodium Salicylate, Linalool, Limonene.",
        "n_loves": "7.4K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/algenist-mini-genius-liquid-collagen-P456990",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:01:26",
        "product_name": "Mini GENIUS Liquid Collagen ",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.21 oz/ 6.2 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2338317"
            }
        ],
        "rating": "width:70.77%",
        "product_reviews": "39",
        "ingredients": "-Patented Alguronic Acid: Naturally sourced and sustainably produced from algae, it’s clinically shown to visibly minimize appearance of fine lines and wrinkles, as well as boost the benefits of other active ingredients. -Exclusive Active Vegan Collagen™: High-concentration vegan collagen that helps to strengthen and condition the skin to visibly improve texture and suppleness. -Microalgae Oil: Hydrates, nurtures, and visibly restores skin's radiance, supporting skin cells for a softer look.  Collagen (Vegan)*, Water (Aqua, Eau), Propanediol, Isononyl Isononanoate, Butylene Glycol, Glycerin, Betaine, Pentylene Glycol, Dextrin Palmitate, Collagen Amino Acids (Vegan)*, Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides Oil, Helichrysum Stoechas Flower Extract, Cylindrotheca Fusiformis Extract, Niacinamide, Tocopherol, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, Adenosine, Helianthus Annuus (Sunflower) Seed Oil, Leuconostoc/Radish Root Ferment Filtrate, Caprylic/Capric Triglyceride, Palmitic Acid,  Disodium EDTA, Carbomer, Sodium Lactate, Amodimethicone, Homosalate, Polysorbate 20, Butyl Methoxydibenzoylmethane, 1,2-Hexanediol, Caprylyl Glycol, Octocrylene, Sodium Hydroxide, Phenoxyethanol, Fragrance (Parfum), Limonene, Beta-Carotene (CI 40800).*Vegan collagen is a new innovative technology created by binding together corn, soy, and wheat protein fibers resulting in vegan amino acids that structurally mimic and provide a function similar to animal-derived collagen used in cosmetic products.",
        "n_loves": "9.3K",
        "categories": [
            "Skincare",
            "Mini Size"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-liquid-collagen-lip-P432045",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:01:38",
        "product_name": "GENIUS Liquid Collagen Lip Treatment",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.34 oz/ 10 mL"
                ],
                "price": [
                    "$47.50"
                ],
                "sku": "Item 2063014"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: .5 oz / 15 mL"
                ],
                "price": [
                    "$39.00"
                ],
                "sku": "Item 2573491"
            }
        ],
        "rating": "width:77.62%",
        "product_reviews": "706",
        "ingredients": "-Patented Alguronic Acid®: Reduces the look of lines and wrinkles and fights against environmental damage.-Active Vegan Collagen™: Strengthens and conditions to visibly plump and improve the look of texture and suppleness.-Microalgae Oil: Hydrates, nurtures, and visibly restores radiance for a softer look.Collagen (Vegan)*, Water (Aqua, Eau), Glycerin, Isononyl Isononanoate, Limnanthes Alba (Meadowfoam) Seed Oil, Dextrin Palmitate, Pentylene Glycol, Diglycerin, Propanediol, Menthoxypropanediol, Collagen Amino Acids (Vegan)*, Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides Oil, Acmella Oleracea Extract, Brassica Alba Sprout Extract, Helianthus Annuus (Sunflower) Seed Oil, Hydroxymethoxyphenyl Propylmethylmethoxybenzofuran, Adenosine, Tocopherol, Leuconostoc/Radish Root Ferment Filtrate, Methyl Gluceth-20, Carbomer, Palmitic Acid, Sodium Hydroxide, Disodium EDTA, Amodimethicone, Butyl Methoxydibenzoylmethane, Homosalate, Octocrylene, Sorbic Acid, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Stevia Rebaudiana Extract, Aroma, Benzyl Benzoate, Beta-Carotene (CI 40800).*Vegan collagen is a new innovative technology created by binding together corn, soy, and wheat protein fibers resulting in vegan amino acids that structurally mimic and provide a function similar to animal-derived collagen used in cosmetic products.",
        "n_loves": "45.4K",
        "categories": [
            "Skincare",
            "Lip Balms & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/algenist-algae-peptide-regenerative-moisturizer-P503998",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:01:58",
        "product_name": "Algae Peptide Regenerative Moisturizer",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2 oz / 60 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$132.00"
                ],
                "sku": "Item 2612307"
            }
        ],
        "rating": "width:94.018%",
        "product_reviews": "214",
        "ingredients": "-Patented Alguronic Acid®: Visibly minimizes lines and wrinkles and improves firmness.-Omega-Rich Algae: Nourishes to help increase suppleness, firmness, and hydration for plumper-looking skin.-Milk Thistle Liposomes: Boost hydration to visibly smooth fine lines and skin texture.Water (Aqua, Eau), Caprylic/Capric Triglyceride, Dimethicone, Pentylene Glycol, Glycerin, Butylene Glycol, Butyrospermum Parkii (Shea) Butter, Sorbitan Stearate, Fomes Officinalis (Mushroom) Extract, PEG-100 Stearate, Glyceryl Stearate, Di-C12-15 Alkyl Fumarate, Limnanthes Alba (Meadowfoam) Seed Oil, Parachlorella Beijerinckii Exopolysaccharides, Alaria Esculenta Extract, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, Sodium Ascorbyl Phosphate, Tocopherol, Silybum Marianum Fruit Extract, Lecithin, Biotin, Ergothioneine, Eucalyptus Globulus Leaf Oil, Carnosine, Sodium Lactate, PEG-40 Hydrogenated Castor Oil, Dimethicone/PEG-10/15 Crosspolymer, Cetyl Alcohol, Stearic Acid, Carbomer, Aminomethyl Propanol, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Caprylyl Glycol, Mannitol, Hexylene Glycol, Disodium EDTA, Polysorbate 20, Ethylhexylglycerin, Phenoxyethanol, Limonene.",
        "n_loves": "1.2K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-ultimate-anti-aging-cream-P384537",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:02:13",
        "product_name": "GENIUS Ultimate Anti-Aging Cream",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$151.00"
                ],
                "sku": "Item 1582477"
            }
        ],
        "rating": "width:84.892%",
        "product_reviews": "507",
        "ingredients": " -Patented Alguronic Acid: Naturally sourced and sustainably produced from algae, it’s clinically shown to visibly minimize appearance of fine lines and wrinkles, as well as boost the benefits of other active ingredients. -Microalgae Oil: Hydrates, nurtures, and visibly restores skin's radiance, supporting skin cells for a softer look. -Vegan Collagen: Helps to strengthen and condition the skin to visibly improve texture and suppleness.  Water (Aqua, Eau), Caprylic/Capric Triglyceride, Hydrogenated Polyisobutene, Glycerin, Chlorella Protothecoides Oil, Dimethicone, Butylene Glycol, Glyceryl Stearate, PEG-100 Stearate, Butyrospermum Parkii (Shea) Butter, Pentylene Glycol, Potassium Cetyl Phosphate, Parachlorella Beijerinckii Exopolysaccharides, Collagen (Vegan)*,  Ceramide NP, Cynara Scolymus (Artichoke) Leaf Extract, Retinyl Palmitate, Astragalus Membranaceus Root Extract, Atractylodes Macrocephala Root Extract,  Iris Florentina Root Extract, Bupleurum Falcatum Root Extract, Copper Lysinate/Prolinate, Methylglucoside Phosphate, Stearalkonium Bentonite, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Silica, Caprylyl Glycol, Sodium Hydroxide, Disodium EDTA, Ethylhexylglycerin, Cetyl Alcohol, Propylene Carbonate, Quartz, Phenoxyethanol,  Leuconostoc/Radish Root Ferment Filtrate, Chlorphenesin, Fragrance (Parfum), Coumarin.",
        "n_loves": "20.3K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/algenist-genius-collagen-calming-relief-P453818",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:02:27",
        "product_name": "GENIUS Collagen Calming Relief",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.35 oz/ 40 mL"
                ],
                "price": [
                    "$78.00"
                ],
                "sku": "Item 2282408"
            }
        ],
        "rating": "width:89.44800000000001%",
        "product_reviews": "127",
        "ingredients": "-Active Vegan Collagen™: Helps reduce the appearance of irritation and stress-induced skin aging. -Alguronic Acid: Helps improve the look of fine lines and wrinkles, promote hydration, and fight environmental assaults that cause skin the look of redness, sensitivity, and signs of aging. -Calendula: Calms, soothes, and reduces the appearance of redness to treat compromised skin.  Water (Aqua, Eau), Collagen (Vegetable)*, Squalane, Glycerin, Hydrogenated Polyisobutene, Dimethicone, Butyrospermum Parkii (Shea) Butter, Palmitic Acid, Simmondsia Chinensis (Jojoba) Seed Oil, Persea Gratissima (Avocado) Oil, Helianthus Annuus (Sunflower) Seed Oil, Stearic Acid, Cetearyl Alcohol, PEG-100 Stearate, Glyceryl Stearate, Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides Oil, Beta-Glucan, Calendula Officinalis Flower Extract, Enteromorpha Compressa Extract, Leontopodium Alpinum Extract, Hydroxyphenyl Propamidobenzoic Acid, Tocopherol, Collagen Amino Acids, Bisabolol, Ocimum Sanctum Leaf Extract, Silybum Marianum Fruit Extract, Coelastrella Vacuolata Oil, Watanabea Reniformis Oil, Citric Acid, Ascorbyl Palmitate, Propanediol, Ceteareth-20, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Pentylene Glycol, Butylene Glycol, Ethyhexylglycerin, Hexylene Glycol, Sodium Hydroxide, Disodium EDTA, 1,2-Hexanediol, Leuconostoc/Radish Root Ferment Filtrate, Sodium Benzoate, Caprylyl Glycol, Phenoxyethanol.",
        "n_loves": "12.4K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-ultimate-anti-aging-melting-cleanser-P388200",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:02:42",
        "product_name": "GENIUS Ultimate Anti-Aging Melting Cleanser",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$51.50"
                ],
                "sku": "Item 1649771"
            }
        ],
        "rating": "width:81.13%",
        "product_reviews": "336",
        "ingredients": " -Alguronic Acid: Improves the appearance of firmness which results in more toned and younger-looking skin.\n-Microalgae Oil: Keeps the skin hydrated five times longer than untreated skin over a 24-hour period.\n-Bilberry Seed, Avocado, and Olive Oils: Soften and nourish the skin.\nC12-15 Alkyl Benzoate, Ethylhexyl Palmitate, Caprylic/Capric Triglyceride, Glycerin, Water (Aqua), Sucrose Laurate, Olea Europaea (Olive) Fruit Oil, Persea Gratissima (Avocado) Oil, Chlorella Protothecoides Oil, Algae Exopolysaccharides, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Vaccinium Myrtillus Seed Oil, Retinyl Palmitate, Tocopheryl Acetate, Caprylyl Glycol, Chlorphenesin, Phenoxyethanol, Fragrance (Parfum), Benzyl Benzoate, Chromium Oxide Greens (CI 77288).",
        "n_loves": "9.8K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/algenist-genius-liquid-skin-resurfacing-toner-P480274",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:02:55",
        "product_name": "GENIUS Liquid Skin Resurfacing 2% BHA Toner",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 2527075"
            }
        ],
        "rating": "width:96.84200000000001%",
        "product_reviews": "228",
        "ingredients": "-Patented Alguronic Acid®: Reduces the look of lines and wrinkles while addressing environmental damage. -Vegan Collagen: A visibly plumping ingredient that makes skin feel smoother and more supple. -BHA (Salicylic Acid) 2%: Exfoliates, unclogs pores, and visibly refines skin’s texture. Water (Aqua, Eau), Propanediol, Salicylic Acid, Niacinamide, Collagen Amino Acids, Parachlorella Beijerinckii Exopolysaccharides, Collagen, Azelaic Acid, Glycolic Acid, Decyl Glucoside, Eucalyptus Globulus Leaf Extract, Lauryl Glucoside, Rosmarinus Officinalis (Rosemary) Extract, Mentha Piperita (Peppermint) Extract, Citrus Limon (Lemon) Fruit Extract, Dextrin, Amylopectin, Polydextrose, Leuconostoc/Radish Root Ferment Filtrate, Tocopherol, Ethylhexylglycerin, Sodium Hydroxide, Phytic Acid, Butylene Glycol, Citric Acid, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol.",
        "n_loves": "6.8K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/alive-prebiotic-balancing-mask-P442859",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:03:07",
        "product_name": "ALIVE Prebiotic Balancing Mask",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$51.50"
                ],
                "sku": "Item 2211753"
            }
        ],
        "rating": "width:91.522%",
        "product_reviews": "243",
        "ingredients": " -Patented Alguronic Acid: Clinically proven to visibly minimize appearance of fine lines and wrinkles, and boost benefits of other active ingredients.-Algae Prebiotic: Helps to balance skin's microbiome; prebiotics are the food that probiotics thrive on to be more effective-Kaolin & Bentonite Clays: Draw out toxins and impurities to refine the look of pores and clean skin, revealing radiance and luminosity for a brightened overall look. Glycerin, Water (Aqua, Eau), Sodium Cocoyl Glycinate, Propanediol, Kaolin, Lactococcus Ferment Lysate, Bentonite, Magnesium Aluminum Silicate, Maltooligosyl Glucoside, Myristic Acid, Lactic Acid, Glyceryl Stearate, Algae Oligosaccharides, Chlorella Vulgaris Extract, Alteromonas Ferment Extract, Corallina Officinalis Extract, Curcuma Longa (Turmeric) Root Extract, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Ocimum Basilicum (Basil) Flower/Leaf Extract, Ocimum Sanctum Leaf Extract, Tocopherol, Hydrogenated Starch Hydrolysate, Cocamidopropyl Betaine, Sodium Methyl Oleoyl Taurate, Butylene Glycol, Coco-Glucoside, Lauryl Glucoside, Styrene/Acrylates Copolymer, Phytosteryl/Octyldodecyl Lauroyl Glutamate, Ethylhexylglycerin, Lauric Acid, Palmitic Acid, Cellulose Gum, Sucrose, Sodium Chloride, Mica, Sodium Benzoate, Phenoxyethanol, Titanium Dioxide, Iron Oxides (CI 77491), Manganese Violet (CI 77742), Chromium Hydroxide Green (CI 77289).",
        "n_loves": "14.9K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-sleeping-collagen-P439055",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:03:20",
        "product_name": "GENIUS Sleeping Collagen Moisturizer",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$132.00"
                ],
                "sku": "Item 2170827"
            }
        ],
        "rating": "width:90.754%",
        "product_reviews": "1.3K",
        "ingredients": " -Patented Alguronic Acid: Naturally sourced and sustainably produced from algae, it’s clinically shown to visibly minimize appearance of fine lines and wrinkles, as well as boost the benefits of other active ingredients. -Exclusive Active Vegan Collagen™: High-concentration vegan collagen that helps to strengthen and condition the skin to visibly improve texture and suppleness. -Skin-Mimicking Ceramides and Mary Thistle: Helps to support skin barrier function, increasing hydration, reducing the appearance of wrinkles, increasing the look of firmness and has antioxidants to protect skin from the appearance of oxidative aging.  Collagen (Vegan)*, Water (Aqua, Eau), Ethylhexyl Palmitate, Oryza Sativa (Rice) Bran Extract, Caprylic/Capric Triglyceride, Glycerin, Cetearyl Methicone, Dimethicone, Cetearyl Alcohol, Pyrus Malus (Apple) Fruit Extract, Chlorella Protothecoides Oil, Polysorbate 60, Glyceryl Glucoside , Polyglyceryl-2 Stearate, Parachlorella Beijerinckii Exopolysaccharides, Collagen Amino Acids (Vegan)*, Ceramide NP, Silybum Marianum Fruit Extract, Helianthus Annuus (Sunflower) Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Tocopherol, Carnosine, Sodium Stearoyl Glutamate, Caprylyl Glycol, Ammonium Acryloyldimethyltaurate/VP Copolymer, Ethylhexylglycerin, Hexylene Glycol, Citric Acid, Lecithin, Sodium Hydroxide, Sodium Phytate, t-Butyl Alcohol, Leuconostoc/Radish Root Ferment Filtrate, Phenoxyethanol, Triethyl Citrate, Vanillin, Amyl Salicylate, Benzyl Acetate, Cedrus Atlantica Bark Oil, Phenethyl Alcohol, Ionone, Linalool.*Vegan collagen is a new innovative technology created by binding together corn, soy, and wheat protein fibers resulting in vegan amino acids that structurally mimic and provide a function similar to animal-derived collagen used in cosmetic products.",
        "n_loves": "35.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-liquid-collagen-P421277",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:03:32",
        "product_name": "GENIUS Liquid Collagen® Serum",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$155.00"
                ],
                "sku": "Item 2610616"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.21 oz/ 6.2 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2338317"
            }
        ],
        "rating": "width:80.56599999999999%",
        "product_reviews": "1.2K",
        "ingredients": "-Patented Alguronic Acid®: Helps reduce the look of lines and wrinkles and fights environmental damage.-Active Vegan Collagen™: Helps support and condition the skin to visibly plump and improve the look of texture and suppleness.-Microalgae Oil: Hydrates, nurtures, and visibly restores radiance for a softer look.Collagen (Vegan)*, Water (Aqua, Eau), Propanediol, Isononyl Isononanoate, Butylene Glycol, Glycerin, Betaine, Pentylene Glycol, Dextrin Palmitate, Collagen Amino Acids (Vegan)*, Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides Oil, Helichrysum Stoechas Flower Extract, Cylindrotheca Fusiformis Extract, Niacinamide, Tocopherol, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, Adenosine, Helianthus Annuus (Sunflower) Seed Oil, Leuconostoc/Radish Root Ferment Filtrate, Caprylic/Capric Triglyceride, Palmitic Acid, Disodium EDTA, Carbomer, Sodium Lactate, Amodimethicone, Homosalate, Polysorbate 20, Butyl Methoxydibenzoylmethane, 1,2-Hexanediol, Caprylyl Glycol, Octocrylene, Sodium Hydroxide, Phenoxyethanol, Fragrance (Parfum), Limonene, Beta-Carotene (CI 40800).*Vegan collagen is a new, innovative technology created by binding together corn, soy, and wheat protein fibers resulting in vegan amino acids that structurally mimic and provide a function similar to animal-derived collagen used in cosmetic products.",
        "n_loves": "69.7K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/genius-liquid-collagen-body-mylk-P449162",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:03:45",
        "product_name": "GENIUS Liquid Collagen Body Mylk",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 7.7 oz/ 230 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$84.00"
                ],
                "sku": "Item 2239937"
            }
        ],
        "rating": "width:76.842%",
        "product_reviews": "19",
        "ingredients": "-Alguronic Acid: Provides anti-aging and anti-wrinkle benefits.-Active Vegan Collagen: Helps to strengthen and condition the skin to visibly improve resiliency and bounce.-Lactic Acid: Revitalizes skin and evens skin tone.Water (Aqua, Eau), Glycerin, Butylene Glycol, Caprylic/Capric Triglyceride, Niacinamide, Butyrospermum Parkii Butter, Persea Gratissima Oil, Collagen, Simmondsia Chinensis Oil, Stearic Acid, Xylitol, Silica, Lactic Acid, Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides Oil, Collagen Amino Acids, Benzyl Alcohol, Hydrogenated Lecithin, Squalene, Limnanthes Alba Seed Oil, Xanthan Gum, Aloe Barbadensis Leaf Juice, Sodium Benzoate, Potassium Sorbate, Parfum, Tromethamine, Sodium Polyacrylate, Phenoxyethanol, Hydrogenated Starch Hydrolysate, Tocopheryl Acetate, BHT, Coumarin, Leuconostoc/Radish Root Ferment Filtrate, Aphanizomenon Flos-Aquae Extract. ",
        "n_loves": "2.8K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/overnight-restorative-cream-P296415",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:04:01",
        "product_name": "Overnight Restorative Cream",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$127.00"
                ],
                "sku": "Item 1357847"
            }
        ],
        "rating": "width:87.666%",
        "product_reviews": "240",
        "ingredients": " -Alguronic Acid: Supports natural cell regeneration and elastin synthesis.-Vitamins C and E: Visibly boosts skin radiance.-Peptides: Helps support natural collagen to strengthen skin structure.-Crithmum Maritimum Extract: Nutures natural cell renewal to increase skin density.Water, Isopropyl Isostearate, Butyrospermum Parkii Butter (Butyrospermum Parkii (Shea Butter)), Glycerin, Stearic Acid, Squalane, Butylene Glycol, Dimethicone, Glyceryl Stearate SE, Cetearyl Alcohol, Dimethicone Crosspolymer, Ascorbyl Glucoside, Pentylene Glycol, Algae Exopolysaccharides, Algae Extract, Tocopheryl Acetate, Citrullus Vulgaris Fruit Extract (Citrullus Vulgaris (Watermelon) Fruit Extract), Lens Esculenta Fruit Extract (Lens Esculenta (Lentil) Fruit Extract), Oleanolic Acid, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7, Pyrus Malus Fruit Extract (Pyrus Malus (Apple) Fruit Extract), Enantia Chlorantha Bark Extract, Crithmum Maritimum Extract, Silybum Marianum Seed Oil, Caprylic/Capric Triglyceride, Ceteareth-20, Dimethicone, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Hydroxide, Caprylyl Glycol, Hydrogenated Vegetable Oil, Hexylene Glycol, Phenoxyethanol, Disodium EDTA, Fragrance, Sodium PCA, Carbomer, Polysorbate 20, Sodium Lactate, Ethylhexylglycerin.",
        "n_loves": "10.7K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/elevate-advanced-retinol-serum-P433469",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:04:13",
        "product_name": "ELEVATE Advanced Retinol Serum",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$132.00"
                ],
                "sku": "Item 2062990"
            }
        ],
        "rating": "width:82.326%",
        "product_reviews": "43",
        "ingredients": " -Patented Alguronic Acid: visibly minimizes the appearance of fine lines and wrinkles, and boosts the benefits of other active ingredients.-Green Algae Encapsulated Retinol: Visibly helps reduce the appearance of lines and wrinkles, smoothing texture.-Skin Firming Peptides: Visibly firms skin to help even tone, providing an overall smoothing effect. Water (Aqua, Eau), Dimethicone, Glycerin, Butylene Glycol, Pentylene Glycol, Polymethyl Methacrylate, Dimethicone Crosspolymer, Retinol, Parachlorella Beijerinckii Exopolysaccharides, Dunaliella Salina Extract, Ceramide NP, Myristoyl Nonapeptide-3, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, Acetyl Dipeptide-1 Cetyl Ester, Glycine Soja (Soybean) Extract, Tocopherol, Squalane, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Caprylic/Capric Triglyceride, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sodium PCA, Polysorbate 20, Dipotassium Glycyrrhizate, Sorbitan Laurate, Dimethicone/PEG-10/15 Crosspolymer, Sodium Hydroxide, Cetyl Palmitate, Hydrogenated Polydecene, Laureth-23, Polysorbate 60, Disodium EDTA, Hydroxyethylcellulose, Carbomer, Sodium Lactate, Sorbitan Isostearate, Trideceth-6 Phosphate, Dipropylene Glycol, Sodium Citrate, Mica, Caprylyl Glycol, Chlorphenesin, Phenoxyethanol, Fragrance (Parfum), Linalool, Titanium Dioxide (CI 77891).",
        "n_loves": "5.6K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/aa-barrier-serum-P447504",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:04:25",
        "product_name": "AA (Alguronic Acid) Barrier Serum",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$115.00"
                ],
                "sku": "Item 2255503"
            }
        ],
        "rating": "width:78.812%",
        "product_reviews": "101",
        "ingredients": " -Patented Alguronic Acid: Helps fortify skin barrier and visibly smooth fine lines and wrinkles.-Phloretin: An antioxidant that works to protect skin while visibly soothing skin and evening tone.-Niacinamide: Helps boost barrier performance and improve the appearance of redness and dull, sallow skin.-Ergothioneine: Large spectrum antioxidant that neutralizes ozone pollution and recycles vitamin C. Water (Aqua, Eau), Butylene Glycol, PEG-8 Dimethicone, Propanediol, Caprylyl Methicone, Dimethicone, Parachlorella Beijerinckii Exopolysaccharides, Phloretin, Ergothioneine, Copper Palmitoyl Heptapeptide-14, Heptapeptide-15 Palmitate, Epigallocatechin Gallate, Tocopheryl Acetate, Aspartic Acid, PCA, Disodium EDTA, Alanine, Serine, Valine, Isoleucine, Proline, Threonine, Lactic Acid/Glycolic Acid Copolymer, Polyvinyl Alcohol, Histidine, Phenylalanine, Arginine, Ascorbic Acid, Octyldodecanol, Pyridoxine HCl, Retinyl Palmitate, Silica, Sodium Propoxyhydroxypropyl Thiosulfate Silica, Glycerin, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Ammonium Acryloyldimethyltaurate/VP Copolymer, Pentylene Glycol, Isohexadecane, Adenosine Triphosphate, Hydrolyzed Oat Protein, Niacinamide, Citric Acid, Polysorbate 60, Sorbitan Isostearate, Sodium PCA, Sodium Phytate, Sodium Lactate, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol.",
        "n_loves": "4.2K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/power-advanced-wrinkle-fighter-360-eye-serum-P404169",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:04:37",
        "product_name": "POWER Advanced Wrinkle Fighter 360° Eye Serum",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$95.00"
                ],
                "sku": "Item 1772821"
            }
        ],
        "rating": "width:81.304%",
        "product_reviews": "92",
        "ingredients": "Water, Dimethicone, Isododecane, Glycerin, Butylene Glycol, Polysilicone-11, Isohexadecane, Pentylene Glycol, Algae Exopolysaccharides, Chlorella Protothecoides, Plantago Lanceolata Leaf Extract, Darutoside, Polygonum Bistorta Root Extract, Nannochloropsis Oculata Extract, Albizia Julibrissin Bark Extract, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, N-Hydroxysuccinimide, Chrysin, Mica, Adenosine, Ammonium Polyacryloyldimethyl Taurate, Polysorbate 20, Polysorbate 80, Pullulan, Tocopheryl Acetate, Steareth-20, Disodium EDTA, Chlorhexidine Digluconate, Citric Acid, Sodium Hydroxide, Xanthan Gum, Ethylhexylglycerin, Hexylene Glycol, Caprylyl Glycol, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol.",
        "n_loves": "9.6K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/algenist-blue-algae-vitamin-c-brightening-peel-P472963",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:04:49",
        "product_name": "Blue Algae Vitamin C Brightening Peel",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 45 mL"
                ],
                "price": [
                    "$115.00"
                ],
                "sku": "Item 2464220"
            }
        ],
        "rating": "width:83.09%",
        "product_reviews": "110",
        "ingredients": "-Alguronic Acid: A patented and exclusive ingredient from algae that reduces the appearance of fine lines and wrinkles and fights environmental assaults that cause visible aging in skin. -Exclusive Spirulina-Derived Vitamin C (L-Ascorbic Acid) and Phycocyanin: Fight dark spots and discoloration for brighter-looking skin with a more translucent, even appearance.-Triple Acid Complex (T.A.C.™): Visibly reduces dark spots (without drying out skin), minimizes pores, smooths uneven texture, and cleans out debris.  Glycerin, Carthamus Tinctorius (Safflower) Seed Oil, Helianthus Annuus (Sunflower) Seed Oil, Limnanthes Alba (Meadowfoam) Seed Oil, Glycolic Acid, Gluconolactone, Polyglyceryl-10 Behenate/Eicosadioate, Aminomethyl Propanol, Ascorbic Acid, Mandelic Acid, Glyceryl Behenate/Eicosadioate, Oleth-5, Bisabolol, Menthoxypropanediol, Spirulina Platensis Extract, Parachlorella Beijerinckii Exopolysaccharides, Citric Acid, Azelaic Acid, Tranexamic Acid, Malic Acid, Salicylic Acid, Dipotassium Glycyrrhizate, Tocopheryl Acetate, Tanacetum Annuum Flower Oil, Lavandula Angustifolia (Lavender) Oil, Sodium Hylauronate, Coccinia Indica Fruit Extract, Solanum Melongena (Eggplant) Fruit Extract, Aloe Barbadensis Flower Extract, Curcuma Longa (Turmeric) Root Extract, Ocimum Basilicum (Basil) Flower/Leaf Extract, Ocimum Sanctum Leaf Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Tocopherol, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Corallina Officinalis Extract, Glyceryl Stearate SE, Sodium Citrate, Euphorbia Cerifera (Candelilla) Wax, Behenyl Alcohol, Polyglyceryl-3 Stearate, Ethylhexylglycerin, Water (Aqua, Eau), Phenoxyethanol.",
        "n_loves": "1.2K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/elevate-firming-lifting-neck-cream-P449164",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:05:00",
        "product_name": "ELEVATE Firming & Lifting Neck Cream",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$113.00"
                ],
                "sku": "Item 2282390"
            }
        ],
        "rating": "width:77.778%",
        "product_reviews": "18",
        "ingredients": " -Alguronic Acid: A patented and powerful compound that demonstrates significant properties to rejuvenate the skin for a more youthful appearance. -Protein and Peptide Complex: Visibly tightens and lifts skin. ",
        "n_loves": "5.5K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Decollete & Neck Creams"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/10-day-results-kit-P500716",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:05:12",
        "product_name": "10 Day Results Kit",
        "brand_name": "Algenist",
        "options": [],
        "rating": "width:96.062%",
        "product_reviews": "259",
        "ingredients": "-Patented Alguronic Acid: Reduces the look of lines and wrinkles while fighting environmental damage. -Active Vegan Collagen™: Fortifies and conditions skin, visibly improving texture and suppleness.-Triple-Algae Blend (Red, Brown, and Green): Targets varying causes and tones of dark circles. GENIUS Liquid Collagen:Collagen (Vegan), Water (Aqua, Eau), Propanediol, Isononyl Isononanoate, Butylene Glycol, Glycerin, Betaine, Pentylene Glycol, Dextrin Palmitate, Collagen Amino Acids (Vegan), Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides Oil, Helichrysum Stoechas Flower Extract, Cylindrotheca Fusiformis Extract, Niacinamide, Tocopherol, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, Adenosine, Helianthus Annuus (Sunflower) Seed Oil, Leuconostoc/Radish Root Ferment Filtrate, Caprylic/Capric Triglyceride, Palmitic Acid, Disodium EDTA, Carbomer, Sodium Lactate, Amodimethicone, Homosalate, Polysorbate 20, Butyl Methoxydibenzoylmethane, 1,2-Hexanediol, Caprylyl Glycol, Octocrylene, Sodium Hydroxide, Phenoxyethanol, Fragrance (Parfum), Limonene, Beta-Carotene (CI 40800).Triple Algae Eye Renewal Balm with Multi-Peptide Complex:Aqua (Water/Eau), Stearic Acid, Isopropyl Isostearate, Dimethicone, Glycerin, PentyleneGlycol, Glyceryl Stearate SE, Cetearyl Alcohol, Butyrospermum Parkii (Shea) Butter, C12-15 Alkyl Benzoate, Limnanthes Alba (Meadowfoam) Seed Oil, Parachlorella Beijerinckii Exopolysaccharides, Corallina Officinalis Extract, Dunaliella Salina Extract, Undaria Pinnatifida Extract, Dipeptide-2, Palmitoyl Tetrapeptide-7, Palmitoyl Hexapeptide-12, Palmitoyl Tripeptide-5, Sodium Hyaluronate, Caffeine, Coffea Arabica (Coffee) Seed Oil, Tribehenin, Ceramide NG, PEG-10 Phytosterol, Tetrahexyldecyl Ascorbate, Aloe Barbadensis Leaf Juice, Tocopheryl Acetate, Bambusa Vulgaris Leaf/Stem Extract, Pisum Sativum (Pea)Extract, Glucosamine HCl, Leuconostoc/Radish Root Ferment Filtrate, Camellia Sinensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Dimethicone Crosspolymer, Panthenol, Pantolactone, Caprylyl/Capryl Glucoside, Pfaffia Paniculata Root Extract, Ptychopetalum Olacoides Bark/Stem Extract, Lilium Candidum Flower Extract, Rubus Idaeus (Raspberry) Leaf Extract, Aloe Barbadensis Leaf Juice Powder, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Phospholipids, Ceteareth-20, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Aminomethyl Propanol, Caprylyl Glycol, Lactic Acid, Ethylhexylglycerin, Hexylene Glycol, Hesperidin Methyl Chalcone, Steareth-20, Citric Acid, Sodium Citrate, Chlorhexidine Digluconate, Phenoxyethanol, Potassium Sorbate, Benzyl Alcohol, Sodium Benzoate.GENIUS Ultimate Anti-Aging Cream:Water (Aqua, Eau), Caprylic/Capric Triglyceride, Hydrogenated Polyisobutene, Glycerin, Chlorella Protothecoides Oil, Dimethicone, Butylene Glycol, Glyceryl Stearate, PEG-100 Stearate, Butyrospermum Parkii (Shea) Butter, Pentylene Glycol, Potassium Cetyl Phosphate, Parachlorella Beijerinckii Exopolysaccharides, Collagen (Vegan), Ceramide NP, Cynara Scolymus (Artichoke) Leaf Extract, Retinyl Palmitate, Astragalus Membranaceus Root Extract, Atractylodes Macrocephala Root Extract, Iris Florentina Root Extract, Bupleurum Falcatum Root Extract, Copper Lysinate/Prolinate, Methylglucoside Phosphate, Stearalkonium Bentonite, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Silica, Caprylyl Glycol, Sodium Hydroxide, Disodium EDTA, Ethylhexylglycerin, Cetyl Alcohol, Propylene Carbonate, Quartz, Phenoxyethanol, Leuconostoc/Radish Root Ferment Filtrate, Chlorphenesin, Fragrance (Parfum), Coumarin.",
        "n_loves": "5.9K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/advanced-anti-aging-repairing-oil-P379907",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:05:22",
        "product_name": "Advanced Anti-Aging Repairing Oil",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$111.00"
                ],
                "sku": "Item 1545748"
            }
        ],
        "rating": "width:88.82600000000001%",
        "product_reviews": "247",
        "ingredients": " -Microalgae Oil: Improves the appearance of firmness for visibly smooth and toned skin.\n-Ceramides: Retain and balance natural moisture levels, increase water-retention capacity, and reduce the appearance of fine lines and wrinkles by supporting skin’s natural lipid barrier.  \n-Brown Algae Extract: Restores skin’s firmness and elasticity and visibly reduces the number and depth of wrinkles.\n-Rosemary Extract and Sunflower Seed Oil: Protect skin from free-radical damage with a natural antioxidant complex. \n   \nChlorella Protothecoides Oil, Cetearyl Ethylhexanoate, Isopropyl Isostearate, Caprylic/Capric Triglyceride, Ceramide 3, Alaria Esculenta Extract, Retinyl Palmitate, Tocopherol, Rosmarinus Officinalis Leaf Extract, Helianthus Annuus Seed Oil, Cymbopogon Martini Oil, Geraniol. \n\n\n\n  \n",
        "n_loves": "11.4K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Face Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/green-microalgae-retinol-regenerating-serum-P506077",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:05:34",
        "product_name": "Green Microalgae Retinol + Regenerating Serum",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL",
                    "NEW"
                ],
                "price": [
                    "$115.00"
                ],
                "sku": "Item 2672301"
            }
        ],
        "rating": "width:97.682%",
        "product_reviews": "138",
        "ingredients": "-Patented Alguronic Acid®: Minimizes the look of lines and wrinkles while boosting the efficacy of other ingredients.-Green Microalgae Bio-Retinol and Time-Release Retinol: Visibly reduce deep wrinkles and smooth skin’s texture without irritation.-AHA, BHA, and PHA: Visibly resurface skin and improve bio-retinol and retinol delivery.Water (Aqua, Eau), Glycerin, Cetyl Esters, Chlorella Vulgaris Extract, Retinol, Parachlorella Beijerinckii Exopolysaccharides, Salicylic Acid, Lactic Acid, Glycolic Acid, Phytic Acid, Gluconolactone, Tocopherol, Panthenol, Sodium PCA, Allantoin, Bisabolol, Humulus Lupulus (Hops) Extract, Helianthus Annuus (Sunflower) Seed Oil, Copernicia Cerifera (Carnauba) Wax/ Copernicia Cerifera Cera/ Cire de Carnauba, Lecithin, Xanthan Gum, Polysorbate 20, Polyacrylate Crosspolymer-6, Disodium Cocoamphodiacetate, Citric Acid, Ethyl Ferulate, Sodium Hydroxide, Hydroxyacetophenone, 1,2-Hexanediol, Caprylyl Glycol, Ethylhexylglycerin, Pentylene Glycol, Tridecane, Undecane, Propanediol.",
        "n_loves": "373",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/power-advanced-wrinkle-fighter-moisturizer-P404168",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:05:46",
        "product_name": "POWER Advanced Wrinkle Fighter Moisturizer",
        "brand_name": "Algenist",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$115.00"
                ],
                "sku": "Item 1772813"
            }
        ],
        "rating": "width:83.636%",
        "product_reviews": "77",
        "ingredients": "Water, Glycerin, C12-15 Alkyl Benzoate, Caprylic/Capric Triglyceride, Palmitic Acid, Stearic Acid, Chlorella Protothecoides, Algae Exopolysaccharides, Citrullus Vulgaris (Watermelon) Fruit Extract, Hydrolyzed Myrtus Communis Leaf Extract, Lens Esculenta (Lentil) Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Collagen, Sodium PCA, Ribose, Sodium Lactate, Leuconostoc/Radish Root Ferment Filtrate, Butyrospermum Parkii (Shea) Butter, Dimethicone, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Glyceryl Stearate, Glyceryl Stearate SE, Cetearyl Alcohol, Sodium Hydroxide, Disodium EDTA, Xanthan Gum, Magnesium Chloride, Potassium Sorbate, Sodium Benzoate, Citric Acid, Ethylhexylglycerin, Chlorphenesin, Caprylyl Glycol, Phenoxyethanol, Fragrance.",
        "n_loves": "5.4K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pure-genius-collection-kit-P425424",
        "error": "",
        "scrape_timestamp": "08/21/2023, 08:05:59",
        "product_name": "Pure GENIUS Collection Kit",
        "brand_name": "Algenist",
        "options": [],
        "rating": "width:74.934%",
        "product_reviews": "75",
        "ingredients": "-Plant-derived Collagen: Gives skin a firmer, more lifted appearance.-Patented Alguronic Acid: Supports the appearance of smoother, firmer skin.-Microalgae Oil: Keeps the skin hydrated five times longer than untreated skin over a 24-hour period.GENIUS Ultimate Anti-Aging Eye Cream:Water, Caprylic/Capric Triglyceride, Glycerin, Butyrospermum Parkii (Shea) Butter, Hydrogenated Polyisobutene, Chlorella Protothecoides Oil, Dimethicone, Glyceryl Stearate, PEG-100 Stearate, Cetearyl Alcohol, Cetyl Alcohol, Pentylene Glycol, Silica, Algae Exopolysaccharides, Vegetable Collagen, Algae Extract, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7, Copper Lysine Prolinate, Methyl Glucoside Phosphate, Albiza Julibrissin Bark Extract, Kigelia Africana Fruit Extract, Plantago Lanceolata Leaf Extract, Chrysin, Darutoside, Sodium PCA, Leuconostoc/Radish Root Ferment Filtrate, Stearic Acid, Ceteareth-20, Caprylyl Glycol, Steareth-20, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Butylene Glycol, Sodium Benzoate, Potassium Sorbate, Xanthan Gum, Chlorhexidine Digluconate, N-Hydroxysuccinimide, Chlorphenesin, Sodium Citrate, Disodium EDTA, Citric Acid, Sodium Hydroxide, Phenoxyethanol.GENIUS Ultimate Anti-Aging Cream:Water, Caprylic/Capric Triglyceride, Hydrogenated Polyisobutene, Glycerin, Chlorella Protothecoides Oil, Dimethicone, Butylene Glycol, Glyceryl Stearate, PEG-100 Stearate, Butyrospermum Parkii (Shea) Butter, Pentylene Glycol, Potassium Cetyl Phosphate, Algae Exopolysaccharides, Vegetable Collagen, Ceramide 3, Cynara Scolymus (Artichoke) Leaf Extract, Retinyl Palmitate, Astragalus Membranaceous Root Extract, Atractyloides Macrocephala Root Extract, Iris Florentina Root Extract, Bupleurum Falcatum Root Extract, Methyl Glucoside Phosphate Proline Lysine Copper Complex, Stearalkonium Bentonite, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Silica, Caprylyl Glycol, Sodium Hydroxide, Disodium EDTA, Ethylhexylglycerin, Cetyl Alcohol, Propylene Carbonate, Phenoxyethanol, Leuconostoc/Radish Root Ferment Filtrate, Chlorphenesin, Fragrance, Coumarin.GENIUS Ultimate Anti-Aging Melting Cleanser:C12-15 Alkyl Benzoate, Ethylhexyl Palmitate, Caprylic/Capric Triglyceride, Glycerin, Water, Sucrose Laurate, Olea Europaea (Olive) Fruit Oil, Persea Gratissima (Avocado) Oil, Chlorella Protothecoides Oil, Parachlorella Beijerinckii Exopolysaccharides, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Vaccinium Myrtillus Seed Oil, Retinyl Palmitate, Tocopheryl Acetate, PEG-12 Dimethicone, Caprylyl Glycol, Chlorphenesin, Phenoxyethanol, Fragrance, Chromium Oxide Greens (CI 77288).GENIUS Liquid Collagen:Collagen, Water, Propanediol, Isononyl Isononanoate, Butylene Glycol, Glycerin, Betaine, Pentylene Glycol, Dextrin Palmitate, Collagen Amino Acids, Parachlorella Beijerinckii Exopolysaccharides, Chlorella Protothecoides Oil, Helichrysum Stoechas Extract, Cylindrotheca Fusiformis Extract, Niacinamide, Tocopherol, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, Adenosine, Helianthus Annuus (Sunflower) Seed Oil, Leuconostoc / Radish Root Ferment Filtrate, Caprylic / Capric Triglyceride, Palmitic Acid,  Disodium EDTA, Carbomer, Sodium Lactate, Amodimethicone, Homosalate, Polysorbate 20, Butyl Methoxydibenzoylmethane, 1,2-Hexanediol, Caprylyl Glycol, Octocrylene, Sodium Hydroxide, Phenoxyethanol, Fragrance, Limonene, Beta-Carotene (CI 75130).",
        "n_loves": "11.9K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    }
]