[
    {
        "url": "https://www.sephora.com/ca/en/product/bb-thickening-dryspun-texture-spray-mini-P436391",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:32:30",
        "product_name": "Mini Thickening Dryspun Volume Texture Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2129468"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "55",
        "ingredients": " -PVP, VP/VA Copolymer: Provides light to medium hold.\n-PEG-12 Dimethicone and Hydrolyzed Wheat Protein: Nourishing agents.\t\n-Zeolite and Silk Powder: Provide texture and volume to hair. Hydrofluorocarbon 152a, Dimethyl Ether, Alcohol Denat., Vp/Va Copolymer, Zeolite, Silk Powder\\Serica\\Poudre De Soie, Helianthus Annuus (Sunflower) Seed Extract, Hydrolyzed Wheat Protein, Glycerin, PEG-12 Dimethicone, Phenethyl Benzoate, PVP, Fragrance, Linalool, Benzyl Benzoate, Hexyl Cinnamal, Butylphenyl Methylpropional, Limonene.\tPlease be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "21.4K",
        "categories": [
            "Hair",
            "Mini Size"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bond-building-repair-oil-serum-P506031",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:32:43",
        "product_name": "Bond-Building Repair Oil Serum",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.62 oz / 48 ml"
                ],
                "price": [
                    "$61.00"
                ],
                "sku": "Item 2653715"
            }
        ],
        "rating": "width:94.52000000000001%",
        "product_reviews": "292",
        "ingredients": "-Bond-Building Complex: Builds new bonds to strengthen hair.-Wildflower Honey and Honey Ferment-Blend of Daikon Radish Seed Oil and Apple Seed OilWater\\Aqua\\Eau, Polysorbate 20, Glycerin, Peg-40 Hydrogenated Castor Oil, Propanediol, Octyldodecyl Citrate Crosspolymer, Honey\\Mel\\Miel, Yeast Extract\\Faex\\Extrait De Levure, Raphanus Sativus (Radish) Seed Extract, Pyrus Malus (Apple) Seed Oil, Aleurites Moluccanus Seed Oil, Helianthus Annuus (Sunflower) Seed Oil, Glycine Soja (Soybean) Seed Extract, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Tocopherol, Hydroxypropylgluconamide, Hydroxypropylammonium Gluconate, Dihydroxypropyl Arginine Hcl, Panthenol, Polyacrylate Crosspolymer-6, Tartaric Acid, Linalool, Citral, Limonene, Benzyl Alcohol, T-Butyl Alcohol, Benzyl Salicylate, Benzyl Benzoate, Caprylyl Glycol, Butylene Glycol, Coumarin, Ascorbyl Palmitate, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Fragrance (Parfum), Disodium Edta, Bht, Phenoxyethanol, Potassium Sorbate, Sodium Benzoate.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "3.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Oil"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/surf-texturizing-finishing-foam-P500177",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:32:55",
        "product_name": "Surf Texturizing Finishing Foam",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.1 oz / 150 mL"
                ],
                "price": [
                    "$42.00"
                ],
                "sku": "Item 2537108"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "13",
        "ingredients": "-Sea Salt and Dead Sea Salt: Add texture, definition, grip, and grit.-Beach Protective Blend (Aloe Leaf Juice, Kelp Extract, Coconut Fruit Extract, Algae Extract, and UV Filters): Works to protect hair against the drying effects of the sun.Water, Vp/Va Copolymer, Isobutane, Propane, Zeolite, Cetearyl Alcohol, Cocamidopropyl Betaine, Sea Salt\\Maris Sal\\Sel Marin, Cocos Nucifera (Coconut) Fruit Extract, Hypnea Musciformis (Algae) Extract, Gelidiella Acerosa Extract, Tocopheryl Acetate, Glycerin, PEG-12 Dimethicone, Hydrolyzed Wheat Protein, Magnesium Chloride, Ethylhexylglycerin, Hydrolyzed Wheat Starch, Caprylyl Glycol, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Panthenol, Tocopherol, Steapyrium Chloride, Silica, Sodium Chloride, Citric Acid, Lauryl Methyl Gluceth-10 Hydroxypropyldimonium Chloride, Potassium Chloride, Polyquaternium-7, Fragrance (Parfum), Citronellol, Alpha-Isomethyl Ionone, Limonene, BHT, Sodium Benzoate, Potassium Sorbate, Sorbic Acid, Phenoxyethanol .",
        "n_loves": "2.2K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/a-tint-of-brown-hair-powder-P280526",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:33:09",
        "product_name": "Brownish Hair Powder",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.4 oz/ 130 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 1270388"
            }
        ],
        "rating": "width:62.244%",
        "product_reviews": "508",
        "ingredients": "Dimethyl Ether, Alcohol Denat., Propylene Glycol, Aluminum Starch Octenylsuccinate, Vp/Va Copolymer, Silica, Water, Methyl Methacrylate Crosspolymer, Magnesium Carbonate, Talc, Iron Oxides (Ci 77491, Ci 77492, Ci 77499) .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "8.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/repair-blow-dry-P391796",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:33:22",
        "product_name": "Repair Blow Dry",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1668045"
            }
        ],
        "rating": "width:92.13%",
        "product_reviews": "460",
        "ingredients": " -Hair Repair Technology: Repairs split ends, restores hair’s healthy look and feel, and protects against breakage. -Resurrection Plant Extracts: These extracts from rose of Jericho and pale lilac contain special components that help them survive drought stress.\t\t-Heat-Protecting Shield: Safeguards hair from heat damage.Water, Dimethicone, Peg/Ppg-18/18 Dimethicone, Cetyl Alcohol, Distearyldimonium Chloride, Propanediol, Beta Vulgaris (Beet) Root Extract/Beta Vulgaris/Extrait De Racine De Betterave, Anastatica Hierochuntica (Rose Of Jericho) Extract, Haberlea Rhodopensis Leaf Extract, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Glycerin, Cetearyl Alcohol, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Wheat Protein Pg-Propyl Silanetriol, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Bis-Cetearyl Amodimethicone, Polyquaternium-37, Dimethiconol, Polyquaternium-11, Behentrimonium Chloride, Caprylyl Glycol, Panthenol, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Butylene Glycol, Yeast Extract/Faex/Extrait De Levure, Sodium Chloride, Fragrance, Hexyl Cinnamal, Linalool, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Limonene, Geraniol, Butylphenyl Methylpropional, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "25K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-seaweed-conditioner-P506337",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:33:34",
        "product_name": "Seaweed Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 6.7 oz / 200 ml",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2653723"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 33.3 oz / 1000 ml"
                ],
                "price": [
                    "$153.00"
                ],
                "sku": "Item 2659159"
            }
        ],
        "rating": "width:91.556%",
        "product_reviews": "90",
        "ingredients": "Water/Aqua/Eau, Cetearyl Alcohol, Cetyl Alcohol, Glycerin, Stearamidopropyl Dimethylamine, Capryloyl Glycerin/Sebacic Acid Copolymer, Cetyl Esters, Macrocystis Pyrifera (Kelp) Extract, Laminaria Saccharina Extract, Chlorella Vulgaris Extract, Lactobacillus Ferment, Cocos Nucifera (Coconut) Oil, Helianthus Annuus (Sunflower) Seed Oil, Behentrimonium Chloride, Triheptanoin, Guar Hydroxypropyltrimonium Chloride, Hydrogenated Ethylhexyl Olivate, Butylene Glycol, Hydrogenated Olive Oil Unsaponifiables, Pyridoxine Hcl, Panthenol, Diheptyl Succinate, Cetrimonium Chloride, C13-15 Alkane, Citric Acid, Zinc Sulfate, Chlorophyllin-Copper Complex, Sodium Hydroxide, Fragrance (Parfum), Limonene, Ascorbyl Palmitate, Tocopherol, Phenoxyethanol, Chlorphenesin, Potassium Sorbate, Sodium Benzoate, Annatto (CI 75120). Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients. ",
        "n_loves": "1.4K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-s-invisible-oil-primer-P386464",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:33:49",
        "product_name": "Hairdresser’s Invisible Oil Heat Protectant Leave In Conditioner Primer",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1602960"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 1638386"
            }
        ],
        "rating": "width:91.178%",
        "product_reviews": "2.8K",
        "ingredients": "-Signature 6-Oil Blend: Provides conditioning, moisture, nourishment, softening, and smoothing. -UV Filters: Protects from the drying effects of the sun. Water\\Aqua\\Eau, Cetearyl Alcohol, Butylene Glycol, PEG-12 Glyceryl Dimyristate, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Taitensis Flower Extract, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Dimethicone, Glycerin, Sodium Hyaluronate, Behentrimonium Methosulfate, Distearyldimonium Chloride, Dimethiconol, Cetrimonium Chloride, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Sodium Chloride, Citric Acid, BHT, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Limonene, Potassium Sorbate, Phenoxyethanol. The Signature 6-Oil Blend Includes: Cocos Nucifera (Coconut) Oil, Argania Spinosa Kernel (Argan) Oil, Vitis Vinifera (Grape) Seed Oil, Macadamia Integrifolia Seed (Macadamia) Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, and Carthamus Tinctorius (Safflower) Seed Oil.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "159.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Primers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-hairdresser-s-invisible-oil-starter-set-P504185",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:34:03",
        "product_name": "Hairderesser's Invisible Oil Starter Set",
        "brand_name": "Bumble and bumble",
        "options": [],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "-Coconut, Argan, Macadamia Oils: Condition, soften, and add shine.-UV Filters: Protect against the drying effects of the sun.Hairdresser’s Invisible Oil Shampoo:Water/Aqua/Eau, Disodium Laureth Sulfosuccinate, Sodium Cocoyl Isethionate, Sodium Lauryl Sulfoacetate, Glycerin, Sodium Lauroyl Sarcosinate, Coco-Betaine, Acrylates Copolymer, Decyl Glucoside, Butylene Glycol, Laureth-23, Glycol Distearate, Glycereth-26, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Tahitensis (Tiare) Flower Extract, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Sodium Hyaluronate, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Phenyl Trimethicone, Panthenyl Ethyl Ether, Magnesium Nitrate, Sodium PCA, Pantethine, Polyquaternium-7, Polyquaternium-10, Sodium Acetate, Isopropyl Alcohol, Potassium Hydroxide, Laureth-3, Trisodium Sulfosuccinate, Glycol Stearate, Sodium Chloride, Sodium Sulfate, Fragrance (Parfum), Linalool, Hexyl Cinnamal, Sodium Citrate, Phenoxyethanol, Methylchloroisothiazolinone, Methylisothiazolinone, Sodium Benzoate.Hairdresser’s Invisible Oil Conditioner: Water/Aqua/Eau, Cetearyl Alcohol, Cetyl Esters, Glycerin, Butyrospermum Parkii (Shea) Butter, Behentrimonium Chloride, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Taitensis Flower Extract, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Dimethicone, Sodium Hyaluronate, Glyceryl Stearate Se, Panthenyl Ethyl Ether, Sodium PCA, Ethylhexylglycerin, Dimethiconol, Pantethine, Potassium Stearate, Sodium Chloride, Citric Acid, Fragrance (Parfum), Linalool, Hexyl Cinnamal, BHT, Disodium EDTA, Tocopherol, Phenoxyethanol, Potassium Sorbate.Hairdresser’s Invisible Oil Heat/UV Protective Primer: Water/Aqua/Eau, Cetearyl Alcohol, Butylene Glycol, PEG-12 Glyceryl Dimyristate, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Taitensis Flower Extract, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Dimethicone, Glycerin, Sodium Hyaluronate, Behentrimonium Methosulfate, Distearyldimonium Chloride, Dimethiconol, Cetrimonium Chloride, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Sodium Chloride, Citric Acid, BHT, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Limonene, Potassium Sorbate, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "4.1K",
        "categories": [
            "Hair",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-hairdresser-s-invisible-oil-soft-texture-finishing-spray-P454344",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:34:13",
        "product_name": "Hairdresser's Invisible Oil Soft Texture Finishing Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.7 oz/ 106 g"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2281160"
            }
        ],
        "rating": "width:89.524%",
        "product_reviews": "21",
        "ingredients": " -Hairdresser’s Invisible Oil (Six-Oil Blend): Conditions, softens, and adds shine.- UV Filters: Help protect against the drying effects of the sun- Silk Powders: Help to provide soft texture.Hydrofluorocarbon 152a, Butane, Alcohol Denat., Butylene Glycol, Vp/Va Copolymer, lsohexadecane, lsobutane, Carthamus Tinctorius (Safflower) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Ternifolia Seed Oil, Argania Spinosa Kernel Oil, Vitis Vinifera (Grape) Seed Oil, Cocos Nucifera (Coconut) Oil[] Vitis Vinifera (Grape) Seed Extract[] Gardenia Taitensis (Tiare) Flower Extract[] Silk Powder\\Serica\\Poudre De Soie, Amp-lsostearoyl Hydrolyzed Wheat Protein, Tocopherol, Water\\Aqua\\Eau, Ethylhexyl Methoxycinnamate, Butyl Methoxydibenzoylmethane, Panthenol, Bha, BHT, Fragrance (Parfum), Linalool, Limonene, Hexyl Cinnamal, Butylphenyl Methylpropional.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "7.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/gel-P280551",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:34:25",
        "product_name": "Gel",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$41.00"
                ],
                "sku": "Item 1270602"
            }
        ],
        "rating": "width:85.49%",
        "product_reviews": "51",
        "ingredients": "Water, Polyacrylate-2 Crosspolymer, Peg-40 Hydrogenated Castor Oil, Disodium Edta, O-Cymen-5-Ol, Phenoxyethanol, Methylisothiazolinone, Butylphenyl Methylpropional, Linalool, Hexyl Cinnamal, Limonene, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Geraniol, Fragrance .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "3.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/surf-infusion-P394825",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:34:37",
        "product_name": "Surf Infusion",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1675347"
            }
        ],
        "rating": "width:72.642%",
        "product_reviews": "424",
        "ingredients": "-Sea Salt and Mineral Blend: Add body and texture.-Beach Protective Blend: Moisturizes and nourishes.-UV Inhibitors: Guard against the drying effects of the sun.Water, Dimethicone, Magnesium Sulfate, Isododecane, Ethylhexyl Stearate, Neopentyl Glycol Diheptanoate, Macrocystis Pyrifera (Kelp) Extract, Hypnea Musciformis (Algae) Extract, Gellidiela Acerosa (Algae) Extract, Ascophyllum Nodosum Extract, Cocos Nucifera (Coconut) Fruit Extract, Dead Sea Salts/Maris Sal/Sel De La Mer Mort, Sea Salt/Maris Sal/Sel Marin, Passiflora Incarnata Seed Oil, Passiflora Edulis Seed Oil, Cocos Nucifera (Coconut) Oil, Mangifera Indica (Mango) Seed Oil, Elaeis Guineensis (Palm) Oil, Isoceteth-20, Dimethiconol, Ppg-5-Ceteth-20, Bis-Cetearyl Amodimethicone, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Butylene Glycol, Sorbitol, Citric Acid, Fragrance, Hexyl Cinnamal, Linalool, Citronellol, Limonene, Alpha-Isomethyl Ionone, Butylphenyl Methylpropional, Phenoxyethanol, Green 3 (Ci 42053). Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "21.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-dont-blow-it-thick-hair-styler-P419713",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:34:50",
        "product_name": "Bb. Don’t Blow It Thick (H)air Styler",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1895887"
            }
        ],
        "rating": "width:77.47200000000001%",
        "product_reviews": "87",
        "ingredients": "-Conditioning Blend: Absorbs quickly, allowing hair to dry while staying hydrated.-UV Filter: Protects against the drying effects of sun exposure.-Oil Blend: Moisturizes and adds slip to strands.Water\\Aqua\\Eau, Behenyl Alcohol, Dimethicone, Cetyl Alcohol, Phenyl Trimethicone, Quaternium-91, Cetearyl Alcohol, Persea Gratissima (Avocado) Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Helianthus Annuus (Sunflower) Seed Oil, Yucca Schidigera Stem Extract, Opuntia Ficus-Indica Stem Extract, Tocopherol, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Isopentyldiol, Arachidyl Alcohol, Stearyl Alcohol, Polyquaternium-11, Polyquaternium-22, Caprylyl Glycol, Polyester-11, Polyquaternium-72, Quaternium-95, Butylene Glycol, Propanediol, Cetrimonium Methosulfate, Sodium Chloride, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Citral, Limonene, Geraniol, Butylphenyl Methylpropional, Disodium EDTA, Sorbic Acid, Sodium Benzoate, Phenoxyethanol.",
        "n_loves": "8.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Leave-In Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-s-invisible-oil-P375391",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:35:03",
        "product_name": "Hairdresser’s Invisible Oil",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$61.00"
                ],
                "sku": "Item 1438019"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.85 oz/ 25 mL"
                ],
                "price": [
                    "$32.50"
                ],
                "sku": "Item 1543214"
            }
        ],
        "rating": "width:89.906%",
        "product_reviews": "1.8K",
        "ingredients": "-Cocos Nucifera (Coconut) Oil, Argania Spinosa Kernel Oil, and Macadamia Integrifolia Seed Oil: Condition, soften, and add shine. -UV Filters: Help protect hair against the drying effects of the sun. Dimethicone, Hydrogenated Ethylhexyl Olivate, Isododecane, Dimethiconol, Vitis Vinifera (Grape) Seed Extract, Gardenia Tahitensis (Tiare) Flower Extract, Bis-Cetearyl Amodimethicone, Macadamia Ternifolia Seed Oil, Hydrogenated Olive Oil Unsaponifiables, Cocos Nucifera (Coconut) Oil, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Ethylhexyl Salicylate, Squalane, Tocopherol, Linalool, Butylphenyl Methylpropional, Hexyl Cinnamal, Limonene, Fragrance. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "79.2K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Oil"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-mini-curl-reactivator-P474310",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:35:16",
        "product_name": "Mini Curl Reactivator",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 2496388"
            }
        ],
        "rating": "width:88.846%",
        "product_reviews": "208",
        "ingredients": "Unknown Ingredients",
        "n_loves": "6.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-sumoclay-P417615",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:35:28",
        "product_name": "Bb. sumoclay",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 45 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1895879"
            }
        ],
        "rating": "width:92.22200000000001%",
        "product_reviews": "54",
        "ingredients": "Water, Canola Oil/Huile De Colza, Hydrogenated Castor Oil, Oryza Sativa (Rice) Bran Wax, Cetyl Alcohol, Pvp, C14-22 Alcohols, Kaolin, Glycerin, Steareth-21, Aluminum Starch Octenylsuccinate, Silica, Orbignya Oleifera (Babassu) Seed Oil, Zea Mays (Corn) Starch, Tocopherol, C12-20 Alkyl Glucoside, Glyceryl Stearate, Peg-100 Stearate, Alumina, Triethoxycaprylylsilane, Iron Oxides (Ci 77499), Fragrance, Eugenol, Hexyl Cinnamal, Linalool, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Limonene, Benzyl Benzoate, Butylphenyl Methylpropional, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "4.9K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/surf-foam-spray-blow-dry-P407072",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:35:40",
        "product_name": "Surf Foam Spray Blow Dry",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 118 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1788827"
            }
        ],
        "rating": "width:79.49%",
        "product_reviews": "235",
        "ingredients": "  -Salt Mineral Complex: Provides beachy texture. -VP/VA Copolymer and Acrylates Copolymer: Provide body, hold, and volume.-Beach Protective Blend: Helps guard against the drying effects of the sun. Water, Hydrofluorocarbon 152a, Alcohol Denat., Vp/Va Copolymer, Butylene Glycol, Acrylates Copolymer, Sea Salt/Maris Sal/Sel Marin, Cocos Nucifera (Coconut) Water, Hypnea Musciformis (Algae) Extract, Chondrus Crispus (Carrageenan), Gellidiela Acerosa (Algae) Extract, Ascophyllum Nodosum Extract, Mangifera Indica (Mango) Seed Oil, Cocos Nucifera (Coconut) Oil, Aleurites Moluccana (Kukui) Seed Oil, Hydrolyzed Wheat Protein, Hydrolyzed Soy Protein, Hydrolyzed Wheat Starch, Sorbitol, Ethylhexylglycerin, Dimethicone Peg-8 Meadowfoamate, Hydrated Silica, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Ethylhexyl Salicylate, Magnesium Chloride, Potassium Chloride, Aminomethyl Propanol, Fragrance, Hexyl Cinnamal, Linalool, Citronellol, Limonene, Alpha-Isomethyl Ionone, Disodium Edta, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "17.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-s-invisible-oil-conditioner-P386462",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:35:51",
        "product_name": "Hairdresser's Invisible Oil Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 1602952"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 33.8 oz / 1000 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$153.00"
                ],
                "sku": "Item 2022127"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 1696681"
            }
        ],
        "rating": "width:83.71600000000001%",
        "product_reviews": "452",
        "ingredients": "-Cocos Nucifera (Coconut) Oil, Argania Spinosa Kernel Oil, and Macadamia Integrifolia Seed Oil: Condition, soften, and add shine. Water, Cetearyl Alcohol, Cetyl Esters, Glycerin, Butyrospermum Parkii (Shea Butter), Behentrimonium Chloride, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Tahitensis (Tiare) Flower Extract, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Dimethicone, Sodium Hyaluronate, Glyceryl Stearate Se, Panthenyl Ethyl Ether, Sodium Pca, Ethylhexylglycerin, Dimethiconol, Pantethine, Potassium Stearate, Sodium Chloride, Citric Acid, Bht, Fragrance, Linalool, Hexyl Cinnamal, Butylphenyl Methylpropional, Disodium Edta, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "28.1K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-illuminating-blonde-purple-leave-in-spray-P474031",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:36:05",
        "product_name": "Bb.Illuminated Blonde Purple Leave In Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.2 oz/ 125 mL"
                ],
                "price": [
                    "$41.00"
                ],
                "sku": "Item 2495349"
            }
        ],
        "rating": "width:80.5%",
        "product_reviews": "40",
        "ingredients": "-Argania Spinosa Kernel Oil: Nourishes and protects.-Macadamia Integrifolia Seed Oil: Nourishes and hydrates.-Behentrimonium Methosulfate: Detangles and smooths.Water/Aqua/Eau, Cetearyl Alcohol, Butylene Glycol, Nymphaea Caerulea Flower Extract, Behentrimonium Methosulfate, Argania Spinosa Kernel Oil, Corylus Avellana (Hazel) Seed Oil, Carthamus Tinctorius (Safflower) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Vitis Vinifera (Grape) Seed Oil, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Sodium Hyaluronate, Polyglyceryl-10 Dipalmitate, Dimethiconol, Distearyldimonium Chloride, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Glycerin, Dimethicone, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Sodium Chloride, Polyglyceryl-10 Dioleate, Citric Acid, Fragrance (Parfum), Alpha-Isomethyl Ionone, BHT, Cetrimonium Chloride, Potassium Sorbate, Phenoxyethanol, Ext. Violet 2 (CI 60730).",
        "n_loves": "6.2K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Leave-In Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-bond-building-repair-shampoo-P479830",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:36:17",
        "product_name": "Bond-Building Repair Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2556850"
            }
        ],
        "rating": "width:94.39399999999999%",
        "product_reviews": "421",
        "ingredients": "-Honey Bond-Building Complex: Builds new bonds to strengthen hair and help repair.-Wildflower Honey and Honey Ferment: Improve hair’s elasticity to prevent breakage.Water/Aqua/Eau, Sodium Cocoyl Isethionate, Sodium Lauroyl Sarcosinate, Sodium Lauryl Sulfoacetate, Propanediol, Coco-Betaine, Acrylates Copolymer, Honey/Mel/Miel, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Yeast Extract/Faex/Extrait De Levure, Octyldodecyl Citrate Crosspolymer, Hydroxypropylgluconamide, Hydroxypropylammonium Gluconate, Guar Hydroxypropyltrimonium Chloride, Phenyl Trimethicone, Caprylyl Glycol, Panthenol, Polysorbate 20, Glycol Distearate, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Sodium Methyl Cocoyl Taurate, PEG-150 Distearate, Polyquaternium-7, Silica, Butylene Glycol, Citric Acid, Tartaric Acid, Sodium Hydroxide, Sodium Chloride, BHT, Fragrance (Parfum), Limonene, Benzyl Salicylate, Linalool, Tetrasodium EDTA, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Mica, Titanium Dioxide (CI 77891).",
        "n_loves": "7.7K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-mousse-P462837",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:36:29",
        "product_name": "Curl Mousse",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.0 oz/ 146 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2319754"
            }
        ],
        "rating": "width:87.11800000000001%",
        "product_reviews": "118",
        "ingredients": " -Oil and Butter Blend: Contains vitamins and healthy oils to nourish hair. -Rich Moisture Mix: Helps provide moisturizing benefits. Water\\Aqua\\Eau, Vp/Va Copolymer, Isobutane, Propane, PEG-40 Hydrogenated Castor Oil, Glycerin, PVP, PEG-12 Dimethicone, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Hydrolyzed Wheat Protein/PVP Crosspolymer, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Wheat Amino Acids, Caprylyl Methicone, Laureth-23, Laureth-4, Polyquaternium-4, Polyquaternium-11, Oleth-20, Butyl Methoxydibenzoylmethane, Octyldodecyl Citrate Crosspolymer, Dimethicone PEG-8 Meadowfoamate, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Butylene Glycol, BHT, Fragrance (Parfum), Linalool, Citronellol, Citral, Geraniol, Butylphenyl Methylpropional, Limonene, Citric Acid, Aminomethyl Propanol, Potassium Sorbate, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "8.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-pret-a-powder-tres-invisible-dry-shampoo-with-french-pink-clay-P422339",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:36:41",
        "product_name": "Bb. Pret-a-Powder Tres Invisible Dry Shampoo with French Pink Clay",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.1 oz/ 85 g"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1979707"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 7.5 oz/ 340 mL"
                ],
                "price": [
                    "$69.00"
                ],
                "sku": "Item 2189256"
            }
        ],
        "rating": "width:85.878%",
        "product_reviews": "684",
        "ingredients": "-French Pink Clay: Absorbs oil and dry cleanses.-UV Filters: Protect hair from the drying effects of the sun.Isobutane, Alcohol Denat., Butane, Dimethylimidazolidinone Rice Starch, Oryza Sativa (Rice) Starch, Montmorillonite, Illite, Dimethicone, Trisiloxane, Cetrimonium Chloride, Rhodiola Rosea Root Extract, Amp-Isostearoyl Hydrolyzed Wheat Protein, Argania Spinosa Kernel Oil, Trimethylsiloxyamodimethicone, Diisopropyl Adipate, Panthenol, Polyquaternium-59, Glycerin, Water\\Aqua\\Eau, C11-15 Pareth-7, C12-16 Pareth-9, Trideceth-12, Silicone Quaternium-16, Undeceth-11, Undeceth-5, Butyloctanol, Butylene Glycol, Pentylene Glycol, Ethylhexyl Methoxycinnamate, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Citronellol, Limonene, Butylphenyl Methylpropional, Phenoxyethanol.",
        "n_loves": "25.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-bond-building-repair-treatment-P479832",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:36:55",
        "product_name": "Bond-Building Repair Treatment",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.2 oz/ 125 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2556884"
            }
        ],
        "rating": "width:96.746%",
        "product_reviews": "375",
        "ingredients": "-Honey Bond-Building Complex: Builds new bonds to strengthen hair and help repair.-Wildflower Honey and Honey Ferment: Improve hair’s elasticity to prevent breakage.Water/Aqua/Eau, Cetearyl Alcohol, Behenyl Alcohol, Glycerin, Behentrimonium Chloride, Hydroxypropylgluconamide, Hydroxypropylammonium Gluconate, Behenyl/Octyldodecyl Propanediol Citrate Crosspolymer, Octyldodecyl Citrate Crosspolymer, Persea Gratissima (Avocado) Oil, Limnanthes Alba (Meadowfoam) Seed Oil, Helianthus Annuus (Sunflower) Seed Oil, Honey/Mel/Miel, Glycine Soja (Soybean) Oil, Tocopherol, Yeast Extract/Faex/Extrait De Levure, Stearamidopropyl Dimethylamine, Distearyldimonium Chloride, Dimethicone, Dimethiconol, Heptyl Undecylenate, Ethyl Macadamiate, Lactic Acid, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Sodium Gluconate, Squalane, Bis-Ethyl(Isostearylimidazoline) Isostearamide, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Hydroxyethylcellulose, Silica, Tartaric Acid, Butylene Glycol, BHT, Fragrance (Parfum), Limonene, Linalool, Benzyl Salicylate, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Mica, Caramel, Yellow 5 (CI 19140), Titanium Dioxide (CI 77891).",
        "n_loves": "7.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/surf-spray-P280513",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:37:09",
        "product_name": "Surf Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 4 oz/ 125 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1270776"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 1432061"
            }
        ],
        "rating": "width:72.628%",
        "product_reviews": "2.3K",
        "ingredients": " -Ascophyllum Nudosum (Seaweed) Extract: Extracted from naturally occurring seaweed; softens and smooths skin and moisturizes hair, increasing its elasticity, luster, and softness; helps decrease hair’s static charge, thus giving more body and less flyaways.\n-Macrocystis Pyrifera (Kelp) Extract: A natural seaweed extract with a high iodine and mineral content; contributes shine and manageability to hair; reduces the harshness of some chemicals; the nutritive value of this extract makes it ideal for skin preparations.\n-Magnesium Sulfate: Commonly known as Epsom salts; a natural mineral, which imparts astringent action.\nWater\\Aqua\\Eau, Magnesium Sulfate, Macrocystis Pyrifera (Kelp) Extract, Ascophyllum Nodosum Extract, Isoceteth-20, Citric Acid, PPG-5-Ceteth-20, Phenoxyethanol, Potassium Sorbate, Citronellol, Alpha-Isomethyl Ionone, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Linalool, Limonene, Hexyl Cinnamal, Butylphenyl Methylpropional, Fragrance (Parfum).\nPlease be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "51.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-s-invisible-oil-primer-mini-P426163",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:37:22",
        "product_name": "Mini Hairdresser's Invisible Oil Heat Protectant Leave In Conditioner Primer",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 1638386"
            }
        ],
        "rating": "width:91.178%",
        "product_reviews": "2.8K",
        "ingredients": "-Signature 6-Oil Blend: Provides conditioning, moisture, nourishment, softening, and smoothing. -UV Filters: Protects from the drying effects of the sun. Water\\Aqua\\Eau, Cetearyl Alcohol, Butylene Glycol, PEG-12 Glyceryl Dimyristate, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Taitensis Flower Extract, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Dimethicone, Glycerin, Sodium Hyaluronate, Behentrimonium Methosulfate, Distearyldimonium Chloride, Dimethiconol, Cetrimonium Chloride, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Sodium Chloride, Citric Acid, BHT, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Limonene, Potassium Sorbate, Phenoxyethanol. The Signature 6-Oil Blend Includes: Cocos Nucifera (Coconut) Oil, Argania Spinosa Kernel (Argan) Oil, Vitis Vinifera (Grape) Seed Oil, Macadamia Integrifolia Seed (Macadamia) Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, and Carthamus Tinctorius (Safflower) Seed Oil.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "63.5K",
        "categories": [
            "Mini Size",
            "Hair"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-bond-building-repair-styling-cream-P479833",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:37:34",
        "product_name": "Bond-Building Repair Styling Cream",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2556876"
            }
        ],
        "rating": "width:94.508%",
        "product_reviews": "142",
        "ingredients": "-Honey Bond-Building Complex: Builds new bonds to strengthen hair and help repair.-Wildflower Honey and Honey Ferment: Improve hair’s elasticity to prevent breakage.Water/Aqua/Eau, Propanediol, Cetearyl Alcohol, Dimethicone, Aleurites Moluccana (Kukui) Seed Oil, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Honey/Mel/Miel, Yeast Extract/Faex/Extrait De Levure, Octyldodecyl Citrate Crosspolymer, Stearamidopropyl Dimethylamine, Bis-Ethyl(Isostearylimidazoline) Isostearamide, Behentrimonium Chloride, Hydroxypropylammonium Gluconate, Hydroxypropylgluconamide, Caprylyl Glycol, Methyl Trimethicone, Ethyl Macadamiate, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Lactic Acid, Glycine Soja (Soybean) Oil, Tocopherol, PEG-8 Dimethicone, Sodium Lauryl Sulfate, Ascorbyl Palmitate, Cetyl Hydroxyethylcellulose, Polyquaternium-4, Acrylates/Dimethicone Copolymer, Dimethicone PEG-8 Polyacrylate, Panthenol, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Butylene Glycol, Dipropylene Glycol, Fragrance (Parfum), Linalool, Benzyl Salicylate, Benzyl Alcohol, Limonene, Benzyl Benzoate, BHT, Sodium Hydroxide, Tartaric Acid, Phenoxyethanol, Potassium Sorbate, Sodium Benzoate, Mica, Titanium Dioxide (CI 77891), Orange 4 (CI 15510), Yellow 5 (CI 19140), Caramel.",
        "n_loves": "4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-while-you-sleep-overnight-damage-repair-masque-P421497",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:37:47",
        "product_name": "Bb. While You Sleep Overnight Damage Repair Masque",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.4 oz/ 190 mL"
                ],
                "price": [
                    "$69.00"
                ],
                "sku": "Item 1977115"
            }
        ],
        "rating": "width:83.46199999999999%",
        "product_reviews": "104",
        "ingredients": "Water, Cetearyl Alcohol, Propanediol, Caprylic/Capric Triglyceride, Behentrimonium Methosulfate, Dimethicone, Ethyl Macadamiate, Stearyl Alcohol, Dicetyldimonium Chloride, Stearamidopropyl Dimethylamine, Ceteareth-20, Panthenol, Polyquaternium-37, Glycerin, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Lactic Acid, Perilla Ocymoides Seed Extract, Oenothera Biennis (Evening Primrose) Oil, Punica Granatum (Pomegranate) Seed Oil, Sisymbrium Irio Seed Oil, Camellia Oleifera Seed Oil, Isopropyl Alcohol, Caprylyl Glycol, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Tocopherol, Hydrolyzed Wheat Protein Pg-Propyl Silanetriol, Behenyl Alcohol, Silica, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Butyl Methoxydibenzoylmethane, Fragrance, Citral, Limonene, Sodium Phytate, Phenoxyethanol, Potassium Sorbate, Mica, Titanium Dioxide (Ci 77891) .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "11.9K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-rsquo-s-invisible-oil-mini-P425490",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:37:59",
        "product_name": "Mini Hairdresser’s Invisible Oil",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.85 oz/ 25 mL"
                ],
                "price": [
                    "$32.50"
                ],
                "sku": "Item 1543214"
            }
        ],
        "rating": "width:83.10600000000001%",
        "product_reviews": "103",
        "ingredients": "-Cocos Nucifera (Coconut) Oil, Argania Spinosa Kernel Oil, and Macadamia Integrifolia Seed Oil: Condition, soften, and add shine. -UV Filters: Help protect hair against the drying effects of the sun. Dimethicone, Hydrogenated Ethylhexyl Olivate, Isododecane, Dimethiconol, Vitis Vinifera (Grape) Seed Extract, Gardenia Tahitensis (Tiare) Flower Extract, Bis-Cetearyl Amodimethicone, Macadamia Ternifolia Seed Oil, Hydrogenated Olive Oil Unsaponifiables, Cocos Nucifera (Coconut) Oil, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Ethylhexyl Salicylate, Squalane, Tocopherol, Linalool, Butylphenyl Methylpropional, Hexyl Cinnamal, Limonene, Fragrance. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "24.2K",
        "categories": [
            "Mini Size",
            "Hair"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/full-potential-hair-preserving-shampoo-P399118",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:38:10",
        "product_name": "Full Potential Hair Preserving Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 1731686"
            }
        ],
        "rating": "width:72.64399999999999%",
        "product_reviews": "87",
        "ingredients": "Water, Sodium Laureth Sulfate, Lauramidopropyl Betaine, Fragrance, Creatine, Trisodium Glycyrrhizate, Centella Asiatica (Hydrocotyl) Extract, Caffeine, Rosmarinus Officinalis (Rosemary) Leaf Extract, Yeast Extract/Faex/Extrait De Levure, Saccharomyces Lysate (Yeast) Extract, Betula Alba (Birch) Extract, Menthol, Acetyl Glucosamine, Poria Cocos (Hoelen Mushroom) Extract, Polygonum Cuspidatum Root Extract, Phytantriol, Pantethine, Panthenyl Ethyl Ether, Panthenol, Cholesterol, Polyquaternium-7, Lauramine Oxide, Peg-150 Distearate, Sodium Chloride, Ethylhexyl Methoxycinnamate, Laureth-4, Laureth-23, Potassium Sulfate, Citric Acid, Bht, Coumarin, Linalool, Benzyl Salicylate, Limonene, Butylphenyl Methylpropional, Trisodium Hedta, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "6.8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-seaweed-shampoo-P506340",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:38:22",
        "product_name": "Seaweed Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 8.5 oz / 250 ml",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2659134"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 33.3 oz / 1000 ml"
                ],
                "price": [
                    "$140.00"
                ],
                "sku": "Item 2659142"
            }
        ],
        "rating": "width:94.022%",
        "product_reviews": "87",
        "ingredients": "Water/Aqua/Eau, Sodium Cocoyl Isethionate, Cocamidopropyl Hydroxysultaine, Propanediol, Cocamidopropyl Betaine, Polyglyceryl-4 Caprate, Polyglyceryl-6 Caprylate, Caprylyl/Capryl Glucoside, Macrocystis Pyrifera (Kelp) Extract, Laminaria Saccharina Extract, Chlorella Vulgaris Extract, Lactobacillus Ferment, Helianthus Annuus (Sunflower) Seed Oil, Tocopherol, Guar Hydroxypropyltrimonium Chloride, Cocamidopropyl PG-Dimonium Chloride, Sodium Isethionate, Caprylyl Glycol, Glycerin, Butylene Glycol, Ethylhexylglycerin, Pyridoxine Hcl, Panthenol, Zinc Sulfate, Chlorophyllin-Copper Complex, Citric Acid, Alcohol, Sodium Chloride, Coconut Acid, Fragrance (Parfum), Limonene, Ascorbyl Palmitate, Sodium Phytate, Phenoxyethanol, Chlorphenesin, Potassium Sorbate, Sodium Benzoate, Annatto (CI75120). Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "2.4K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/full-potential-hair-preserving-booster-spray-P399120",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:38:36",
        "product_name": "Full Potential Hair Preserving Booster Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 4.2 oz/ 125 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$84.00"
                ],
                "sku": "Item 1731694"
            }
        ],
        "rating": "width:74%",
        "product_reviews": "50",
        "ingredients": "Alcohol Denat., Water, Isoceteth-20, Ppg-28-Buteth-35, Creatine, Laminaria Saccharina Extract, Algae Extract, Centella Asiatica (Hydrocotyl) Extract, Caffeine, Rosmarinus Officinalis (Rosemary) Leaf Extract, Yeast Extract/Faex/Extrait De Levure, Saccharomyces Lysate (Yeast) Extract, Betula Alba (Birch) Extract, Menthol, Acetyl Glucosamine, Poria Cocos (Hoelen Mushroom) Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Salvia Sclarea (Clary) Extract, Humulus Lupulus (Hops) Extract, Cholesterol, Peg-16 Soya Sterol, Caprylyl Glycol, Ethylhexyl Salicylate, Hydroxypropylcellulose, Butylene Glycol, Adenosine Phosphate, Potassium Sulfate, Ethylhexyl Methoxycinnamate, Fragrance, Hexyl Cinnamal, Linalool, Benzyl Salicylate, Hydroxycitronellal, Limonene, Coumarin, Butylphenyl Methylpropional, Phenoxyethanol .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "5.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-color-stick-P415754",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:38:50",
        "product_name": "Bb. Color Stick",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 0.12 oz/ 3.5 g",
                "name": [
                    "Color: Brown"
                ],
                "price": [
                    "$41.00"
                ],
                "sku": "Item 1895838"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 0.12 oz/ 3.5 g",
                "name": [
                    "Color: Black",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$41.00"
                ],
                "sku": "Item 1895846"
            }
        ],
        "rating": "width:76.588%",
        "product_reviews": "170",
        "ingredients": "C12-15 Alkyl Benzoate, Polymethyl Methacrylate, Jojoba Esters, Hydrogenated Polyisobutene, Iron Oxides (Ci 77491, Ci 77492, Ci 77499), Polyethylene, Isononyl Isononanoate, Silica, Cellulose, Ricinus Communis (Castor) Seed Oil, Cetyl Peg/Ppg-10/1 Dimethicone, Caprylyl Glycol .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "13.2K",
        "categories": [
            "Hair",
            "Shop by Concern",
            "Color Care"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/all-style-blow-dry-P391797",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:39:03",
        "product_name": "All-Style Blow Dry",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1668037"
            }
        ],
        "rating": "width:91.07%",
        "product_reviews": "215",
        "ingredients": "Water, Polymethylsilsesquioxane, Dimethicone, Caprylyl Methicone, Myristyl Alcohol, Caryocar Brasiliense Fruit Oil, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Caprylyl Glycol, Polyisobutene, Polyacrylate-13, Polysilicone-11, Peg-8 Stearate, Polysorbate 20, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Ethylhexyl Salicylate, Fragrance, Hexyl Cinnamal, Linalool, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Limonene, Geraniol, Butylphenyl Methylpropional, Sorbic Acid, Phenoxyethanol .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "15.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/grooming-creme-P280548",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:39:16",
        "product_name": "Grooming Creme",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1270636"
            }
        ],
        "rating": "width:84.13999999999999%",
        "product_reviews": "227",
        "ingredients": " -Carthamus Tinctorius (Safflower) Seed Oil: Promotes sheen.-Persea Gratissima (Avocado) Oil: Provides vitamins A, B, and D, and moisturizes.-Prunus Amygdalus Dulcis (Sweet Almond) Oil: Moisturizes.-Simmondsia Chinensis (Jojoba) Seed Oil: Promotes sheen and flexibility.\n\nWater, Petrolatum, Cetearyl Alcohol, Isopropyl Palmitate, Polysorbate 60, Propylene Glycol, Persea Gratissima (Avocado) Oil, Ricinus Communis (Castor) Seed Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Carthamus Tinctorius (Safflower) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Benzophenone-4, PEG-12 Dimethicone, PEG-10 Soy Sterol, Sorbitan Stearate, TEA-Carbomer, Diazolidinyl Urea, Disodium EDTA, Methylparaben, Propylparaben, Geraniol, Hexyl Cinnamal, Alpha-Isomethyl Ionone, Butylphenyl Methylpropional, Linalool, Benzyl Salicylate, Fragrance (Parfum).\nPlease be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "6.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-thickening-volume-conditioner-P436392",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:39:28",
        "product_name": "Thickening Volume Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2126670"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2126720"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 33.8 oz/ 1L",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$153.00"
                ],
                "sku": "Item 2126753"
            }
        ],
        "rating": "width:58.412%",
        "product_reviews": "63",
        "ingredients": "Water, Cetearyl Alcohol, Stearamidopropyl Dimethylamine, Behentrimonium Chloride, Cetyl Alcohol, Isododecane, Stearyl Alcohol, Phyllanthus Emblica Fruit Extract, Oryza Sativa (Rice) Seed Protein, Hydrolyzed Yeast Protein, Hydrolyzed Corn Protein, Oryza Sativa (Rice) Bran Extract, Oryza Sativa (Rice) Extract, Pisum Sativum (Pea) Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Helianthus Annuus (Sunflower) Extract, Ocimum Basilicum Hairy Root Culture Extract, Laurdimonium Hydroxypropyl Hydrolyzed Keratin, Helianthus Annuus (Sunflower) Seed Oil, Cocos Nucifera (Coconut) Oil, Hydrogenated Ethylhexyl Olivate, Caprylyl Glycol, Cetrimonium Chloride, Hydroxyethylcellulose, Ethylhexylglycerin, Amodimethicone, Propanediol, Guar Hydroxypropyltrimonium Chloride, Polysorbate 60, Isopropyl Alcohol, Methoxy PEG/PPG-7/3 Aminopropyl Dimethicone, Panthenol, C11-15 Pareth-7, Polysilicone-15, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Hydrogenated Olive Oil Unsaponifiables, Cyperus Esculentus Root Oil, Glycerin, Trideceth-12, Octyldodecanol, Alcohol, Laureth-9, Tocopherol, Vp/Hexadecene Copolymer, Cystine Bis-PG-Propyl Silanetriol, Jojoba Esters, BHT, Citric Acid, Fragrance, Linalool, Benzyl Benzoate, Limonene, Hexyl Cinnamal, Butylphenyl Methylpropional, Phytic Acid, Disodium EDTA, Phenoxyethanol, Sorbic Acid, Chlorphenesin, Sodium Benzoate.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-dont-blow-it-fine-hair-styler-P397351",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:39:41",
        "product_name": "Don't Blow It Fine Hair Air Dry Styler",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1689256"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2162162"
            }
        ],
        "rating": "width:77.15799999999999%",
        "product_reviews": "1.2K",
        "ingredients": "Water, Cetyl Alcohol, Hydroxypropyl Starch Phosphate, Dimethicone, Ethylhexyl Palmitate, Yucca Schidigera Stem Extract, Opuntia Ficus-Indica Stem Extract, Hydrolyzed Soy Protein, Polyquaternium-72, Glyceryl Stearate, Amodimethicone, Cetearyl Alcohol, Ethylhexylglycerin, Distearyldimonium Chloride, Behentrimonium Methosulfate, Quaternium-95, Cetrimonium Chloride, Trideceth-10, Butylene Glycol, Propanediol, Polyester-11, Fragrance, Hexyl Cinnamal, Linalool, Limonene, Geraniol, Butylphenyl Methylpropional, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "48.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Leave-In Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-starter-set-P504135",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:39:55",
        "product_name": "Curl Starter Set",
        "brand_name": "Bumble and bumble",
        "options": [],
        "rating": "width:80%",
        "product_reviews": "2",
        "ingredients": "-Oil and Butter Blend (Avocado Oil, Coconut Oil, Jojoba Oil, Cocoa Butter, Shea Butter): Contains vitamins and healthy oils to nourish hair.Curl Moisturizing Shampoo: Water/Aqua/Eau, Sodium Cocoyl Isethionate, Sodium Lauroyl Sarcosinate, Sodium Lauryl Sulfoacetate, Laureth-23, Coco-Betaine, Propanediol, Glycol Distearate, PEG-150 Distearate, Acrylates Copolymer, Sodium Methyl Cocoyl Taurate, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Tocopherol, Glycereth-26, Sodium PCA, Pantethine, Panthenyl Ethyl Ether, Sodium Hyaluronate, Octyldodecyl Citrate Crosspolymer, Decyl Glucoside, Polyquaternium-10, Polyquaternium-7, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Citric Acid, Sodium Hydroxide, Butylene Glycol, Sodium Chloride, BHT, Fragrance (Parfum), Limonene, Linalool, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol. Curl 3-in-1 Conditioner: Water/Aqua/Eau, Cetyl Alcohol, Cetearyl Alcohol, Dimethicone, Stearalkonium Chloride, Glycerin, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Caprylic/Capric Triglyceride, Tocopheryl Acetate, Propanediol, Lactic Acid, Octyldodecyl Citrate Crosspolymer, Panthenol, Panthenyl Ethyl Ether, Pantethine, Sodium PCA, Phytantriol, Stearamidopropyl Dimethylamine, Behentrimonium Chloride, Trehalose, Sodium Hyaluronate, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Polyquaternium-51, Urea, Alcohol Denat., BHT, Fragrance (Parfum), Linalool, Limonene, Potassium Sorbate, Phenoxyethanol. Curl Reactivator: Water/Aqua/Eau, Propanediol, Butylene Glycol, Cetearyl Alcohol, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Glycerin, Glycine Soja (Soybean) Oil, Tocopherol, Lactic Acid, Stearamidopropyl Dimethylamine, Octyldodecyl Citrate Crosspolymer, Polyglyceryl-10 Dipalmitate, Polyglyceryl-10 Dioleate, Dimethicone, Dimethiconol, Cetrimonium Chloride, Distearyldimonium Chloride, Behentrimonium Methosulfate, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, BHT, Sodium Chloride, Sodium Hyaluronate, Fragrance (Parfum), Citral, Linalool, Geraniol, Limonene, Potassium Sorbate, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "3.5K",
        "categories": [
            "Hair",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-pret-a-powder-post-workout-dry-shampoo-mist-mini-P456161",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:40:05",
        "product_name": "Mini Pret-a-Powder Post Workout Dry Shampoo Mist",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 45 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2317394"
            }
        ],
        "rating": "width:56.364000000000004%",
        "product_reviews": "55",
        "ingredients": "-Bamboo Extract and Silica: Help absorb oil and refresh sweaty hair.-UV Filter: Helps protect hair from the drying effects of the sun.Water/Aqua/Eau, Alcohol Denat., Bambusa Arundinacea (Bamboo) Stem Extract, Calendula Officinalis Flower Extract, Glycerin, Isoamyl Laurate, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Lithium Magnesium Sodium Silicate, Silica, Calcium Chloride, Cetrimonium Chloride, Tocopherol, BHT, Butylene Glycol, Pentylene Glycol, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Limonene, Citronellol, Geraniol, Coumarin, Citral.",
        "n_loves": "12.9K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-pret-a-powder-post-workout-dry-shampoo-mist-P456160",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:40:20",
        "product_name": "Pret-a-Powder Post Workout Dry Shampoo Mist",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 120 mL"
                ],
                "price": [
                    "$45.00"
                ],
                "sku": "Item 2317386"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 45 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2317394"
            }
        ],
        "rating": "width:75.128%",
        "product_reviews": "234",
        "ingredients": "-Bamboo Extract and Silica: Help absorb oil and refresh sweaty hair.-UV Filter: Helps protect hair from the drying effects of the sun.Water/Aqua/Eau, Alcohol Denat., Bambusa Arundinacea (Bamboo) Stem Extract, Calendula Officinalis Flower Extract, Glycerin, Isoamyl Laurate, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Lithium Magnesium Sodium Silicate, Silica, Calcium Chloride, Cetrimonium Chloride, Tocopherol, BHT, Butylene Glycol, Pentylene Glycol, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Limonene, Citronellol, Geraniol, Coumarin, Citral.",
        "n_loves": "21.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-rsquo-s-invisible-oil-conditioner-mini-P426164",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:40:34",
        "product_name": "Mini Hairdresser’s Invisible Oil Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 1696681"
            }
        ],
        "rating": "width:70.304%",
        "product_reviews": "33",
        "ingredients": "-Cocos Nucifera (Coconut) Oil, Argania Spinosa Kernel Oil, and Macadamia Integrifolia Seed Oil: Condition, soften, and add shine. Water, Cetearyl Alcohol, Cetyl Esters, Glycerin, Butyrospermum Parkii (Shea Butter), Behentrimonium Chloride, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Tahitensis (Tiare) Flower Extract, Argania Spinosa Kernel Oil, Carthamus Tinctorius (Safflower) Seed Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Dimethicone, Sodium Hyaluronate, Glyceryl Stearate Se, Panthenyl Ethyl Ether, Sodium Pca, Ethylhexylglycerin, Dimethiconol, Pantethine, Potassium Stearate, Sodium Chloride, Citric Acid, Bht, Fragrance, Linalool, Hexyl Cinnamal, Butylphenyl Methylpropional, Disodium Edta, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "5.4K",
        "categories": [
            "Mini Size",
            "Hair"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-pret-a-powder-tres-invisible-nourishing-dry-shampoo-with-hibiscus-extract-P422338",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:40:47",
        "product_name": "Bb. Pret-a-Powder Tres Invisible Nourishing Dry Shampoo with Hibiscus Extract",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 3.1 oz/ 85 g",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1979723"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 7.5 oz/ 340 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$69.00"
                ],
                "sku": "Item 2189264"
            }
        ],
        "rating": "width:86.182%",
        "product_reviews": "317",
        "ingredients": "-Hibiscus Extract: Absorbs oil at the root while nourishing dry ends.-UV Filters: Protect hair from the drying effects of the sun.Butane, Alcohol Denat., Dimethylimidazolidinone Rice Starch, Isobutane, Dimethicone, Trisiloxane, Cetrimonium Chloride, Rhodiola Rosea Root Extract, Hibiscus Sabdariffa Flower Extract, Amp-Isostearoyl Hydrolyzed Wheat Protein, Argania Spinosa Kernel Oil, Trimethylsiloxyamodimethicone, Diisopropyl Adipate, Panthenol, Polyquaternium-59, Glycerin, Water\\Aqua\\Eau, C11-15 Pareth-7, C12-16 Pareth-9, Trideceth-12, Silicone Quaternium-16, Undeceth-11, Undeceth-5, Butyloctanol, Butylene Glycol, Pentylene Glycol, Ethylhexyl Methoxycinnamate, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Citronellol, Limonene, Butylphenyl Methylpropional, Phenoxyethanol.",
        "n_loves": "9.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-heat-shield-thermal-protection-P479834",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:41:00",
        "product_name": "Mini Bb. Heat Shield Thermal Protection Mist",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2556926"
            }
        ],
        "rating": "width:76.666%",
        "product_reviews": "6",
        "ingredients": "-Honey Protective Complex: Repairs damage and helps prevent breakage.Water/Aqua/Eau, Alcohol Denat., Propanediol, Dicaprylyl Ether, Dimethicone, Honey/Mel/Miel, Simmondsia Chinensis (Jojoba) Seed Oil, Helianthus Annuus (Sunflower) Seed Oil, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Octyldodecyl Citrate Crosspolymer, Yeast Extract/Faex/Extrait De Levure, Coco-Caprylate/Caprate, Caprylic/Capric Triglyceride, Ethyl Macadamiate, Panthenol, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Glycine Soja (Soybean) Oil, Tocopherol, Polyglyceryl-10 Laurate, PEG-40 Hydrogenated Castor Oil, Cetrimonium Chloride, BHT, Butylene Glycol, Fragrance (Parfum), Limonene, Benzyl Salicylate, Linalool, Benzyl Benzoate, Citric Acid, Sodium Citrate, Phenoxyethanol.",
        "n_loves": "8.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-save-the-day-daytime-protective-repair-fluid-P421496",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:41:13",
        "product_name": "Save the Day Daytime Protective Repair Fluid",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.2 oz/ 95 mL"
                ],
                "price": [
                    "$64.00"
                ],
                "sku": "Item 1977099"
            }
        ],
        "rating": "width:89.74399999999999%",
        "product_reviews": "156",
        "ingredients": " -Camellia Oil: A precious, rich oil that has been recognized for centuries for its restorative and rejuvenating properties.-Advanced Hair Repair Technology: Restores a healthy look and feel. Water, Dimethicone, Glycerin, Cetearyl Alcohol, Hydrogenated Lecithin, Dimethicone/Peg-10/15 Crosspolymer, Dimethiconol, Camellia Oleifera Seed Oil, Caffeine, Oenothera Biennis (Evening Primrose) Oil, Punica Granatum (Pomegranate) Seed Oil, Chenopodium Quinoa Seed Extract, Sisymbrium Irio Seed Oil, Arabidopsis Thaliana Extract, Hydrolyzed Wheat Protein Pg-Propyl Silanetriol, Perilla Ocymoides Seed Extract, Peg-40 Hydrogenated Castor Oil, Coco-Glucoside, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Dihydroxypropyl Arginine Hcl, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Ethylhexylglycerin, Caprylyl Glycol, Linoleic Acid, Saccharide Isomerate, Tocopheryl Acetate, Silica, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Panthenol, Lecithin, Xanthan Gum, Fragrance, Citronellol, Citral, Limonene, Phenoxyethanol, Mica, Titanium Dioxide.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "15K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Primers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-defining-cream-light-P477727",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:41:27",
        "product_name": "Light Defining Curl Cream",
        "brand_name": "Bumble and bumble",
        "options": [],
        "rating": "width:93.41%",
        "product_reviews": "176",
        "ingredients": " -Coconut Oil: Lightweight oil that penetrates strands. -Shea butter: Nutrient-rich butter. Water\\Aqua\\Eau, Cetearyl Alcohol, Propanediol, Phenyl Trimethicone, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Aloe Barbadensis Leaf Juice, Glycine Soja (Soybean) Oil, Tocopherol, Hydrolyzed Wheat Protein, Sclerotium Gum, Caprylyl Glycol, Phytantriol, Pantethine, Panthenyl Ethyl Ether, Panthenol, Octyldodecyl Citrate Crosspolymer, Distearyldimonium Chloride, Polyquaternium-11, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Maltodextrin, Behentrimonium Chloride, Cetyl Alcohol, BHT, Disodium EDTA, Fragrance (Parfum), Limonene, Linalool, Citral, Geraniol, Potassium Sorbate, Phenoxyethanol.",
        "n_loves": "8.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/super-rich-conditioner-P280573",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:41:37",
        "product_name": "Super Rich Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$45.00"
                ],
                "sku": "Item 1270198"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 33.8 oz/ 1 L"
                ],
                "price": [
                    "$129.00"
                ],
                "sku": "Item 1328186"
            }
        ],
        "rating": "width:84.27799999999999%",
        "product_reviews": "346",
        "ingredients": "Water, Cetearyl Alcohol, Behentrimonium Methosulfate, Cetyl Alcohol, PPG-2 Myristyl Ether Propionate, Hydroxyethylcellulose, Stearalkonium Chloride, Glyceryl Stearate, Glyceryl Distearate, Dimethicone, Caprylyl Glycol, Stearyl Alcohol, Glycerin, Hexylene Glycol, Citric Acid, Tetrasodium EDTA, Phenoxyethanol, Yellow 5 (CI 19140), Yellow 6 (CI 15985), Linalool, Limonene, Hexyl Cinnamal, Fragrance.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "17.3K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-hio-ultra-rich-serum-P475914",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:41:51",
        "product_name": "Hairdresser's Invisible Oil Ultra Rich Hyaluronic Treatment Lotion",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$64.00"
                ],
                "sku": "Item 2500288"
            }
        ],
        "rating": "width:94.354%",
        "product_reviews": "379",
        "ingredients": "Water/Aqua/Eau, Propanediol, C14-22 Alcohols, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Vitis Vinifera (Grape) Seed Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Helianthus Annuus (Sunflower) Seed Oil, Argania Spinosa Kernel Oil, Gardenia Tahitensis (Tiare) Flower Extract, Squalane, Dimethicone, Hyaluronic Acid, Sodium Hyaluronate, Hydrogenated Castor Oil/Sebacic Acid Copolymer, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Glyceryl Caprylate, Carthamus Tinctorius (Safflower) Seed Oil, Phospholipids, Citrullus Lanatus (Watermelon) Seed Oil, Bis-Ethyl(Isostearylimidazoline) Isostearamide, Octyldodecyl Citrate Crosspolymer, C12-20 Alkyl Glucoside Tocopherol, Polymethylsilsesquioxane, Xanthan Gum, Sodium Hydroxide, Citric Acid, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Fragrance (Parfum), Limonene, Linalool, Hexyl Cinnamal, Coumarin, BHT, Sodium Phytate, Potassium Sorbate, Phenoxyethanol.",
        "n_loves": "10.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-s-invisible-oil-shampoo-P386463",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:42:03",
        "product_name": "Hairdresser's Invisible Oil Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 1602945"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 1696673"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 33.8 oz / 1000 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$140.00"
                ],
                "sku": "Item 2022135"
            }
        ],
        "rating": "width:79.29%",
        "product_reviews": "564",
        "ingredients": "-Prunus Amygdalus Dulcis (Sweet Almond) Oil, Vitis Vinifera (Grape) Seed Oil, and Carthamus Tinctorius (Safflower) Seed Oil: Condition, soften, and add shine.Water, Disodium Laureth Sulfosuccinate, Sodium Cocoyl Isethionate, Sodium Lauryl Sulfoacetate, Glycerin, Sodium Lauroyl Sarcosinate, Coco-Betaine, Acrylates Copolymer, Decyl Glucoside, Butylene Glycol, Glycol Distearate, Laureth-23, Glycereth-26, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Tahitensis (Tiare) Flower Extract, Argania Spinosa Kernel Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Carthamus Tinctorius (Safflower) Seed Oil, Sodium Hyaluronate, Phenyl Trimethicone, Panthenyl Ethyl Ether, Sodium Pca, Pantethine, Polyquaternium-7, Polyquaternium-10, Potassium Hydroxide, Sodium Chloride, Sodium Sulfate, Fragrance, Linalool, Hexyl Cinnamal, Butylphenyl Methylpropional, Phenoxyethanol, Methylisothiazolinone, Methylchloroisothiazolinone. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "31.1K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-seaweed-air-dry-hair-styling-cream-P506383",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:42:17",
        "product_name": "Seaweed Air Dry Hair Styling Cream",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 5 oz / 150 ml",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2659167"
            }
        ],
        "rating": "width:94.972%",
        "product_reviews": "175",
        "ingredients": "Water/Aqua/Eau, Dicaprylyl Carbonate, Cetearyl Alcohol, Polyquaternium-37, Myristyl Alcohol, C12-15 Alkyl Benzoate, Macrocystis Pyrifera (Kelp) Extract, Laminaria Saccharina Extract, Chlorella Vulgaris Extract, Lactobacillus Ferment, Argania, Spinosa Kernel Oil, Pyridoxine Hcl, Phytic Acid, Glycerin, Hydrogenated Polyisobutene, Ethylhexylglycerin, Butylene Glycol, Caprylyl Glycol, PPG-3 Benzyl Ether Myristate, Lauryl Glucoside, Tocopherol, Zinc Sulfate, Guar Hydroxypropyltrimonium Chloride, Behentrimonium Chloride, Pentylene Glycol, Propanediol, Vinyl Caprolactam/Vp/Dimethylaminoethyl Methacrylate Copolymer, Polyquaternium-11, Stearyl Alcohol, Fragrance (Parfum), Limonene, Eugenol, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Sodium Benzoate, Phenoxyethanol, Potassium Sorbate. Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "3.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/a-bit-blondish-hair-powder-P280525",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:42:29",
        "product_name": "Blondish Hair Powder",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.4 oz/ 130 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 1270370"
            }
        ],
        "rating": "width:60.56600000000001%",
        "product_reviews": "247",
        "ingredients": "Dimethyl Ether, Alcohol Denat., Aluminum Starch Octenylsuccinate, Propylene Glycol, Vp/Va Copolymer, Silica, Water, Magnesium Carbonate, Methyl Methacrylate Crosspolymer, Iron Oxides (Ci 77491, Ci 77492, Ci 77499) .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "3.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/tonic-lotion-P280530",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:42:41",
        "product_name": "Tonic Lotion",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 250 mL"
                ],
                "price": [
                    "$41.00"
                ],
                "sku": "Item 1270305"
            }
        ],
        "rating": "width:87.24000000000001%",
        "product_reviews": "511",
        "ingredients": " -Melaleuca Alternifolia (Tea Tree) Leaf Oil: Provides antiseptic benefits.-Mentha Piperita (Peppermint) Leaf Extract: Stimulates circulation and provides oil control.-Rosmarinus Officinalis (Rosemary) Leaf Extract: Stimulates scalp and provides antimicrobial and conditioning benefits.-Urtica Dioica (Nettle) Extract: Tones and conditions scalp.\n\nWater, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Mentha Piperita (Peppermint) Oil, Menthol, Mentha Piperita (Peppermint) Leaf Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Cymbopogon Schoenanthus (Lemongrass) Extract, Humulus Lupulus (Hops) Extract, Urtica Dioica (Nettle) Leaf Extract, Tocopheryl Acetate, Glycerin, Amodimethicone, Isoceteth-20, Distearyldimonium Chloride, Cetrimonium Chloride, Trideceth-10, Disodium EDTA, Citric Acid, Phenoxyethanol, Chlorphenesin.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "15.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Primers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-butter-mask-P462836",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:42:54",
        "product_name": "Curl Butter Mask",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$61.00"
                ],
                "sku": "Item 2319713"
            }
        ],
        "rating": "width:76%",
        "product_reviews": "5",
        "ingredients": " -Oil and Butter Blend: Contains vitamins and healthy oils to nourish hair. -Rich Moisture Mix: Helps provide moisturizing benefits.Water\\Aqua\\Eau, Cetearyl Alcohol, Glycerin, Elaeis Guineensis (Palm) Oil, Behentrimonium Chloride, Distearyldimonium Chloride, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea Butter), Behenyl/Octyldodecyl Propanediol Citrate Crosspolymer, Tocopheryl Acetate, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Tribehenin, Glyceryl Dibehenate, Caprylyl Glycol, Cetearyl Glucoside, Polyquaternium-37, Glyceryl Behenate, BHT, Fragrance (Parfum), Limonene, Linalool, Butylphenyl Methylpropional, Sodium Chloride, Sodium Hydroxide, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "2.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-thickening-go-big-plumping-hair-treatment-P481816",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:43:06",
        "product_name": "Thickening Go Big Plumping Hair Treatment",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$45.00"
                ],
                "sku": "Item 2571164"
            }
        ],
        "rating": "width:84.444%",
        "product_reviews": "9",
        "ingredients": "-Emblica Technology: Plumps individual strands.-Wheat Proteins and Starches: Improve body and texture. -Brazil Nut Protein: Conditions.Water\\Aqua\\Eau, Propanediol, Hydrolyzed Corn Starch, Emblica Officinalis Fruit Extract, Biotinoyl Tripeptide-1, Acacia Senegal Gum, Corn Starch Modified, Wheat Amino Acids, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Dimethicone PEG-8 Meadowfoamate, Dimethicone, Dimethiconol, Glycerin, Stearamidopropyl Dimethylamine, PEG-40 Hydrogenated Castor Oil, Hydrogenated Lecithin, Coco-Glucoside, Cetearyl Alcohol, Polyquaternium-4, Polyquaternium-10, Panthenol, PVP, Sodium Chloride, Citric Acid, Sodium Acetate, Isopropyl Alcohol, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Citronellol, Citral, Limonene, Benzyl Benzoate, Hydroxycitronellal, Potassium Sorbate, Phenoxyethanol.",
        "n_loves": "3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-hio-ultra-rich-shampoo-P475913",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:43:19",
        "product_name": "Hairdresser's Invisible Oil Ultra Rich Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2500262"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 15.2 oz/ 450 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$69.00"
                ],
                "sku": "Item 2521458"
            }
        ],
        "rating": "width:81.35600000000001%",
        "product_reviews": "59",
        "ingredients": "Water/Aqua/Eau, Sodium Lauroyl Methyl Isethionate, Sodium Chloride, Sodium Methyl Cocoyl Taurate, Cocamide Mipa, Babassuamidopropyl Betaine, Glycol Distearate, Stearamidopropyl Dimethylamine, Propanediol,  Behenyl/Octyldodecyl Propanediol Citrate Crosspolymer, Cocos Nucifera (Coconut) Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Argania Spinosa Kernel Oil, Vitis Vinifera (Grape) Seed Oil, Citrullus Lanatus (Watermelon) Seed Oil, Gardenia Tahitensis (Tiare) Flower Extract, Sodium Hyaluronate, Hyaluronic Acid, Guar Hydroxypropyltrimonium Chloride, Lactic Acid, Glycerin, Arginine, Dimethicone, Phospholipids, Carthamus Tinctorius (Safflower) Seed Oil, Tocopherol, Glycine Soja (Soybean) Oil, Lauric Acid, Diheptyl Succinate, Sodium Laurate, Sodium Sulfate, Polyquaternium-7, Polymethylsilsesquioxane, Capryloyl Glycerin/Sebacic Acid Copolymer, Fragrance (Parfum), Linalool, Hexyl Cinnamal, BHT, Sodium Phytate, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol.",
        "n_loves": "3.5K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/semisumo-P377208",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:43:32",
        "product_name": "Semisumo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 42 g"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1460997"
            }
        ],
        "rating": "width:87.90599999999999%",
        "product_reviews": "86",
        "ingredients": "Microcrystalline Wax/Cera Microcristallina/Cire Microcristalline, Canola Oil/Huile De Colza, Cocos Nucifera (Coconut) Oil, Beeswax/Cera Alba/Cire D Abeille, Silica, Zea Mays (Corn) Starch, Hexyl Cinnamal, Linalool, Butylphenyl Methylpropional, Limonene, Benzyl Benzoate, Citronellol, Citral, Coumarin, Geraniol, Fragrance .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "5.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/spray-de-mode-flexible-hold-hairspray-P280512",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:43:45",
        "product_name": "Spray de Mode Flexible Hold Hairspray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 10 oz/ 295 mL",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 1319094"
            }
        ],
        "rating": "width:81.886%",
        "product_reviews": "297",
        "ingredients": " -Octylacrylamide/Acrylates/Butylaminoethyl Methacrylate Copolymer: Provide hold and improve curl retention.-Butyl Ester of PVM/MA Copolymer: Provide strong yet flexible hold; non-tacky.Alcohol Denat., Hydrofluorocarbon 152a, Dimethyl Ether, Butyl Ester Of Pvm/Ma Copolymer, Water, Polyurethane-14, Glycerin, Lactamide Mea, Panthenol*, Triethyl Citrate, Bisamino Peg/Ppg-41/3 Aminoethyl Pg-Propyl Dimethicone, Octylacrylamide/Acrylates/Butylaminoethyl Methacrylate Copolymer, Amp-Acrylates Copolymer, N-Butyl Alcohol, Aminomethyl Propanol, Peg-75 Lanolin, Dipropylene Glycol, Linalool, Limonene, Benzyl Salicylate, Hexyl Cinnamal, Butylphenyl Methylpropional, Fragrance. Pro-Vitamin: *B5.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "12.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Spray"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-defining-cream-P462832",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:43:58",
        "product_name": "Curl Defining Cream",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2319721"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.0 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2366557"
            }
        ],
        "rating": "width:82.438%",
        "product_reviews": "599",
        "ingredients": "-HydraSculpt Blend™: Blends styling benefits with moisture so curls are controlled and hydrated.-Oil and Butter Blend: Helps hydrate thirsty curls.-Rich Moisture Mix: Provides moisturizing benefits.Water\\Aqua\\Eau, Glycerin, Cetyl Alcohol, Petrolatum, Cetearyl Alcohol, Isopropyl Myristate, Ceteareth-20, Dimethicone, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Glycine Soja (Soybean) Oil, Tocopherol, Microcrystalline Wax\\Cera Microcristallina\\Cire Microcristalline, Beeswax\\Cera Alba\\Cire D'Abeille, Sodium Hyaluronate, Pantethine, Panthenol, Squalane, Octyldodecyl Citrate Crosspolymer, Sodium PCA, Phytantriol, Panthenyl Ethyl Ether, Phenyl Trimethicone, PEG-8 Dimethicone, Cetrimonium Chloride, PVP, Polyquaternium-7, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, BHT, Fragrance (Parfum), Citral, Geraniol, Limonene, Linalool, Chlorphenesin, Sodium Benzoate, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "9.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-seaweed-whipped-scalp-scrub-P506356",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:44:11",
        "product_name": "Seaweed Whipped Scalp Scrub",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz / 200 ml"
                ],
                "price": [
                    "$61.00"
                ],
                "sku": "Item 2659175"
            }
        ],
        "rating": "width:95.29799999999999%",
        "product_reviews": "353",
        "ingredients": "-Dead Sea Salt: Buffs away dead skin cells.Sea Salt/Maris Sal/Sel Marin, Water/Aqua/Eau, Sodium Methyl Cocoyl Taurate, Cetearyl Alcohol, Propanediol, Sodium Cocoyl Isethionate, Sodium Chloride, Glycerin, Cocos Nucifera (Coconut) Oil, Coconut Acid, Glyceryl Laurate, Macrocystis Pyrifera (Kelp) Extract, Laminaria Saccharina Extract, Chlorella Vulgaris Extract, Lactobacillus Ferment, Pyridoxine Hcl, Zinc Sulfate, Butylene Glycol, Sodium PCA, Behentrimonium Methosulfate, Citric Acid, Xanthan Gum, Acacia Senegal Gum, Fragrance (Parfum), Limonene, Sodium Phytate, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "1.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/sunday-clarifying-shampoo-P280564",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:44:28",
        "product_name": "Sunday Clarifying Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1270073"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2496354"
            }
        ],
        "rating": "width:93.12799999999999%",
        "product_reviews": "844",
        "ingredients": "-Panax Ginseng Root: Cleanses the scalp and encourages healthy hair and scalp. -Rosmarinus Officinalis (Rosemary) Leaf Extract: Acts as a scalp stimulate.-Salvia Officinalis (Sage) Leaf Extract: Natural clarifying agent that supports scalp and hair shaft.Water\\Aqua\\Eau, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Sodium Chloride, Panax Ginseng Root Extract, Salvia Officinalis (Sage) Leaf Extract, Glycerin, Magnesium Chloride, Rosmarinus Officinalis Leaf Oil, Magnesium Nitrate, Sodium Hydroxide, Citric Acid, Isoceteth-20, PPG-2 Hydroxyethyl Cocamide, Fragrance (Parfum), Limonene, Tetrasodium EDTA, Phenoxyethanol, Chlorphenesin, Methylchloroisothiazolinone, Methylisothiazolinone, Green 5 (CI 61570), Ext. Violet 2 (CI 60730).Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "39.1K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-bond-building-repair-conditioner-P479831",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:44:42",
        "product_name": "Bond-Building Repair Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2556868"
            }
        ],
        "rating": "width:96.71600000000001%",
        "product_reviews": "335",
        "ingredients": "-Honey Bond-Building Complex: Builds new bonds to strengthen hair and help repair.-Wildflower Honey and Honey Ferment: Improve hair’s elasticity to prevent breakage.Water/Aqua/Eau, Cetearyl Alcohol, Tricaprylyl Citrate, Heptyl Undecylenate, Behentrimonium Methosulfate, Stearamidopropyl Dimethylamine, Honey/Mel/Miel, Cocos Nucifera (Coconut) Oil, Butyrospermum Parkii (Shea) Butter, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Lactic Acid, Bis-Ethyl(Isostearylimidazoline) Isostearamide, Hydroxypropylgluconamide, Hydroxypropylammonium Gluconate, Distearyldimonium Chloride, Octyldodecyl Citrate Crosspolymer, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Propanediol, Butylene Glycol, Simethicone, Benzyl Alcohol, BHT, Malt Extract, Yeast Extract/Faex/Extrait De Levure, Fragrance (Parfum), Linalool, Benzyl Salicylate, Limonene, Tartaric Acid, Caprylyl Glycol, Cetrimonium Chloride, Potassium Sorbate, Phenoxyethanol. ",
        "n_loves": "7.7K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-sumogel-P417614",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:44:54",
        "product_name": "Bb. sumogel",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 50 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1895861"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "15",
        "ingredients": "Water\\Aqua\\Eau, Ceteareth-25, PEG-7 Glyceryl Cocoate, PEG-40 Hydrogenated Castor Oil, Pentylene Glycol, Aloe Barbadensis Leaf Juice, Acrylates Copolymer, Panthenol, Caprylyl Glycol, Sodium Lauryl Sulfate, Aminomethyl Propanol, Fragrance (Parfum), Eugenol, Hexyl Cinnamal, Linalool, Benzyl Benzoate, Disodium EDTA, Phenoxyethanol.",
        "n_loves": "1.9K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-sumo-liquid-wax-finishing-spray-P454343",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:45:07",
        "product_name": "Sumo Liquid Wax+ Finishing Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 4 oz/ 113 g",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 2281152"
            }
        ],
        "rating": "width:78.334%",
        "product_reviews": "12",
        "ingredients": " -PVP: Helps add light hold and control.-Coconut Oil: Keeps hair’s natural sheen.-Beeswax: Helps give separation, definition, and lived-in texture. Dimethyl Ether, Water\\Aqua\\Eau, Cocos Nucifera (Coconut) Oil, PEG-25 Hydrogenated Castor Oil, PVP, Laneth-15, Glycerin, Cetearyl Alcohol, Dimethicone, PEG-8 Beeswax, Isopropyl Myristate,Ceteareth-25, Polyimide-1, Caprylyl Glycol, Hydrolyzed Soy Protein, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Sodium Chloride, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Benzyl Salicylate, Alpha-Isomethyl Ionone, Geraniol, Butylphenyl Methylpropional, Sodium Hydroxide, Tetrasodium EDTA, Potassium Sorbate, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "2.3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-moisturizing-shampoo-P462834",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:45:20",
        "product_name": "Curl Moisturizing Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2319697"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2496362"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 33.8 oz/ 1000 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$140.00"
                ],
                "sku": "Item 2319770"
            }
        ],
        "rating": "width:92.46399999999998%",
        "product_reviews": "138",
        "ingredients": " -Oil and Butter Blend: Contains vitamins and healthy oils to nourish hair. -Rich Moisture Mix: Helps provide moisturizing benefits.Water\\Aqua\\Eau, Sodium Cocoyl Isethionate, Sodium Lauroyl Sarcosinate, Sodium Lauryl Sulfoacetate, Laureth-23, Coco-Betaine, Propanediol, Glycol Distearate, PEG-150 Distearate, Acrylates Copolymer, Sodium Methyl Cocoyl Taurate, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Tocopherol, Glycereth-26, Sodium PCA, Pantethine, Panthenyl Ethyl Ether, Sodium Hyaluronate, Octyldodecyl Citrate Crosspolymer, Decyl Glucoside, Polyquaternium-10, Polyquaternium-7, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Citric Acid, Sodium Hydroxide, Butylene Glycol, Sodium Chloride, BHT, Fragrance (Parfum), Limonene, Linalool, Butylphenyl Methylpropional, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "7K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-glow-blow-dry-accelerator-P449138",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:45:33",
        "product_name": "Bb. Heat Shield Blow Dry Accelerator",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.2 oz/ 125 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2431534"
            }
        ],
        "rating": "width:91.308%",
        "product_reviews": "191",
        "ingredients": "-Honey Protective Complex: Conditions while improving hair’s elasticity to help prevent breakage.Alcohol Denat., Isohexadecane, Isododecane, Heptyl Undecylenate, Dimethicone, Hydrogenated Castor Oil/Sebacic Acid Copolymer, Honey/Mel/Miel, Aleurites Moluccana (Kukui) Seed Oil, Octyldodecyl Citrate Crosspolymer, Yeast Extract/Faex/Extrait De Levure, Water/Aqua/Eau, Bis-Ethyl(Isostearylimidazoline) Isostearamide, Dicetyldimonium Chloride, Panthenol, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Glycine Soja (Soybean) Oil, Tocopherol, BHT, Ascorbyl Palmitate, Isopropyl Alcohol, Butylene Glycol, Fragrance (Parfum), Citral, Coumarin, Benzyl Benzoate, Linalool, Benzyl Salicylate, Limonene, Phenoxyethanol.",
        "n_loves": "7.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-mini-curl-3-in-1-conditioner-P474309",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:45:45",
        "product_name": "Mini Curl 3 in 1 Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2496370"
            }
        ],
        "rating": "width:90.482%",
        "product_reviews": "145",
        "ingredients": "-Oil and Butter Blend: Contains vitamins and healthy oils to nourish hair. -Rich Moisture Mix: Provides moisturizing benefits.Water\\Aqua\\Eau, Cetyl Alcohol, Cetearyl Alcohol, Dimethicone, Stearalkonium Chloride, Glycerin, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Caprylic/Capric Triglyceride, Tocopheryl Acetate, Propanediol, Lactic Acid, Octyldodecyl Citrate Crosspolymer, Panthenol, Panthenyl Ethyl Ether, Pantethine, Sodium PCA, Phytantriol, Stearamidopropyl Dimethylamine, Behentrimonium Chloride, Trehalose, Sodium Hyaluronate, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Polyquaternium-51, Urea, Alcohol Denat., BHT, Fragrance (Parfum), Linalool, Limonene, Butylphenyl Methylpropional, Potassium Sorbate, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "2.3K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-3-in-1-conditioner-P462835",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:45:57",
        "product_name": "Curl 3 in 1 Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2319705"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 33.8 oz/ 1000 mL"
                ],
                "price": [
                    "$153.00"
                ],
                "sku": "Item 2319762"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2496370"
            }
        ],
        "rating": "width:90.482%",
        "product_reviews": "145",
        "ingredients": " -Oil and Butter Blend: Contains vitamins and healthy oils to nourish hair. -Rich Moisture Mix: Provides moisturizing benefits.Water\\Aqua\\Eau, Cetyl Alcohol, Cetearyl Alcohol, Dimethicone, Stearalkonium Chloride, Glycerin, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Caprylic/Capric Triglyceride, Tocopheryl Acetate, Propanediol, Lactic Acid, Octyldodecyl Citrate Crosspolymer, Panthenol, Panthenyl Ethyl Ether, Pantethine, Sodium PCA, Phytantriol, Stearamidopropyl Dimethylamine, Behentrimonium Chloride, Trehalose, Sodium Hyaluronate, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Polyquaternium-51, Urea, Alcohol Denat., BHT, Fragrance (Parfum), Linalool, Limonene, Butylphenyl Methylpropional, Potassium Sorbate, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "7.2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-s-invisible-oil-hot-oil-concentrate-P451214",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:46:11",
        "product_name": "Hairdresser's Invisible Oil Hot Oil Concentrate",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 x .5 oz/ 15 mL treatments"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2266039"
            }
        ],
        "rating": "width:75.172%",
        "product_reviews": "29",
        "ingredients": " -Hairdresser’s Invisible Oil Six-Oil Blend: Conditions, softens, and adds shine. -Castor Oil: Conditions.    Helianthus Annuus (Sunflower) Seed Oil, Cocos Nucifera (Coconut) Oil, Dicetyldimonium Chloride, Glyceryl Behenate/Eicosadioate, Ricinus Communis (Castor) Seed Oil, Carthamus Tinctorius (Safflower) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Argania Spinosa (Argan) Kernel Oil, Vitis Vinifera (Grape) Seed Oil, Rosmarinus Officinalis (Rosemary) Leaf Extract, Gardenia Taitensis (Tiare) Flower Extract, Polyglyceryl-10 Pentaoleate, Glycine Soja (Soybean) Oil, Tocopherol, Water\\Aqua\\Eau, Isopropyl Alcohol, Fragrance (Parfum), Linalool, Hexyl Cinnamal, Butylphenyl Methylpropional.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "3.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-mini-sunday-clarifying-shampoo-P474307",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:46:24",
        "product_name": "Mini Sunday Clarifying Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2496354"
            }
        ],
        "rating": "width:71.112%",
        "product_reviews": "9",
        "ingredients": "-Panax Ginseng Root: Cleanses the scalp and encourages healthy hair and scalp. -Rosmarinus Officinalis (Rosemary) Leaf Extract: Acts as a scalp stimulate.-Salvia Officinalis (Sage) Leaf Extract: Natural clarifying agent that supports scalp and hair shaft.Water\\Aqua\\Eau, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Sodium Chloride, Panax Ginseng Root Extract, Salvia Officinalis (Sage) Leaf Extract, Glycerin, Magnesium Chloride, Rosmarinus Officinalis Leaf Oil, Magnesium Nitrate, Sodium Hydroxide, Citric Acid, Isoceteth-20, PPG-2 Hydroxyethyl Cocamide, Fragrance (Parfum), Limonene, Tetrasodium EDTA, Phenoxyethanol, Chlorphenesin, Methylchloroisothiazolinone, Methylisothiazolinone, Green 5 (CI 61570), Ext. Violet 2 (CI 60730).Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "4.5K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/surf-creme-rinse-conditioner-P378841",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:46:37",
        "product_name": "Surf Creme Rinse Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$45.00"
                ],
                "sku": "Item 1519438"
            }
        ],
        "rating": "width:73.762%",
        "product_reviews": "109",
        "ingredients": "-Conditioning Blend: Conditions and detangles hair. -Mineral Blend: Helps give hair soft, beachy texture. -Sea Botanical Blend: Crithmum Maritimum (Sea Fennel) Extract and Macrocystis Pyrifera (Kelp) Extract: Hydrates and softens. Water, Cetearyl Alcohol, Cetyl Alcohol, Stearyl Alcohol, Macrocystis Pyrifera (Kelp) Extract, Crithmum Maritimum Extract, Magnesium Sulfate, Ceteareth-20, Glycerin, Arachidyl Alcohol, Cetrimonium Chloride, Behentrimonium Chloride, Distearyldimonium Chloride, Polyquaternium-70, Polyquaternium-11, Hydroxyethylcellulose, Dipropylene Glycol, Tetrasodium Edta, Citric Acid, Fragrance, Linalool, Limonene, Hexyl Cinnamal, Methylchloroisothiazolinone, Methylisothiazolinone, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/full-potential-hair-preserving-conditioner-P399119",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:46:49",
        "product_name": "Full Potential Hair Preserving Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 1731710"
            }
        ],
        "rating": "width:72.77799999999999%",
        "product_reviews": "36",
        "ingredients": "Water, Cetyl Alcohol, Fragrance, Creatine, Trisodium Glycyrrhizate, Dipotassium Glycyrrhizate, Centella Asiatica (Hydrocotyl) Extract, Caffeine, Rosmarinus Officinalis (Rosemary) Leaf Extract, Yeast Extract/Faex/Extrait De Levure, Saccharomyces Lysate (Yeast) Extract, Betula Alba (Birch) Extract, Tocopheryl Acetate, Menthol, Acetyl Glucosamine, Poria Cocos (Hoelen Mushroom) Extract, Bisabolol, Phytantriol, Pantethine, Cholesterol, Phospholipids, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Hydrolyzed Wheat Protein Pg-Propyl Silanetriol, Dimethicone, Caprylic/Capric Triglyceride, Cetyl Ethylhexanoate, Cetearyl Alcohol, Behentrimonium Chloride, Biosaccharide Gum - 1, Stearalkonium Chloride, Glyceryl Stearate, Peg-100 Stearate, Hydroxyethylcellulose, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Ethylhexylglycerin, Disodium Cocoamphodiacetate, Potassium Sulfate, Alcohol Denat., Coumarin, Linalool, Benzyl Salicylate, Limonene, Butylphenyl Methylpropional, Disodium Edta, Phenoxyethanol .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "4.4K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-anti-humidity-gel-oil-P462838",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:47:01",
        "product_name": "Curl Anti-Humidity Gel Oil",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.0 oz/ 150 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2319747"
            }
        ],
        "rating": "width:72.858%",
        "product_reviews": "56",
        "ingredients": " -Oil and Butter Blend: Contains vitamins and healthy oils to nourish hair. -Rich Moisture Mix: Helps provide moisturizing benefits.Water\\Aqua\\Eau, Glycerin, Chondrus Crispus (Carrageenan), PEG-40 Hydrogenated Castor Oil, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Caprylyl Glycol, Tocopherol, Sucrose, Ethylhexylglycerin, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Xanthan Gum, Octyldodecyl Citrate Crosspolymer, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Sodium Chloride, Sodium Hydroxide, BHT, Fragrance (Parfum), Citral, Butylphenyl Methylpropional, Linalool, Geraniol, Limonene, Potassium Sorbate, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Oil"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bb-glow-thermal-protection-mist-P449139",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:47:15",
        "product_name": "Bb. Heat Shield Thermal Protection Mist",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.2 oz/ 125 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2431542"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2556926"
            }
        ],
        "rating": "width:92.038%",
        "product_reviews": "422",
        "ingredients": "-Honey Protective Complex: Repairs damage and helps prevent breakage.Water/Aqua/Eau, Alcohol Denat., Propanediol, Dicaprylyl Ether, Dimethicone, Honey/Mel/Miel, Simmondsia Chinensis (Jojoba) Seed Oil, Helianthus Annuus (Sunflower) Seed Oil, Hydrogenated Castor Oil/ Sebacic Acid Copolymer, Octyldodecyl Citrate Crosspolymer, Yeast Extract/Faex/Extrait De Levure, Coco-Caprylate/Caprate, Caprylic/Capric Triglyceride, Ethyl Macadamiate, Panthenol, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Glycine Soja (Soybean) Oil, Tocopherol, Polyglyceryl-10 Laurate, PEG-40 Hydrogenated Castor Oil, Cetrimonium Chloride, BHT, Butylene Glycol, Fragrance (Parfum), Limonene, Benzyl Salicylate, Linalool, Benzyl Benzoate, Citric Acid, Sodium Citrate, Phenoxyethanol.",
        "n_loves": "33.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Primers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/surf-spray-mini-P425464",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:47:27",
        "product_name": "Mini Surf Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 1432061"
            }
        ],
        "rating": "width:63.334%",
        "product_reviews": "48",
        "ingredients": " -Ascophyllum Nudosum (Seaweed) Extract: Extracted from naturally occurring seaweed; softens and smooths skin and moisturizes hair, increasing its elasticity, luster, and softness; helps decrease hair’s static charge, thus giving more body and less flyaways.\n-Macrocystis Pyrifera (Kelp) Extract: A natural seaweed extract with a high iodine and mineral content; contributes shine and manageability to hair; reduces the harshness of some chemicals; the nutritive value of this extract makes it ideal for skin preparations.\n-Magnesium Sulfate: Commonly known as Epsom salts; a natural mineral, which imparts astringent action.\nWater\\Aqua\\Eau, Magnesium Sulfate, Macrocystis Pyrifera (Kelp) Extract, Ascophyllum Nodosum Extract, Isoceteth-20, Citric Acid, PPG-5-Ceteth-20, Phenoxyethanol, Potassium Sorbate, Citronellol, Alpha-Isomethyl Ionone, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Linalool, Limonene, Hexyl Cinnamal, Butylphenyl Methylpropional, Fragrance (Parfum).\nPlease be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "9.6K",
        "categories": [
            "Mini Size",
            "Hair"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-and-bumble-surf-styling-leave-in-P443339",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:47:39",
        "product_name": "Surf Styling Leave In",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2218048"
            }
        ],
        "rating": "width:75%",
        "product_reviews": "88",
        "ingredients": "Water, Glycerin, Propanediol, Aloe Barbadensis Leaf Juice, Macrocystis Pyrifera (Kelp) Extract, Chondrus Crispus (Carrageenan) Extract, Cocos Nucifera (Coconut) Fruit Extract, Hypnea Musciformis (Algae) Extract, Algae Extract, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Salvia Officinalis (Sage) Leaf Extract, Panthenol, Polysorbate 20, Ethylhexylglycerin, Amp-Acrylates/Allyl Methacrylate Copolymer, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Citronellol, Limonene, Alpha-Isomethyl Ionone, Sodium Hydroxide, Citric Acid, Disodium EDTA, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "9.3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Leave-In Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/sumotech-flexible-cream-solid-P280508",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:47:51",
        "product_name": "Sumotech Flexible Cream Solid",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 42 g"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1270677"
            }
        ],
        "rating": "width:88.364%",
        "product_reviews": "220",
        "ingredients": "Water, Lanolin Wax/Lanolin Cera/Cire De Lanoline, Cetearyl Alcohol, Pvp, Tribehenin, Tridecyl Stearate, Glycerin, Alcohol Denat., Tridecyl Trimellitate, Peg-8 Beeswax, Ceteareth-25, Dipentaerythrityl Hexacaprylate/Hexacaprate, Peg-40 Castor Oil, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Tromethamine, Tetrasodium Edta, Phenoxyethanol, Potassium Sorbate, Benzyl Benzoate, Hexyl Cinnamal, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Eugenol, Linalool, Fragrance .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "10.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-curl-reactivator-P462839",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:48:04",
        "product_name": "Curl Reactivator",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 2319739"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 2496388"
            }
        ],
        "rating": "width:88.846%",
        "product_reviews": "208",
        "ingredients": " -Oil and Butter Blend: Contains vitamins and healthy oils to nourish hair. -Rich Moisture Mix: Helps provide moisturizing benefits.Water\\Aqua\\Eau, Propanediol, Butylene Glycol, Cetearyl Alcohol, Persea Gratissima (Avocado) Oil, Cocos Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Butyrospermum Parkii (Shea) Butter, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Glycerin, Glycine Soja (Soybean) Oil, Tocopherol, Lactic Acid, Stearamidopropyl Dimethylamine, Octyldodecyl Citrate Crosspolymer, Polyglyceryl-10 Dipalmitate, Polyglyceryl-10 Dioleate, Dimethicone, Dimethiconol, Cetrimonium Chloride, Distearyldimonium Chloride, Behentrimonium Methosulfate, Butyl Methoxydibenzoylmethane, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, BHT, Sodium Chloride, Sodium Hyaluronate, Fragrance (Parfum), Citral, Butylphenyl Methylpropional, Linalool, Geraniol, Limonene, Potassium Sorbate, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "16.2K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-hio-ultra-rich-conditioner-P476041",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:48:18",
        "product_name": "Hairdresser's Invisible Oil Ultra Rich Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2500270"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 15.2 oz/ 450 mL"
                ],
                "price": [
                    "$72.00"
                ],
                "sku": "Item 2521466"
            }
        ],
        "rating": "width:86.122%",
        "product_reviews": "49",
        "ingredients": "Water/Aqua/Eau, Cetearyl Alcohol, Butyrospermum Parkii (Shea) Butter, Dimethicone, Distearyldimonium Chloride, Stearamidopropyl Dimethylamine, Behentrimonium Methosulfate, Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius (Safflower) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Vitis Vinifera (Grape) Seed Oil, Macadamia Integrifolia Seed Oil, Argania Spinosa Kernel Oil, Citrullus Lanatus (Watermelon) Seed Oil, Gardenia Tahitensis (Tiare) Flower Extract, Hyaluronic Acid, Phospholipids, Arginine, Dicetyldimonium Chloride, Lactic Acid, Cetyl Esters, Ethylhexylglycerin, Hydroxypropyl Guar, Isopropyl Alcohol, Polymethylsilsesquioxane, Tocopherol, Fragrance (Parfum), Linalool, Hexyl Cinnamal, BHT, Disodium EDTA, Potassium Sorbate. ",
        "n_loves": "4.2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/straight-blow-dry-P297554",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:48:30",
        "product_name": "Straight Blow Dry",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1376318"
            }
        ],
        "rating": "width:87.186%",
        "product_reviews": "782",
        "ingredients": " -Heat Protecting Shield: Protects hair from heat styling and humidity.-Smoothing Blend: Lightweight silicones and other smoothing agents reduce frizz, smoothing and sealing the hair for soft style with body and movement.-Conditioning Blend: Conditions to add shine and control. Water, Dimethicone, Phenyl Trimethicone, Cetearyl Alcohol, Cetyl Alcohol, Transglutaminase, Malachite, Behentrimonium Chloride, Sapphire Powder, Polylysine, Glycerin, Pearl Powder, Panthenol, Polyquaternium-11, Caprylyl Glycol, Laureth-4, Tourmaline, Maltodextrin, Phenoxyethanol, Hexyl Cinnamal, Linalool, Butylphenyl Methylpropional, Limonene, Benzyl Salicylate, Citronellol, Benzyl Alcohol, Geraniol, Coumarin, Fragrance.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "22.3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/thickening-dryspun-finish-P381033",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:48:44",
        "product_name": "Thickening Dryspun Volume Texture Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.6 oz/ 150 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2129450"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2129468"
            }
        ],
        "rating": "width:83.864%",
        "product_reviews": "1.3K",
        "ingredients": " -PVP, VP/VA Copolymer: Provides light to medium hold.\n-PEG-12 Dimethicone and Hydrolyzed Wheat Protein: Nourishing agents.\t\n-Zeolite and Silk Powder: Provide texture and volume to hair. Hydrofluorocarbon 152a, Dimethyl Ether, Alcohol Denat., Vp/Va Copolymer, Zeolite, Silk Powder\\Serica\\Poudre De Soie, Helianthus Annuus (Sunflower) Seed Extract, Hydrolyzed Wheat Protein, Glycerin, PEG-12 Dimethicone, Phenethyl Benzoate, PVP, Fragrance, Linalool, Benzyl Benzoate, Hexyl Cinnamal, Butylphenyl Methylpropional, Limonene.\tPlease be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "64.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-sunday-purifying-clay-detox-shampoo-P504163",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:48:57",
        "product_name": "Sunday Purifying Clay Detox Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz / 150 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2653665"
            }
        ],
        "rating": "width:94.04199999999999%",
        "product_reviews": "376",
        "ingredients": "Unknown Ingredients",
        "n_loves": "2.8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-sunday-scalp-reset-foam-pre-shampoo-P504146",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:49:09",
        "product_name": "Sunday Scalp Reset Foam Pre Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.5 oz / 150 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2653681"
            }
        ],
        "rating": "width:92.244%",
        "product_reviews": "49",
        "ingredients": "-Salicylic Acid: Helps remove pore-clogging debris and dead skin cells.-Micellar Water: Helps to gently cleanse the scalp.Butane, Water/Aqua/Eau, Alcohol Denat., Isobutane, Glycerin, Butylene Glycol, Dimethicone, Fragrance (Parfum), Caprylic/Capric Triglyceride, PPG-8-Ceteth-20, Salicylic Acid, Caffeine, Epilobium Angustifolium Flower/Leaf/Stem Extract, Sodium Lauroamphoacetate, Panthenol, Tocopheryl Acetate, Punica Granatum (Pomegranate) Extract, Honey Extract/Mel/Extrait De Miel, Leuconostoc/Radish Root Ferment Filtrate, Wheat Amino Acids, Aloe Barbadensis Leaf Juice, Gellidiella Acerosa Extract, Hypnea Musciformis (Algae) Extract, Sargassum Filipendula (Algae) Extract, Citrus Tangerina (Tangerine), Zingiber Officinale (Ginger) Root Extract, Rice Amino Acids, Glyceryl Polyacrylate, Hydroxyethylcellulose, Biotin, Cellulose, Cocamide Mipa, Sodium Lauroyl Methyl Isethionate, Citric Acid, Linalool, Benzyl Salicylate, Citronellol, Limonene, Alpha-Isomethyl Ionone, Phenoxyethanol, Sodium Benzoate.",
        "n_loves": "1.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/gentle-shampoo-P280568",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:49:22",
        "product_name": "Gentle Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1270065"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 33.8 oz/ 1 L"
                ],
                "price": [
                    "$125.00"
                ],
                "sku": "Item 1328137"
            }
        ],
        "rating": "width:83.30399999999999%",
        "product_reviews": "333",
        "ingredients": "Ammonium Lauryl Sulfate, Citric Acid, Cocamide MEA, Coco-Betaine, Fragrance, Glycerin, Glyceryl Stearate SE, Guar Hydroxypropyltrimonium Chloride, Limonene, Methylparaben, PEG-150 Distearate, Persea Gratissima (Avocado) Oil, Phenoxyethanol, Polyquaternium-11, Polyquaternium-7, Sodium Benzoate, Sodium Chloride, Sodium Laureth Sulfate, Tetrasodium EDTA, Urtica Dioica (Nettle) Extract, Water, Yellow 5 (CI 19140), Yellow 6 (CI 15985).Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "14K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-rsquo-s-invisible-oil-shampoo-mini-P426165",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:49:35",
        "product_name": "Mini Hairdresser’s Invisible Oil Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 1696673"
            }
        ],
        "rating": "width:71.578%",
        "product_reviews": "19",
        "ingredients": "-Prunus Amygdalus Dulcis (Sweet Almond) Oil, Vitis Vinifera (Grape) Seed Oil, and Carthamus Tinctorius (Safflower) Seed Oil: Condition, soften, and add shine.Water, Disodium Laureth Sulfosuccinate, Sodium Cocoyl Isethionate, Sodium Lauryl Sulfoacetate, Glycerin, Sodium Lauroyl Sarcosinate, Coco-Betaine, Acrylates Copolymer, Decyl Glucoside, Butylene Glycol, Glycol Distearate, Laureth-23, Glycereth-26, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Integrifolia Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Tahitensis (Tiare) Flower Extract, Argania Spinosa Kernel Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Carthamus Tinctorius (Safflower) Seed Oil, Sodium Hyaluronate, Phenyl Trimethicone, Panthenyl Ethyl Ether, Sodium Pca, Pantethine, Polyquaternium-7, Polyquaternium-10, Potassium Hydroxide, Sodium Chloride, Sodium Sulfate, Fragrance, Linalool, Hexyl Cinnamal, Butylphenyl Methylpropional, Phenoxyethanol, Methylisothiazolinone, Methylchloroisothiazolinone. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "5K",
        "categories": [
            "Mini Size",
            "Hair"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/creme-de-coco-shampoo-P280567",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:49:48",
        "product_name": "Creme de Coco Shampoo",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1270040"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 33.8 oz/ 1 L",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$125.00"
                ],
                "sku": "Item 1328145"
            }
        ],
        "rating": "width:83.49%",
        "product_reviews": "275",
        "ingredients": " -Kukui Nut Oil: Moisturizes and soothes dry scalp.-Cocos Nucifera (Coconut) Oil and Extract: Conditions and promotes shine.-Avena Sativa (Oat) Kernel Extract.-Hydrolyzed Wheat Protein: Moisturizes, conditions, repairs, and adds gloss.-Hydrolyzed Soy Protein: Conditions, adds fullness, and promotes moisture.\n\n\n\nWater, Sodium Laureth Sulfate, Sodium Lauryl Sulfoacetate, Sodium Chloride, Sodium Sulfate, Cocos Nucifera (Coconut) Oil, Cocos Nucifera (Coconut) Fruit Extract, Silybum Marianum (Lady's Thistle) Extract, Malva Sylvestris (Mallow) Extract, Astrocaryum Murumuru Seed Butter, Avena Sativa (Oat) Kernel Extract, Aleurites Moluccana (Kukui) Seed Oil, Hydrolyzed Soy Protein, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Cocamide MEA, Glycerin, PEG-120 Methyl Glucose Dioleate, Glycol Distearate, Laureth-10, Propylene Glycol, Polyquaternium-10, Butylene Glycol, Quaternium-82, Gliadin, Polyquaternium-59, Acrylates Copolymer, Sodium Hydroxide, Citric Acid, Methylchloroisothiazolinone, Methylisothiazolinone, Chlorphenesin, Phenoxyethanol, Linalool, Limonene, Fragrance.\nPlease be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "10.8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-hairdresser-s-invisible-oil-72-hour-hydrating-hair-mask-P461139",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:50:01",
        "product_name": "Hairdresser's Invisible Oil 72 Hour Hydrating Hair Mask",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$61.00"
                ],
                "sku": "Item 2382299"
            }
        ],
        "rating": "width:87.57400000000001%",
        "product_reviews": "235",
        "ingredients": " -Signature Six-Oil Blend: Conditions, softens, and adds shine.-Moringa Oil and Pomegranate Seed Extract: Provide moisture. Water\\Aqua\\Eau, Cetearyl Alcohol, Distearyldimonium Chloride, Stearamidopropyl Dimethylamine, Cocos Nucifera (Coconut) Oil, Butyrospermum Parkii (Shea) Butter, Propanediol, Dimethicone, Behenyl Alcohol, Behentrimonium Chloride, Cetyl Esters, Gardenia Taitensis (Tiare) Flower Extract, Carthamus Tinctorius (Safflower) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Vitis Vinifera (Grape) Seed Oil, Macadamia Integrifolia Seed Oil, Argania Spinosa Kernel Oil, Moringa Oleifera Seed Oil, Punica Granatum (Pomegranate) Sterols, Glycine Soja (Soybean) Oil, Tocopherol, Lactic Acid, Dimethiconol, Guar Hydroxypropyltrimonium Chloride, Hydroxypropyl Guar, Arginine, Fragrance (Parfum), Linalool, Butylphenyl Methylpropional, Hexyl Cinnamal, Potassium Sorbate, Phenoxyethanol.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "10.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bumble-bumble-illuminated-blonde-purple-conditioner-P474030",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:50:13",
        "product_name": "Bb. Illuminated Blonde Purple Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2477933"
            }
        ],
        "rating": "width:96.364%",
        "product_reviews": "33",
        "ingredients": "-Polyquaternium-113: Preserves tone.-Behentrimonium Chloride: Detangles and smooths.-Shea Butter and Coconut Oil: Help amp up hair’s moisture levels.Water/Aqua/Eau, Cetearyl Alcohol, Behentrimonium Chloride, Propanediol, Cetyl Alcohol, Cocos Nucifera (Coconut) Oil, Cetyl Esters, Butylene Glycol, Hydrogenated Ethylhexyl Olivate, Nymphaea Caerulea Flower Extract, Amethyst Extract, Butyrospermum Parkii (Shea) Butter, Corylus Americana (Hazelnut) Seed Oil, Leuconostoc/Radish Root Ferment Filtrate, Hydrogenated Olive Oil Unsaponifiables, Guar Hydroxypropyltrimonium Chloride, PPG-3 Benzyl Ether Myristate, Amodimethicone, Cocos Nucifera (Coconut) Liquid Endosperm, Silicone Quaternium-8, Stearamine Oxide, Polyquaternium-70, Polyquaternium-113, Caprylyl Glycol, C11-15 Pareth-7, Polysilicone-15, Trideceth-3, Trideceth-15, Isododecane, Trideceth-12, Glycerin, Isopropyl Alcohol, Polysorbate 60, Trideceth-10, Hydroxyethylcellulose, Dipropylene Glycol, Laureth-9, Tin Oxide, Alcohol, Acetic Acid, Disodium Phosphate, Sodium Phosphate, Fragrance (Parfum), Alpha-Isomethyl Ionone, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Hydroxyacetophenone, Sodium Metabisulfite, Disodium EDTA, Cetrimonium Chloride, Phenoxyethanol, Mica, Titanium Dioxide (CI 77891), Ext. Violet 2 (CI 60730).",
        "n_loves": "2.2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pret-a-powder-dry-shampoo-powder-P384541",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:50:25",
        "product_name": "Prêt-à-Powder Dry Shampoo Powder",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 56 g"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1562859"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: .5 oz / 14 g"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 1668938"
            }
        ],
        "rating": "width:81.254%",
        "product_reviews": "1.5K",
        "ingredients": "Zea Mays (Corn) Starch, Montmorillonite, Tapioca Starch, Avena Sativa (Oat) Kernel Flour, Silica, Polysilicone-22, Fragrance (Parfum), Hexyl Cinnamal, Linalool, Citronellol, Limonene, Coumarin, Geraniol, Butylphenyl Methylpropional, Potassium Sorbate .Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "48.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/creme-de-coco-conditioner-P280572",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:50:39",
        "product_name": "Creme de Coco Conditioner",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$45.00"
                ],
                "sku": "Item 1270172"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 33.8 oz/ 1 L",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$129.00"
                ],
                "sku": "Item 1328194"
            }
        ],
        "rating": "width:77.83800000000001%",
        "product_reviews": "222",
        "ingredients": " -Kukui Nut Oil: Moisturizes and soothes dry scalp.-Cocos Nucifera (Coconut) Oil and Extract: Conditions and promotes shine.-Kukui Nut Oil: Moisturizes and soothes dry scalp.-Hydrolyzed Wheat Protein: Moisturizes conditions repairs and adds gloss.-Hydrolyzed Soy Protein: Conditions adds fullness and promotes moisture.\n\n\n\nWater, Cetearyl Alcohol, Glycerin, Behentrimonium Methosulfate, PEG-40 Hydrogenated Castor Oil, Stearalkonium Chloride, Cocos Nucifera (Coconut) Oil, Cocos Nucifera (Coconut) Fruit Extract, Silybum Marianum (Lady's Thistle) Extract, Malva Sylvestris (Mallow) Extract, Astrocaryum Murumuru Seed Butter, Limnanthes Alba (Meadowfoam) Seed Oil, Aleurites Moluccana (Kukui) Seed Oil, Ximenia Americana Seed Oil, Equisetum Hiemale (Horsetail) Extract, Urtica Dioica (Nettle) Leaf Extract, Macrocystis Pyrifera (Kelp) Extract, Avena Sativa (Oat) Kernel Extract, Panthenol, Hydrolyzed Soy Protein, Hydrolyzed Wheat Protein, Hydrolyzed Wheat Starch, Butylene Glycol, Stearyl Alcohol, Guar Hydroxypropyltrimonium Chloride, Polyquaternium-59, Vinegar, Phenoxyethanol, Chlorphenesin, BHT, Linalool, Limonene, Butylphenyl Methylpropional, Hydroxycitronellal, Fragrance.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "9.3K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hairdresser-s-invisible-oil-dry-oil-finishing-spray-P410733",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:50:52",
        "product_name": "Hairdresser’s Invisible Oil Dry Oil Finishing Spray",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.2 oz/ 95 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 1833136"
            }
        ],
        "rating": "width:78.49000000000001%",
        "product_reviews": "159",
        "ingredients": " -Vitis Vinifera (Grape) Seed Oil, Carthamus Tinctorius (Safflower) Seed Oil, Gardenia Tahitensis (Tiare) Flower Extract: Condition, soften, and add shine. Hydrofluorocarbon 152a, Isobutane, Alcohol Denat., Butane, Caprylyl Methicone, Carthamus Tinctorius (Safflower) Seed Oil, Vitis Vinifera (Grape) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Macadamia Ternifolia Seed Oil, Argania Spinosa Kernel Oil, Cocos Nucifera (Coconut) Oil, Vitis Vinifera (Grape) Seed Extract, Gardenia Tahitensis (Tiare) Flower Extract, Ethyl Trisiloxane, Glycerin, Water, Dimethicone, Phenylpropyldimethylsiloxysilicate, Ethylhexyl Methoxycinnamate, Trisiloxane, Cetrimonium Chloride, Trimethylsiloxyamodimethicone, Diisopropyl Adipate, C11-15 Pareth-7, C12-16 Pareth-9, Trideceth-12, Polyquaternium-59, Butylene Glycol, Tocopherol, Fragrance, Hexyl Cinnamal, Linalool, Limonene, Butylphenyl Methylpropional, Phenoxyethanol. Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "17.2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/brilliantine-P425469",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:51:04",
        "product_name": "Brilliantine",
        "brand_name": "Bumble and bumble",
        "options": [],
        "rating": "width:90%",
        "product_reviews": "10",
        "ingredients": " -Acetylated Lanolin Alcohol: Softens and smooths. -Glycerin: Softens.-PEG-40 Castor Oil: Add body and shine.-Ricinus Communis (Castor) Seed Oil: Adds sheen. Water, Glycerin, Caprylic/Capric Triglyceride, Ricinus Communis (Castor) Seed Oil, Oleyl Alcohol, Polybutene, Cetyl Acetate, Rosmarinus Officinalis (Rosemary) Leaf Extract, Salvia Officinalis (Sage) Leaf Extract, PEG-40 Castor Oil, Carbomer, Acetylated Lanolin Alcohol, Cetyl Alcohol, Arachidyl Alcohol, Myristyl Alcohol, Aminomethyl Propanol, Tetrasodium EDTA, Benzophenone-4, Phenoxyethanol, Methylparaben, Ethylparaben, Linalool, Butylphenyl Methylpropional, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Citronellol, Hydroxycitronellal, Benzyl Benzoate, Hexyl Cinnamal, Geraniol, Fragrance.Please be aware that ingredient lists may change or vary from time to time.  Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "2.5K",
        "categories": [
            "Mini Size",
            "Hair"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/prep-P280528",
        "error": "",
        "scrape_timestamp": "08/21/2023, 10:51:14",
        "product_name": "Prep",
        "brand_name": "Bumble and bumble",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 250 mL"
                ],
                "price": [
                    "$41.00"
                ],
                "sku": "Item 1270289"
            }
        ],
        "rating": "width:84.59400000000001%",
        "product_reviews": "296",
        "ingredients": "-Seaweed Extract: Moisturizes, increases elasticity, luster, and softness, and reduces flyaways.-Hops Extract: Provides conditioning properties.-Sea Kelp Extract: Adds shine and manageability.Water\\Aqua\\Eau, Ascophyllum Nodosum (Algae) Extract, Humulus Lupulus (Hops) Extract, Macrocystis Pyrifera (Kelp) Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Carthamus Tinctorius (Safflower) Seed Oil, Tocopheryl Acetate, Glycerin, Biotin, Cysteine, Retinyl Palmitate, Linoleic Acid, Gluconolactone, Linolenic Acid, Amodimethicone, Distearyldimonium Chloride, Calcium Gluconate, Isoceteth-20, Cetrimonium Chloride, Trideceth-10, Disodium EDTA, Citric Acid, Sodium Benzoate, Limonene, Fragrance (Parfum).",
        "n_loves": "16.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Primers"
        ]
    }
]