[
    {
        "url": "https://www.sephora.com/ca/en/product/age-bright-clearing-serum-P446410",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:32:08",
        "product_name": "AGE Bright Clearing Serum",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$104.00"
                ],
                "sku": "Item 2239598"
            }
        ],
        "rating": "width:90.848%",
        "product_reviews": "59",
        "ingredients": "-Salicylic Acid: Helps clear clogged follicles.-Age Bright™ Complex: Promotes the appearance of a brighter, more even skin tone.-Phytoactives from Resurrection Plant: Hydrate and smooth skin.Water, Niacinamide, Butylene Glycol, PEG-40 Hydrogenated Castor Oil, Salicylic Acid, Lentinus Edodes Mycelium Extract, Glyceryl Glucoside, Salvia Sclarea (Clary) Oil, Phytic Acid, Terpineol,  Thymol,  Citrus Aurantium Dulcis (Orange) Peel Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Lavandula Hybrida Oil, Pelargonium Graveolens Flower Oil, Lavandula Angustifolia (Lavender) Oil, Citrus Limon (Lemon) Peel Oi, Polydextrose, Glycerin, Dextrin, Amylopectin, Caprylyl Glycol, Ethylhexylglycerin, Xanthan Gum, Pentylene  Glycol,  Sodium  Hydroxide,  lsoamyl Laurate, Limonene, Linalool, Geraniol, Citronellol, Phenoxyethanol.",
        "n_loves": "4.9K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/precleanse-P423148",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:32:21",
        "product_name": "Precleanse Cleansing Oil",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.1 oz/ 150 mL"
                ],
                "price": [
                    "$68.00"
                ],
                "sku": "Item 2002079"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$21.00"
                ],
                "sku": "Item 2221109"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 10 oz / 295 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$104.00"
                ],
                "sku": "Item 2534105"
            }
        ],
        "rating": "width:90.316%",
        "product_reviews": "1.3K",
        "ingredients": "-Vitamin E: Nourishes and protects skin from damage. -Rice Bran: Gently exfoliates. -Rosemary: Protects skin from damage. Caprylic/Capric Triglycerides, Prunus Armeniaca (Apricot) Kernel Oil, PEG-40 Sorbitan Peroleate, Helianthus Annuus (Sunflower) Seed Oil, Citrus Aurantium Dulcis (Orange) Oil, Citrus Grandis (Grapefruit) Peel Oil, Cymbopogon Schoenanthus Oil, Borago Officinalis Seed Oil, Lavandula Angustifolia (Lavender) Oil, Rosmarinus Officinalis (Rosemary) Leaf Extract, Solanum Lycopersicum (Tomato) Extract, Lavandula Hybrida Oil, Citrus Nobilis (Mandarin Orange) Peel Oil, Oryza Sativa (Rice) Bran Oil, Carthamus Tinctorius (Safflower) Seed Oil, Aleurites Moluccana Seed Oil, Cetyl Ethylhexanoate, Dicaprylyl Carbonate, Tocopheryl Acetate, Tocopherol, C12-15 Alkyl Benzoate, Citral, Limonene, Linalool.",
        "n_loves": "57.4K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/ultracalming-cleanser-P423127",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:32:35",
        "product_name": "Ultracalming Cleanser",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.4 oz/ 250 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2002368"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16.9 oz/ 500 mL"
                ],
                "price": [
                    "$94.00"
                ],
                "sku": "Item 2010064"
            }
        ],
        "rating": "width:88.866%",
        "product_reviews": "203",
        "ingredients": " -Oat: Calms inflammation. -Lavender: Reduces redness.-Cucumber: Soothes skin irritation and reduces swelling. Water, Cetearyl Alcohol, Bisabolol, Zingiber Officinale (Ginger) Root Extract, Leuconostoc/Radish Root Ferment Filtrate, Glycerin, Avena Sativa (Oat) Kernel Extract, Cucumis Sativus (Cucumber) Fruit Extract, Rubus Idaeus (Raspberry) Fruit Extract, Lavandula Angustifolia (Lavender) Flower Extract, Salix Alba Bark Extract, Usnea Barbata (Lichen) Extract, Butylene Glycol , Pentylene Glycol , Hydroxyphenyl , ropamidobenzoic Acid, Citrus Medica Limonum (Lemon) Fruit Extract, Fumaria Officinalis Flower/Leaf/Stem Extract, Fumaric Acid, Echinacea Purpurea Extract, Panthenol, Acrylates/ C10-30 Alkyl Acrylate, rosspolymer, Cocamidopropyl PG-Dimonium Chloride Phosphate, Disodium Lauryl Sulfosuccinate, Cetrimonium Chloride, Aminomethyl Propanol, Glyceryl Caprylate, Disodium EDTA.",
        "n_loves": "12.9K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-porescreen-spf-40-P505779",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:32:48",
        "product_name": "Porescreen SPF 40",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$77.00"
                ],
                "sku": "Item 2685394"
            }
        ],
        "rating": "width:84.74600000000001%",
        "product_reviews": "59",
        "ingredients": "-Zinc Oxide: A physical sunscreen that protects against UVA and UVB rays.-Niacinamide: Diminishes the look of sebum oil and improves the appearance of pores.-Green Microalgae, Squalane, and Antioxidant Vitamin E Blend: Visibly moisturizes, softens, and smooths skin.Water/Aqua/Eau, Zinc Oxide, C12-15 Alkyl Benzoate, Octyldodecyl Neopentanoate, Butyloctyl Salicylate, Caprylic/Capric Triglyceride, Isododecane, Lauryl PEG-8 Dimethicone, Propanediol, Niacinamide, Methylpropanediol, Titanium Dioxide (CI 77891), Silica Silylate, Lactic Acid, Helianthus Annuus (Sunflower) Seed Oil, Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract, Chamomilla Recutita (Matricaria) Flower Extract, Rosa Damascena Extract, Chlorella Vulgaris Extract, Sea Salt (Maris Sal), Olive Oil Decyl Esters, Squalene, Tocopherol, Caprylyl Glycol, Lecithin, Allantoin, Propylene Glycol Stearate, Glycerin, Bisabolol, Lauryl PEG-10 Tris(Trimethylsiloxy)silylethyl Dimethicone, PEG-10, Silica, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Magnesium Stearate, Tetrasodium Glutamate Diacetate, Citric Acid, Sodium Hydroxide, Sodium Chloride, Bentonite, Cellulose Acetate, Phenylpropanol, Hydrated Silica, Acrylates/Ammonium Methacrylate Copolymer, Iron Oxides (CI 77491, CI 77492, CI 77499), Linalool.",
        "n_loves": "1.5K",
        "categories": [
            "Skincare",
            "Sunscreen",
            "Face Sunscreen"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-active-clay-prebiotic-cleanser-P456569",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:32:59",
        "product_name": "Active Clay Prebiotic Cleanser",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.1 oz/ 150 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2318053"
            }
        ],
        "rating": "width:92.5%",
        "product_reviews": "24",
        "ingredients": "-Kaolin Clay: Helps absorb excess oil and exfoliates skin to remove dead cells, dirt, grime, and visible signs of pollution.-Activated Binchotan Charcoal: Removes impurities and minimizes the appearance of pores.-Murumuru Seed: Provides nutrients and protection from free-radical and sun damage.Water/Aqua/Eau, Sodium Cocoyl Isethionate, Glycerin, Carthamus Tinctorius (Safflower) Seed Oil, Kaolin, Glyceryl Stearate SE, PEG-100 Stearate, Propanediol, Coconut Acid, Butylene Glycol, Charcoal Powder, Sodium Astrocaryum Murumuruate, Brassica Oleracea Italica (Broccoli) Extract, Bioflavonoids, Citrus Grandis (Grapefruit) Peel Oil, Palmitic Acid, Sodium Isethionate, Aloe Barbadensis Leaf Extract, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Cocamidopropyl Betaine, Tocopheryl Acetate, Myristic Acid, Quartz, Stearic Acid, Ethylhexylglycerin, Citric Acid, O-Cymen-5-Ol, Cetearyl Alcohol, Polysorbate 60, Pentylene Glycol, Polyacrylate Crosspolymer-6, Caprylyl Glycol, Tetrasodium Glutamate Diacetate, Sodium Hydroxide, Disodium EDTA, Citral, Limonene, CI 77891. ",
        "n_loves": "6.8K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-neck-fit-contour-serum-P467759",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:33:11",
        "product_name": "Neck Fit Contour Serum",
        "brand_name": "Dermalogica",
        "options": [],
        "rating": "width:80%",
        "product_reviews": "5",
        "ingredients": "-Flex Lift Contour Technology: Visibly lifts and tightens while smoothing the look of fine lines.  -Rye Seed Extract, Palmitoyl Tripeptide-42, and Rambutan Extract: Deliver retinol-like results, visibly toning the skin.-Resurrection-Plant-Inspired Polysaccharide: Supports the skin’s moisture barrier for a smooth, even appearance. Water/Aqua/Eau, Adipic Acid/Neopentyl Glycol Crosspolymer, Acacia Senegal Gum, Ammonium Acryloyldimethyltaurate/VP Copolymer, Hydroxyacetophenone, Pentylene Glycol, Hydrogenated Ethylhexyl Olivate, Pentasodium Tetracarboxymethyl Acetylhydroxyprolyl Dipeptide-12, Pentasodium Tetracarboxymethyl Dipeptide-51, Palmitoyl Tripeptide-42, Helianthus Annuus (Sunflower) Seed Oil, Hydrogenated Olive Oil Unsaponifiables, Griffonia Simplicifolia Seed Extract, Secale Cereale (Rye) Seed Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Caesalpinia Spinosa Fruit Extract, Nephelium Lappaceum Leaf Extract, Kappaphycus Alvarezii Extract, Citrus Aurantium Dulcis (Orange) Peel Oil, Pelargonium Graveolens Flower Oil, Ilex Paraguariensis Leaf Extract, Leuconostoc/Radish Root Ferment Filtrate, Vetiveria Zizanoides Root Oil, Prunus Amygdalus Amara (Bitter Almond) Kernel Oil, Ferula Galbaniflua (Galbanum) Resin Oil, Mimosa Tenuiflora Bark Extract, Dipteryx Odorata Seed Extract, Maltodextrin, Ethylhexylglycerin, Glyceryl Glucoside, Caprylyl Glycol, Glycerin, Rhizobian Gum, Trisodium Phosphate, Citric Acid, Tetrasodium Glutamate Diacetate, 1,2-Hexanediol, Sodium Benzoate, Sodium Hydroxide, Sodium Glycolate, Sodium Formate, Limonene, Linalool, Citronellol, Geraniol, Coumarin. ",
        "n_loves": "1.7K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/age-reversal-eye-complex-P423145",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:33:21",
        "product_name": "Age Reversal Eye Complex",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$109.00"
                ],
                "sku": "Item 2002293"
            }
        ],
        "rating": "width:73.334%",
        "product_reviews": "24",
        "ingredients": " -Retinol: Accelerates skin’s natural repair process. -Niacinamide: Provides anti-inflammatory properties that help de-buff skin. -Ash Tree Bark Extract: Maintain hydration and reduces dark circles. Water, Methylheptyl Isostearate, Cyclopentasiloxane, Cetyl Alcohol, Diglycerin, Dimethicone, Pentylene Glycol, Prunus Armeniaca (Apricot) Kernel Oil, Glyceryl Stearate PEG-100 Stearate, Isohexadecane, Propanediol, Glycerinm, Niacinamide, Palmitoyl Tetrapeptide-7, Sodium Ascorbyl Phosphate, Laminaria Digitata Extract, Retinol, Saccharomyces Lysate Extract, Palmitoyl Tripeptide-5, Avena Sativa (Oat) Kernel Extract, Dunaliella Salina Extract Panthenol, Hydrolyzed Lupine Protein, Dipeptide-2, Ascorbyl Palmitate, Sodium Hyaluronate, Medicago Sativa (Alfalfa) Seed Extract, Saccharomyces Lysate Extract, Hydrolyzed Soy Protein, Glycyrrhiza Glabra (Licorice) Root Extract, Bisabolol, Caffeine, Glucosamine HCL, Aleurites Moluccanus Seed Oil, Fraxinus Excelsior Bark Extract, Tocopherol, Silanetriol, Palmitoyl Tripeptide-1, Ceramide 3, Lecithin, Arginine/Lysine Polypeptide, Tremella Fuciformis Polysaccharide, Camellia Sinensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Tocopheryl Acetate, Corallina Officinalis Extract, Dimethiconol, Hesperidin Methyl Chalcone, Pantolactone, Ceramide NP, Sodium Lactate, Leuconostoc/Radish Root Ferment Filtrate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Laureth-23, Oryza Sativa (Rice) Bran Extract, Urea, Polyglycerin-3, Helianthus Annuus (Sunflower) Seed Oil, Cetyl Palmitate, Trideceth-6 Phosphate, Butylene Glycol, Carbomer, Potassium Sorbate, Oleth-20, Sodium Acrylates Copolymer, Isostearic Acid, Steareth-20, Polysorbate 20, Caprylic/Capric Triglycerides, Disodium EDTA, Sodium Benzoate, BHA, Potassium Citrate, Citric Acid, BHT, Sodium Hydroxide, Aminomethyl Propanol, Ethylhexylglycerin, Phenoxyethanol.",
        "n_loves": "4.8K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/intensive-moisture-balance-P443358",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:33:33",
        "product_name": "Intensive Moisture Balance Moisturizer",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$63.00"
                ],
                "sku": "Item 2221166"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$99.00"
                ],
                "sku": "Item 2230530"
            }
        ],
        "rating": "width:89.09%",
        "product_reviews": "154",
        "ingredients": "-BioReplenish Complex™: Proven combination of hydrating lipids to enhance skin's natural resilience. -Chlorella Algae Complex: A powerful prebiotic that helps rebalance the skin’s natural microbiome. -Hyaluronic Acid and Aloe Vera: Lock in hydration to enhance the skin’s moisture content.Water, Ethylhexyl Hydroxystearate, Butylene Glycol, Cetearyl Ethylhexanoate, Cetyl Caprylate, Stearic Acid, PEG-8, Octyldodecanol, Dimethicone, Glyceryl Stearate SE, PEG-100 Stearate, Sodium Hyaluronate, Hydrolyzed Sodium Hyaluronate, Sodium Ascorbyl Phosphate, Chlorella Vulgaris Extract, Ceramide NP, Phytosterols, Centella Asiatica Extract, Linoleic Acid, Echinacea Purpurea Extract, Aloe Barbadensis Extract, Palmitic Acid, Myristic Acid, Rosa Centifolia Flower Extract, Lactic Acid, Linolenic Acid, Propanediol, Tocopherol, Potassium Cetyl Phosphate, Helianthus Annuus (Sunflower) Seed Oil, Tetrasodium Glutamate Diacetate, Ethylhexylglycerin, Cetyl Alcohol, Carbomer, Hydroxystearic Acid, Aminomethyl Propanol, Sodium Hydroxide, Phenoxyethanol.",
        "n_loves": "11.6K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/special-cleansing-gel-P423136",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:33:45",
        "product_name": "Special Cleansing Gel",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.4 oz/ 250 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2002103"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16.9 oz/ 500 mL"
                ],
                "price": [
                    "$94.00"
                ],
                "sku": "Item 2010171"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$18.00"
                ],
                "sku": "Item 2221091"
            }
        ],
        "rating": "width:90.01400000000001%",
        "product_reviews": "737",
        "ingredients": " -Lavender: Soothes skin.-Quillaja Saponaria Bark Extract: Naturally foams and cleanses.  Water/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, Sodium Lauroyl Sarcosinate, Butylene Glycol, Hydroxyethylcellulose,Lavandula Angustifolia (Lavender) Oil, Quillaja Saponaria Bark Extract, Citrus Limon (Lemon) Peel Oil, Melissa Officinalis Leaf Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Cymbopogon Nardus (Citronella) Oil, Glycerin, Cocamidopropyl Betaine, Sodium Cocoamphoacetate, Hydroxyacetophenone, Cocamidopropyl Hydroxysultaine, 1,2-Hexanediol, Caprylyl Glycol, Propanediol, Citric Acid, O-Cymen-5-Ol, Disodium EDTA, PPG-5-Ceteth-20, Sodium Hydroxide, Sodium Benzoate",
        "n_loves": "38.8K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-clear-start-breakout-clearing-kit-P480292",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:33:58",
        "product_name": "Clear Start Breakout Clearing Kit",
        "brand_name": "Dermalogica",
        "options": [],
        "rating": "width:92%",
        "product_reviews": "5",
        "ingredients": "-Salicylic Acid: Dives deep into pores, clearing dead skin cells and trapped oils.-Niacinamide: Reinforces skin’s defensive barrier and helps to even skin tone.-Hyaluronic Acid: Locks in moisture to intensely hydrate skin.Breakout Clearing Foaming Wash:Active ingredient: Salicylic Acid .50%. Other ingredients: Water/Aqua/Eau, Cocamidopropyl Betaine, Sodium Lauroyl Methyl Isethionate, Acrylates/Beheneth-25 Methacrylate Copolymer, Polysorbate-20, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Lavandula Angustifolia (Lavender) Oil, Oleanolic Acid, Butylene Glycol, Enantia Chlorantha Bark Extract, Disodium Cocoamphodiacetate, Spiraea Ulmaria Extract, Camellia Sinensis Leaf Extract, Porpyra Umbilicalis Extract, Glycyrrhiza Glabra (Licorice) Rhizome/Root Extract, Sodium Hydroxide, Ethylhexylglycerin, Phenoxyethanol.Breakout Clearing Booster:Water/Aqua/Eau, PPG-15 Stearyl Ether, Glycerin, Butylene Glycol, Isopropyl Lauroyl Sarcosinate, Niacinamide, Salicylic Acid, Cetearyl Glucoside, Polysorbate 20, Chlorella Vulgaris Extract, Thymol, Terpineol, Citrus Aurantium Dulcis (Orange) Peel Oil, Chondrus Crispus Extract, Lactic Acid, Sodium Hyaluronate, Tocopherol, Dimethicone, Lecithin, Pullulan, Sclerotium Gum, Xanthan Gum, Propanediol, Gluconolactone, Silica, Ethylhexylglycerin, Tetrasodium Glutamate Diacetate, Sodium Citrate, Sodium Benzoate, Sodium Hydroxide, Phenoxyethanol.Cooling Aqua Jelly:Water/Aqua/Eau, Glycerin, Sodium Hyaluronate, Carbomer, Caprylhydroxamic Acid, Sodium Hydroxide, Sorbitan Oleate Decylglucoside Crosspolymer, Citrus Limon (Lemon) Peel Extract, Citrus Aurantium Dulcis (Orange) Peel Extract, Cinnamomum Zeylanicum Leaf Oil, Vanilla Planifolia Fruit Extract, Eugenia Caryophyllus (Clove) Leaf Oil, Eugenia Caryophyllus (Clove) Flower Extract, Cinnamomum Zeylanicum Bark Oil, Propanediol, Maclura Cochinchinensis Leaf Prenylflavonoids, Vaccinium Angustifolium (Blueberry) Fruit Extract, Haslea Ostrearia Extract, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Corallina Officinalis Extract, Coccinia Indica Fruit Extract, Solanum Melongena (Eggplant) Fruit Extract, Aloe Barbadensis Flower Extract, Ocimum Sanctum Leaf Extract, Ocimum Basilicum (Basil) Flower/Leaf Extract, Curcuma Longa (Turmeric) Root Extract, Phenethyl Alcohol, Tanacetum Annuum Flower Oil, Sodium Chloride.",
        "n_loves": "1.1K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/blackhead-clearing-fizz-mask-P435787",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:34:08",
        "product_name": "Clear Start Blackhead Clearing Fizz Mask",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2147064"
            }
        ],
        "rating": "width:84.33999999999999%",
        "product_reviews": "341",
        "ingredients": "Water, Disiloxane, Sulfur, Cocamidopropyl Betaine, Kaolin, Glycerin, Pyrus Malus (Apple) Fruit Extract, Disodium Cocoyl Glutamate, Acacia Senegal Gum, Polyacrylate-33, Hectorite, Butylene Glycol, Zingiber Officinale (Ginger) Root Oil, Quartz, Lecithin, Caprylic/Capric Triglyceride, Tocopherol, Rosmarinus Officinalis (Rosemary) Leaf Oil, Curcuma Longa (Turmeric) Root Extract, Eucalyptus Globulus Leaf Oil, Citrus Reticulata (Tangerine) Leaf Oil, Thymus Vulgaris (Thyme) Flower/Leaf Oil, Salvia Sclarea (Sage) Oil, Mentha Viridis (Spearmint) Leaf Oil, Mentha Piperita (Peppermint) Oil, Lavandula Angustifolia (Lavender) Oil, Abies Sibirica Oil, Aniba Rosaeodora (Rosewood) Wood Oil, Cymbopogon Nardus (Citronella) Oil, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Sodium Cocoyl Threoninate, Xanthan Gum, Microcrystalline Cellulose, Sodium Cocoyl Glutamate, Sodium Citrate, Pentylene Glycol, Sodium Hydroxide, Ethylhexylglycerin, Caprylyl Glycol, Tetrasodium Glutamate Diacetate, Phenoxyethanol.",
        "n_loves": "10.7K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/calm-water-gel-ultra-calming-P428240",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:34:20",
        "product_name": "Calm Water Gel Moisturizer ",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$76.00"
                ],
                "sku": "Item 2046381"
            }
        ],
        "rating": "width:87.09%",
        "product_reviews": "220",
        "ingredients": " -Apple Fruit Extract: Helps soften skin.  -Glycerin: Helps hydrate skin.  -Cactus Pear: Helps soothe sensitive skin.  Water, Glycerin, Aloe Barbadensis (Aloe) Leaf Juice, Dimethicone, Butylene Glycol, Pyrus Malus (Apple) Fruit Extract, 1,2-Hexanediol, Diethylhexyl Carbonate, Opuntia Ficus-Indica Stem Extract, Sodium Hyaluronate, Dipotassium Glycyrrhizate, Hydrolyzed Sodium Hyaluronate, Lavandula Angustifolia (Lavender) Flower Extract, Stearyl Heptanoate, Cetyl PEG/PPG-10/1 Dimethicone, Hydroxyacetophenone, Sea Salt, Dimethicone Crosspolymer, Stearyl Caprylate, Lauryl PEG-9 Polydimethylsiloxyethyl Dimethicone, Potassium Sorbate Citric Acid, Sodium Benzoate, Disodium Phosphate, Linalool, Limonene.",
        "n_loves": "9.4K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/renewal-lip-complex-P423452",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:34:32",
        "product_name": "Renewal Lip Complex",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 0.06 oz/ 1.75 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 2010114"
            }
        ],
        "rating": "width:64%",
        "product_reviews": "10",
        "ingredients": "Bis-Diglyceryl Polyacyladipate-2, Ricinus Communis (Castor) Seed Oil, Synthetic Beeswax, Tocopheryl Acetate, Di-C12-15 Alkyl Fumarate, Euphorbia Cerifera (Candelilla) Wax, Theobroma Cacao (Cocoa) Seed Butter, Lauryl Lactate, Arginine/Lysine Polypeptide, Palmitoyl Oligopeptide, Persea Gratissima (Avocado) Oil, Oryza Sativa (Rice) Bran Oil, Triticum Vulgare (Wheat) Germ Oil, Butyrospermum Parkii (Shea Butter), Sodium Hyaluronate, Carthamus Tinctorius (Safflower) Seed Oil, Safflower Oil/Palm Oil Aminopropanediol Esters, Squalane, Ethylhexyl Palmitate, Silica Dimethyl Silylate, Butylene Glycol, Tribehenin, Sorbitan Isostearate, Stevioside, PEG-40 Hydrogenated Castor Oil, VP/Eicosene Copolymer, Benzyl Alcohol, Flavor.",
        "n_loves": "930",
        "categories": [
            "Skincare",
            "Lip Balms & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/liquid-peelfoliant-P506088",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:34:44",
        "product_name": "Liquid Peelfoliant Exfoliator with AHA BHA & PHA",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 2 oz / 59 ml",
                    "NEW"
                ],
                "price": [
                    "$89.00"
                ],
                "sku": "Item 2588747"
            }
        ],
        "rating": "width:96.05600000000001%",
        "product_reviews": "289",
        "ingredients": "-Glycolic Acid: Helps support skin, visibly clears pores, and evens the look of skin tone.-Lactic Acid: An AHA with exfoliating, brightening, and hydrating benefits.-Upcycled Cranberry Extract: Promotes radiant, long-lasting hydration.Water/Aqua/Eau, Lactobacillus/Punica Granatum Fruit Ferment Extract, Glycolic Acid,Aminomethyl Propanol, Phytic Acid, Gluconolactone, Glycerin, Propanediol, Lactic Acid, Salicylic Acid, Tranexamic Acid, Hydroxyacetophenone, Sodium Hyaluronate, Hydrolyzed Gardenia Florida Extract, Zanthoxylum Bungeanum Fruit Extract, Vaccinium Macrocarpon (Cranberry) Fruit Extract, Helianthus Annuus (Sunflower) Seed Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Citrus Nobilis (Mandarin Orange) Peel Oil, Leuconostoc/Radish Root Ferment Filtrate, Raspberry Ketone, Rosa Damascena Flower, Sodium Pca, Sucrose Distearate, Succinoglycan, Urea, Ceramide Np, Phytosphingosine, Hydrogenated Lecithin, Caprylyl Glycol, Oleyl Alcohol, Triolein, Caprylic/Capric Triglyceride, Oleic Acid, Ethoxydiglycol, Cholesterol, Trehalose, Polyquaternium-51, Maltodextrin, Ethyl Acetate, Caprylhydroxamic Acid, 1,2-Hexanediol, Polyacrylate Crosspolymer-6, Stearic Acid, Gamma-Undecalactone.",
        "n_loves": "5.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-awaken-peptide-depuffing-eye-gel-P479692",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:34:56",
        "product_name": "Awaken Peptide Depuffing Eye Gel",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$82.00"
                ],
                "sku": "Item 2532745"
            }
        ],
        "rating": "width:94.11%",
        "product_reviews": "275",
        "ingredients": "-Caffeine: Known to reduce the appearance of puffiness around the eyes.-Tetrapeptide Blend: A blend of highly active peptides that visibly firms and smooths skin to reduce the look of puffiness.-Rosemary Leaf Extract: Soothes skin and minimizes swelling.Water/Aqua/Eau, Polysilicone-11, Glycerin, Maltodextrin, Magnesium Aluminum Silicate, Butylene Glycol, Pyrus Malus (Apple) Fruit Extract, Palmitoyl Tetrapeptide-7, Caffeine, Rosmarinus Officinalis (Rosemary) Leaf Extract, Coleus Forskohlii Root Extract, Helichrysum Italicum Extract, Voandzeia Subterranea Seed Extract, Lactic Acid, Hydrolyzed Jojoba Esters, Pentylene Glycol, Hydroxyacetophenone, Diosmine, Polyglyceryl-10 Laurate, Caprylyl Glycol, Laureth-12, Chrysin, Xanthan Gum, Ethylhexylglycerin, Polyglyceryl-4 Caprate, Sorbitan Oleate, Tetrasodium Glutamate Diacetate, Barium Sulfate, Sodium Carbonate, Polysorbate 20, Sodium Hydroxide, Propanediol, Sodium Polyacryloyldimethyl Taurate, Succinic Acid.",
        "n_loves": "11.2K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/clearing-skin-wash-P446412",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:35:08",
        "product_name": "Clearing Skin Wash",
        "brand_name": "Dermalogica",
        "options": [],
        "rating": "width:72%",
        "product_reviews": "25",
        "ingredients": "-Salicylic Acid: Stimulates natural exfoliation to help clear clogged follicles. -Menthol and Camphor: Helps cool and calm the skin.  Water, Salicylic Acid .50%, Cocamidopropyl Betaine, Disodium Cocoamphodiacetate, Sodium Lauroyl Methyl Isethionate, Melissa Officinalis Leaf Extract, Angelica Archangelica Extract, Echinacea Angustifolia Extract, Allium Sativum (Garlic) Bulb Extract, Chamomilla Recutita (Matricaria) Flower Extract, Eucalyptus Globulus Leaf Extract, Salvia Officinalis (Sage) Extract, Passiflora Incarnata Extract, Citrus Medica Limonum (Lemon) Peel Extract, Hamamelis Virginiana (Witch Hazel) Extract, Ophiopogon Japonicas Root Extract, Echinacea Purpurea Extract, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Lactic Acid, Algae Extract, Menthol, Sodium PCA, Dipotassium Glycyrrhizate, Camphor, PEG-120 Methyl Glucose Dioleate, Phenoxyethanol, Butylene Glycol, Benzyl PCA, Disodium EDTA Copper, Citral, Limonene, Geraniol, Citronellol.",
        "n_loves": "2K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/stress-positive-eye-lift-P423143",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:35:19",
        "product_name": "Stress Positive Eye Lift Mask ",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 0.85 oz/ 25 mL",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$102.00"
                ],
                "sku": "Item 2002194"
            }
        ],
        "rating": "width:83.244%",
        "product_reviews": "37",
        "ingredients": " -Fermented Yeast: Firms skin to help generate a lifting effect.-Wild Indigo Seed: Visibly de-puffs. -Bioactive Diglucosyl Gallic Acid: Brightens skin.  Water, Dimethicone, Pentylene Glycol, Sorbitol, Simmondsia Chinensis (Jojoba) Seed Oil, Butylene Glycol, Glycerin, PEG-40 Hydrogenated Castor Oil, Saccharomyces Ferment Lysate Filtrate, Tephrosia Purpurea Seed Extract, Hydrolyzed Sodium Hyaluronate, Niacinamide, Diglucosyl Gallic Acid, Citrus Reticulata (Tangerine) Leaf Oil, Ammonium Acryloyldimethyltaurate/VP Copolymer, Maris Aqua (Sea Water), Propanediol, Sodium Hyaluronate, Vetiveria Zizanoides Root Oil, Lavandula Angustifolia (Lavender) Oil, Rosa Damascena Flower Oil, Salvia Sclarea (Clary) Oil, Hydrolyzed Algin, Aniba Rosaeodora (Rosewood) Wood Oil, Cananga Odorata Flower Oil, Glyceryl Stearate SE, Methyl Lactate, PEG-100 Stearate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Tocopherol, Sucrose, Caprylic/Capric Triglyceride, Ethylhexylglycerin, Sodium Hydroxide, Tetrasodium Glutamate Diacetate, Aminomethyl Propanol, Xanthan Gum, Linalool, Geraniol, Phenoxyethanol.",
        "n_loves": "9.5K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-discover-healthy-skin-kit-P460624",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:35:32",
        "product_name": "Discover Healthy Skin Kit",
        "brand_name": "Dermalogica",
        "options": [],
        "rating": "width:92.362%",
        "product_reviews": "419",
        "ingredients": "-Papaya Enzymes (Daily Microfoliant Exfoliator): Gentle enough for daily use to improve the look of skin’s texture. -Apricot Kernel and Kukui Nut Oils (Precleanse Cleansing Oil): Sooth, nourish, and moisturize the skin.-Active HydraMesh Technology™ (Skin Smoothing Cream): Infuses skin with up to 48 hours of continuous hydration. Precleanse:Caprylic/Capric Triglyceride, Prunus Armeniaca (Apricot) Kernel Oil, PEG-40 Sorbitan Peroleate, Helianthus Annuus (Sunflower) Seed Oil, Citrus Aurantium Dulcis (Orange) Oil, Citrus Grandis (Grapefruit) Peel Oil, Cymbopogon Schoenanthus Oil, Borago Officinalis Seed Oil, Lavandula Angustifolia (Lavender) Oil, Rosmarinus Officinalis (Rosemary) Leaf Extract, Solanum Lycopersicum (Tomato) Extract, Lavandula Hybrida Oil, Citrus Nobilis (Mandarin Orange) Peel Oil, Oryza Sativa (Rice) Bran Oil, Ascorbyl Palmitate, Aleurites Moluccanus Seed Oil, Cetyl Ethylhexanoate, Dicaprylyl Carbonate, Tocopheryl Acetate, Tocopherol, C12-15 Alkyl Benzoate, Citral, Limonene, Linalool.Special Cleansing Gel:Water/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, Sodium Lauroyl Sarcosinate, Butylene Glycol, Hydroxyethylcellulose, Lavandula Angustifolia (Lavender) Oil, Quillaja Saponaria Bark Extract, Citrus Limon (Lemon) Peel Oil, Melissa Officinalis Leaf Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Cymbopogon Nardus (Citronella) Oil, Glycerin, Cocamidopropyl Betaine, Sodium Cocoamphoacetate, Hydroxyacetophenone, Cocamidopropyl Hydroxysultaine, 1,2-Hexanediol, Caprylyl Glycol, Propanediol, Citric Acid, O-Cymen-5-Ol, Disodium EDTA, PPG-5-Ceteth-20, Sodium Hydroxide, Sodium Benzoate.  Daily Microfoliant:Microcrystalline Cellulose, Magnesium Oxide, Sodium Cocoyl Isethionate, Colloidal Oatmeal, Disodium Lauryl Sulfosuccinate, Sodium Lauroyl Glutamate, Oryza Sativa (Rice) Bran Extract, Oryza Sativa (Rice) Starch, Hydrogenated Coconut Acid, Allantoin, Papain, Salicylic Acid, Ginkgo Biloba Leaf Extract, Camellia Sinensis Leaf Extract, Glycyrrhiza Glabra (Licorice) Root Extract, PCA, Populus Tremuloides Bark Extract, Cyclodextrin, Sodium Isethionate, Lauryl Methacrylate/Glycol Dimethacrylate Copolymer, Maltodextrin, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Citrus Paradisi (Grapefruit) Peel Oil, Sodium Dehydroacetate, Hydrolyzed Corn Starch Hydroxyethyl Ether, Water/Aqua/Eau, Limonene, Citric Acid.Skin Smoothing Cream:Water/Aqua/Eau, Caprylic/Capric Triglyceride, Ethylhexyl Hydroxystearate, Butylene Glycol, Glycerin, Palmitic Acid, Dimethicone, PEG-8, Stearic Acid, Cetearyl Alcohol, Sodium Hyaluronate, Aloe Barbadensis Extract, Vitis Vinifera (Grape) Seed Extract, Saccharide Isomerate, Cucumis Sativus (Cucumber) Fruit Extract, Arnica Montana Flower Extract, Hedera Helix (Ivy) Extract, Malva Sylvestris (Mallow) Flower Extract, Parietaria Officinalis Extract, Sambucus Nigra Flower Extract, Ascorbyl Palmitate, Trehalose, Algin, Hydrolyzed Sodium Hyaluronate, Serine, Linoleic Acid, Phospholipids, Phytosterols, Cananga Odorata Flower Oil, Urea, Hydrogenated Lecithin, Pullulan, Caprylhydroxamic Acid, Citrus Aurantium Amara (Bitter Orange) Flower Extract, Tocopheryl Acetate, Tetrasodium Glutamate Diacetate, Hexanediol, Pentylene Glycol, Glyceryl Polyacrylate, Sodium Citrate, Disodium Phosphate, Palmitoyl Hydroxypropyltrimonium Amylopectin/Glycerin Crosspolymer, Caprylyl Glycol, Potassium Phosphate, Citric Acid, Tocopherol, Methylpropanediol, Polysorbate 60, Panthenol, Polyquaternium-10, Cetyl Alcohol, PEG-100 Stearate, Glyceryl Stearate, Aminomethyl Propanol, Carbomer, Ethylhexylglycerin, Sodium Hydroxide, Hydroxystearic Acid, Myristic Acid, BHT, Benzyl Benzoate, Benzyl Salicylate, Linalool, Sodium Benzoate, Phenoxyethanol.",
        "n_loves": "26K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-clear-start-liquid-peel-P502616",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:35:42",
        "product_name": "Clear Start Liquid Peel",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$41.00"
                ],
                "sku": "Item 2627297"
            }
        ],
        "rating": "width:92.924%",
        "product_reviews": "65",
        "ingredients": "-Salicylic Acid: Combats congestion.-Lactic Acid: Smooths and visibly re-texturizes skin.-Azelaic Acid: Unclogs pores and fades the look of post-breakout marks. Water/Aqua/Eau, Propanediol, Lactic Acid, Glycerin, Sodium Hydroxide, Salicylic Acid, Coco-Caprylate/Caprate, Pentylene Glycol, Sodium Polyacryloyldimethyl Taurate, Xanthan Gum, Cellulose Gum, Phenethyl Alcohol, Azelaic Acid, Mandelic Acid, Calcium Sodium Borosilicate, Melia Azadirachta Flower Extract, Silica, Coccinia Indica Fruit Extract, Titanium Dioxide (Ci 77891), Sodium Carbonate, Sodium Chloride, Tin Oxide (Ci 77861). ",
        "n_loves": "1.5K",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/mini-daily-microfoliant-exfoliator-P443352",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:35:54",
        "product_name": "Mini Daily Microfoliant Exfoliator",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.45 oz/ 13 g"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2221133"
            }
        ],
        "rating": "width:93.718%",
        "product_reviews": "4.7K",
        "ingredients": "-Papain Enzymes and Salicylic Acid: Draw out excess oil, clear clogged pores, and smooth the look of skin.-Rice Bran-Derived Phytic Acid: Gently exfoliates to visibly brighten and balance uneven skin tone.-Colloidal Oatmeal: Calms skin, reducing the appearance of redness and irritation.Microcrystalline Cellulose, Magnesium Oxide, Sodium Cocoyl Isethionate, Colloidal Oatmeal, Disodium Lauryl Sulfosuccinate, Sodium Lauroyl Glutamate, Oryza Sativa (Rice) Bran Extract, Oryza Sativa (Rice) Starch, Hydrogenated Coconut Acid, Allantoin, Papain, Salicylic Acid, Ginkgo Biloba Leaf Extract, Camellia Sinensis Leaf Extract, Glycyrrhiza Glabra (Licorice) Root Extract, PCA, Populus Tremuloides Bark Extract, Cyclodextrin, Sodium Isethionate, Lauryl Methacrylate/Glycol Dimethacrylate Copolymer, Maltodextrin, Melaleuca, Alternifolia (Tea Tree) Leaf Oil, Citrus Paradisi (Grapefruit) Peel Oil, Sodium Dehydroacetate, Hydrolyzed Corn Starch Hydroxyethyl Ether, Water/Aqua/Eau, Limonene, Citric Acid.",
        "n_loves": "127.3K",
        "categories": [
            "Skincare",
            "Mini Size"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-clear-start-micro-pore-mist-P463028",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:36:06",
        "product_name": "Clear Start Micro-Pore Mist",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 118 ml"
                ],
                "price": [
                    "$31.00"
                ],
                "sku": "Item 2386027"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "12",
        "ingredients": " -Wild Rosehips Flavonoid Complex: Absorbs oily shine and minimizes the look of pores from the first use with visible pore-shrinking technology.-Niacinamide (Vitamin B3): Diminishes the appearance of pores and post-breakout marks while visibly brightening and evening skin tone.-Witch Hazel: Tightens the look of pores. Water/Aqua/Eau, Niacinamide, Hamamelis Virginiana (Witch Hazel) Extract, Glycerin, Lactobacillus Ferment, Butylene Glycol, Lactobacillus, Polysorbate 20, Panthenol, Potassium Sorbate, Citric Acid, Cocos Nucifera (Coconut) Fruit Extract, DipotassiumGlycyrrhizate, Cucumis Sativus (Cucumber) Fruit Extract, Camellia Oleifera (Green Tea) Leaf Extract, Chamomilla Recutita(Matricaria) Flower Extract, Rosa Canina (Rose Hips) Fruit Extract, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate, Hexyl Cinnamal, Benzyl Salicylate, Citronellol.",
        "n_loves": "1.6K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Mists & Essences"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/skin-soothing-hydrating-lotion-P423467",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:36:18",
        "product_name": "Clear Start Skin Soothing Hydrating Lotion",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$35.00"
                ],
                "sku": "Item 2010031"
            }
        ],
        "rating": "width:82.5%",
        "product_reviews": "16",
        "ingredients": "Water, Squalane, C14-22 Alcohols, Butylene Glycol, Naringenin, Saccharide Isomerate, Sodium Hyaluronate, Panthenyl Triacetate, Salicylic Acid, Zingiber Officinale (Ginger) Root Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Triethyl Citrate, Maltodextrin, Glyceryl Caprylate, C12-20 Alkyl Glucoside, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Aminomethyl Propanol, Xanthan Gum, Benzoic Acid, Sodium Citrate, Citric Acid, Caprylhydroxamic Acid, Ethylhexylglycerin, Methylpropanediol.",
        "n_loves": "1.7K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/overnight-retinol-repair-P428408",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:36:30",
        "product_name": "Overnight Retinol Repair",
        "brand_name": "Dermalogica",
        "options": [],
        "rating": "width:97.77799999999999%",
        "product_reviews": "9",
        "ingredients": "Overnight Retinol Repair: Water, Squalane, Glycerin, C14-22 Alcohols, Caprylic/Capric Triglycerides, Xylitylglucoside, Retinol, Dipotassium Glycyrrhizate, Sodium Ascorbyl Phosphate, Ceramide 3, Xylitol, Palmitoyl Tripeptide-5, Copper Lysinate/Prolinate, Glucose, Cetyl Palmitate, Pelargonium Graveolens Flower Oil, Methylglucoside Phosphate, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Lavandula Hybrida Oil, Anhydroxylitol, Magnesium Chloride, C12-20 Alkyl Glycoside, Polysorbate 20, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Hydroxide, Aminomethyl Propanol, Ethylhexylglycerin, Linalool, Citronellol, Geraniol, Phenoxyethanol.Buffer Cream: Water, Aloe Barbadensis Leaf Juice, Ethylhexyl Hydroxystearate, Butylene Glycol, Cetearyl Ethylhexanoate, Cetyl Caprylate, PEG-8, Stearic Acid, Dimethicone, Cetyl Dimethicone, Glyceryl Stearate, Lactamide MEA, PEG-100 Stearate, Cetyl Alcohol, Potassium Cetyl Phosphate, Sodium PCA, Carbomer, Disodium EDTA, Ethylhexylglycerin, Aminomethyl Propanol, Ethanolamine, Phenoxyethanol.",
        "n_loves": "4.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Night Creams"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/multi-active-toner-mini-P443351",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:36:40",
        "product_name": "Mini Multi-Active Toner",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$18.00"
                ],
                "sku": "Item 2221125"
            }
        ],
        "rating": "width:87.864%",
        "product_reviews": "323",
        "ingredients": "-Lavandula Angustifolia (Lavender)-Melissa Officinalis Leaf (Balm Mint) and Aloe Vera-Arnica Montana and Cucumis Sativus (Cucumber) Fruit-Sodium PCA\nWater, Butylene Glycol, Aloe Barbadensis Extract, Arginine, Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract, Melissa Officinalis Leaf Extract, Citrus Limon (Lemon) Peel Oil, Citrus, Aurantium Bergamia (Bergamot) Fruit Oil, Cymbopogon Winterianus Herb Oil, Glycine, Alanine, Serine Lavandula Angustifolia (Lavender) Oil, Dipotassium Glycyrrhizate, Cucumis Sativus (Cucumber) Fruit Extract, Arnica Montana Flower Extract, Hedera Helix (Ivy) Extract, Malva Sylvestris (Mallow) Flower Extract, Parietaria Officinalis Extract, Sambucus Nigra Flower Extract, Tocopherol, Phenylalanine, Histidine, Valine, Isoleucine, Proline, Threonine, Sodium PCA, Sodium Lactate, Citric Acid, Polyquaternium-4, Aspartic Acid, PCA, Ethylhexylglycerin, Methyl Gluceth-20, Polysorbate 20, 1,2-Hexanediol, Caprylyl Glycol, PEG-12 Dimethicone, Ricinoleth-40, Sodium Citrate, Sodium Hydroxide, Tetrasodium Glutamate Diacetate, Linalool, Limonene, Citral, Geraniol, Phenoxyethanol.",
        "n_loves": "17K",
        "categories": [
            "Skincare",
            "Mini Size"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/skin-smoothing-cream-P443359",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:36:52",
        "product_name": "Skin Smoothing Cream Moisturizer",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$63.00"
                ],
                "sku": "Item 2221158"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$99.00"
                ],
                "sku": "Item 2221141"
            }
        ],
        "rating": "width:91.35199999999999%",
        "product_reviews": "488",
        "ingredients": "-Active HydraMesh Technology™: Moisturizing complex that works to infuse skin with up to 48 hours of hydration.-Aloe: Soothes skin and prevents the appearance of dehydration lines. -Grape Seed, Vitamin C, and Vitamin E: Antioxidants that nourish skin and reduce free-radical damage. Water/Aqua/Eau, Caprylic/Capric Triglyceride, Ethylhexyl Hydroxystearate, Stearic Acid, Butylene Glycol, Glycerin, Aloe Barbadensis Extract, Dimethicone, PEG-8, Cetearyl Alcohol, Sodium Hyaluronate, Vitis Vinifera (Grape) Seed Extract Saccharide Isomerate, Cucumis Sativus (Cucumber) Fruit Extract, Arnica Montana Flower Extract, Hedera Helix (Ivy) Extract, Malva Sylvestris (Mallow) Flower Extract, Parietaria Officinalis Extract, Sambucus Nigra Flower Extract, Ascorbyl Palmitate, Trehalose, Algin, Hydrolyzed Sodium Hyaluronate, Serine, Linoleic Acid, Phospholipids, Phytosterols, Cananga Odorata Flower Oil, Urea, Hydrogenated Lecithin, Pullulan, Caprylhydroxamic Acid, Citrus Aurantium Amara (Bitter Orange) Flower Extract, Tocopheryl Acetate, Tetrasodium Glutamate Diacetate, HexanediolPentylene Glycol, Glyceryl Polyacrylate, Sodium Citrate, Disodium Phosphate, Palmitoyl Hydroxypropyltrimonium, Amylopectin/Glycerin Crosspolymer, Caprylyl Glycol, Potassium Phosphate, Citric Acid, Tocopherol, Methylpropanediol, Polysorbate 60, Panthenol, Polyquaternium-10, Cetyl Alcohol, PEG-100 Stearate, Glyceryl Stearate, Aminomethyl, Propanol, Carbomer, Ethylhexylglycerin, Sodium Hydroxide, Hydroxystearic Acid, BHT, Benzyl Benzoate, Benzyl Salicylate, Linalool, Sodium Benzoate, Phenoxyethanol.",
        "n_loves": "14.8K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/daily-superfoliant-P423123",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:37:06",
        "product_name": "Daily Superfoliant Exfoliator",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 57 g"
                ],
                "price": [
                    "$89.00"
                ],
                "sku": "Item 2002228"
            }
        ],
        "rating": "width:91.126%",
        "product_reviews": "311",
        "ingredients": " -Activated charcoal: Clears skin from toxins.-Niacinamide: Visibly improves the appearance of enlarged pores.-Lavender: Soothes skin. Microcrystalline Cellulose, Sodium Bicarbonate, Sodium Cocoyl Glutamate, Sodium Myristoyl Glutamate,Malic Acid, Sodium Methyl Cocoyl Taurate, Charcoal Powder, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Maltodextrin, Silica, Magnesium Oxide, Oryza Sativa (Rice) Bran Extract, Polymethylsilsesquioxane, Sapindus Trifoliatus Fruit Extract, Niacinamide, Citrus Aurantium Amara (Bitter Orange) Peel Oil, Zingiber Of cinale (Ginger) Root Extract, Lavandula Angustifolia (Lavender) Oil, Lavandula Hybrida Oil, Camellia Sinensis Leaf, Kappaphycus Alvarezii Extract, Caesalpinia Spinosa Fruit Pod Extract, Citrus Limon (Lemon) Peel Oil, Rosmarinus Of cinalis (Rosemary) Leaf Oil, Salvia Of cinalis (Sage) Oil, Subtilisin, Lipase, Papain, Lactic Acid, Oryza Sativa (Rice) Starch, Sodium Chloride, Sodium Dehydroacetate, Xanthan Gum, Water, Coconut Acid, Calcium Lactate, Capryloyl Glycine, Undecylenoyl Glycine, Cetrimonium Chloride, Limonene, Linalool.",
        "n_loves": "12.4K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-daily-glycolic-cleanser-P474822",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:37:18",
        "product_name": "Daily Glycolic Cleanser",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.1 oz/ 150 mL"
                ],
                "price": [
                    "$51.00"
                ],
                "sku": "Item 2479806"
            }
        ],
        "rating": "width:95.05399999999999%",
        "product_reviews": "368",
        "ingredients": "-Glycolic Acid: Potent AHA that exfoliates, brightens, and evens the look of skin tone. -Calendula Extract and Allatonin: Visibly calm and nourish the skin while delivering antioxidant benefits.-Jojoba Seed Oil: Lightweight oil that softens skin and cares for the moisture barrier.Water/Aqua/Eau, Cocamidopropyl Hydroxysultaine, Glycolic Acid, Glycerin, Peg-6",
        "n_loves": "23.5K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-smart-response-serum-P472810",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:37:30",
        "product_name": "Smart Response Serum",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$199.00"
                ],
                "sku": "Item 2452043"
            }
        ],
        "rating": "width:95.126%",
        "product_reviews": "357",
        "ingredients": "-Plant Based M6P Glycan: Visibly increases firmness. -Hydrolyzed Beta-Glucan: Helps support hyaluronic acid production when dehydration is detected.-Arabinoxylo-Oligosaccharides: Visibly evens skin tone and helps slow the mechanisms that produce melanin. Water/Aqua/Eau, Glycerin, Coco-Caprylate/Caprate, PPG-24-Glycereth-24, Niacinamide, Butylene Glycol, 1,2- Hexanediol, Sodium Acrylates Crosspolymer-2, C18-36 Acid Triglyceride, Sodium Polyacryloyldimethyl Taurate, Hydroxyacetophenone, Jojoba Esters, Olive Oil Decyl Esters, Phytosterols, Cornus Officinalis Fruit Extract, Hydrolyzed Wheat Flour, Sodium Mannose Phosphate, Phytosteryl Macadamiate, Hydrolyzed Beta-Glucan, MimosaTenuiflora Bark Extract, Ilex Paraguariensis Leaf Extract, Sea Salt, Ferula Galbaniflua (Galbanum) Resin Oil, Helianthus Annuus (Sunflower) Seed Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Extract, Citrus Aurantium Dulcis (Orange) Peel Oil, Juniperus Virginiana Oil, Pelargonium Graveolens Flower Oil, Vetiveria Zizanoides Root Oil, Prunus Amygdalus Amara (Bitter Almond) Kernel Oil, Chlorella Vulgaris Extract, Dipteryx Odorata Seed Extract, LacticAcid, Bentonite, C12-18 Acid Triglyceride, Squalene, Tocopherol, Sodium Acetylated Hyaluronate, Mannose, Citric Acid, Hydrated Silica, Sodium Benzoate, Potassium Sorbate, Citronellol, Geraniol, Coumarin, Linalool, Limonene.",
        "n_loves": "5.3K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/precleanse-mini-P443350",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:37:41",
        "product_name": "Mini Precleanse Cleansing Oil",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$21.00"
                ],
                "sku": "Item 2221109"
            }
        ],
        "rating": "width:90.316%",
        "product_reviews": "1.3K",
        "ingredients": "-Vitamin E: Nourishes and protects skin from damage. -Rice Bran: Gently exfoliates. -Rosemary: Protects skin from damage. Caprylic/Capric Triglycerides, Prunus Armeniaca (Apricot) Kernel Oil, PEG-40 Sorbitan Peroleate, Helianthus Annuus (Sunflower) Seed Oil, Citrus Aurantium Dulcis (Orange) Oil, Citrus Grandis (Grapefruit) Peel Oil, Cymbopogon Schoenanthus Oil, Borago Officinalis Seed Oil, Lavandula Angustifolia (Lavender) Oil, Rosmarinus Officinalis (Rosemary) Leaf Extract, Solanum Lycopersicum (Tomato) Extract, Lavandula Hybrida Oil, Citrus Nobilis (Mandarin Orange) Peel Oil, Oryza Sativa (Rice) Bran Oil, Carthamus Tinctorius (Safflower) Seed Oil, Aleurites Moluccana Seed Oil, Cetyl Ethylhexanoate, Dicaprylyl Carbonate, Tocopheryl Acetate, Tocopherol, C12-15 Alkyl Benzoate, Citral, Limonene, Linalool.",
        "n_loves": "24.7K",
        "categories": [
            "Skincare",
            "Mini Size"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/daily-milkfoliant-exfoliator-P500240",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:37:53",
        "product_name": "Daily Milkfoliant Exfoliator",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.6 oz / 74 g"
                ],
                "price": [
                    "$89.00"
                ],
                "sku": "Item 2532786"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: .45 oz / 13 g"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2588754"
            }
        ],
        "rating": "width:95.02599999999998%",
        "product_reviews": "599",
        "ingredients": "-AHAs and BHAs: Help polish dead skin cells to reveal visibly smoother, softer skin.-Hyaluronic Acid: Helps support skin’s moisture barrier.-Coconut Milk and Oat Bran Extract: Help nourish and soothe skin.Sodium CocoylIsethionate, Microcrystalline Cellulose, Sodium Bicarbonate, Sorbitol, ZeaMays (Corn) Starch, Sodium CocoylGlutamate, Saccharomyces Ferment, Oryza Sativa (Rice) Starch, Magnesium Oxide, Citric Acid, Tapioca Starch, AvenaSativa (Oat) Kernel Protein, Camellia Oleifera Seed Extract, Silica, Cocos Nucifera (Coconut) Fruit Extract, Inulin, Cassia HydroxypropyltrimoniumChloride, Silybum Marianum Seed Oil, Kaolin, Lauryl Methacrylate/Glycol DimethacrylateCrosspolymer, Papain, Hyaluronic Acid, AvenaSativa (Oat) Kernel Extract, Helianthus Annuus (Sunflower) Seed Oil, AvenaSativa (Oat) Bran Extract, Glycine Soja (Soybean) Oil, Citrus Aurantium Dulcis (Orange) Peel Extract, Vitis Vinifera (Grape) Fruit Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, AnibaRosodora(Rosewood) Wood Oil, Salvia Sclarea (Clary) Oil, Eucalyptus Globulus Leaf Oil, Chamomilla Recutita(Matricaria) Flower Oil, Cucurbita Pepo (Pumpkin) Fruit Extract, Cucumis Sativus (Cucumber) Fruit Extract, Perilla OcymoidesLeaf Extract, Daucus Carota Sativa (Carrot) Root Extract, Sea Salt (Maris Sal), Juniperus Virginiana Oil, Alpha-Glucan Oligosaccharide, Tocopherol, CastorylMaleate, Caprylyl Glycol, Allantoin, Diglycerin, Maltodextrin, LauroylLysine, Arginine, Saccharide Isomerate, Sodium LauroylGlutamate, Beta-Carotene, Xanthan Gum, Ethylhexylglycerin, 1,2-Hexanediol, Hydroxypropyl Methylcellulose, Dextrin, Sodium Palmitate, Sodium Chloride, Acacia Senegal Gum, Sodium Citrate, Water/Aqua/Eau, O-Cymen-5-Ol, Limonene, Linalool.",
        "n_loves": "13.4K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/breakout-clearing-foaming-wash-P423466",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:38:06",
        "product_name": "Clear Start Breakout Clearing Foaming Wash",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6 oz/ 177 mL"
                ],
                "price": [
                    "$27.00"
                ],
                "sku": "Item 2010007"
            }
        ],
        "rating": "width:87.524%",
        "product_reviews": "202",
        "ingredients": " -Salicylic Acid (0.5%): Supports natural exfoliation.  Water, Cocamidopropyl Betaine, Disodium Cocoamphodiacetate, Sodium Lauroyl Methyl Isethionate, Melissa Officinalis Leaf Extract, Angelica Archangelica Extract, Echinacea Angustifolia Extract, Allium Sativum (Garlic) Bulb Extract, Chamomilla Recutita (Matricaria) Flower Extract, Eucalyptus Globulus Leaf Extract, Salvia Officinalis (Sage) Extract, Passiflora Incarnata Extract, Citrus Medica Limonum (Lemon) Peel Extract, Hamamelis Virginiana (Witch Hazel) Extract, Ophiopogon Japonicas Root Extract, Echinacea Purpurea Extract, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Lactic Acid, Algae Extract, Menthol, Sodium PCA, Dipotassium Glycyrrhizate, Camphor, PEG-120 Methyl Glucose Dioleate, Phenoxyethanol, Butylene Glycol, Benzyl PCA, Disodium EDTA Copper, Citral, Limonene, Geraniol, Citronellol.",
        "n_loves": "4.3K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dynamic-skin-recovery-spf50-P432632",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:38:19",
        "product_name": "Dynamic Skin Recovery SPF50",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$109.00"
                ],
                "sku": "Item 2104107"
            }
        ],
        "rating": "width:88.02600000000001%",
        "product_reviews": "152",
        "ingredients": " -Avobenzone (3%) and Octinoxate (7.5%): Provides sun protection.  Water, Ethylhexyl Methoxycinnamate, Butylene Glycol, Carthamus Tinctorius Oleosomes, C12-15 Alkyl Benzoate, Cyclopentasiloxane, Glycerin, Butyl Methoxydibenzoylmethane, Dimethicone, Dimethyl Capramide, Palmitoyl Tripeptide-5, Aniba Rosaeodora Wood Oil, Rose Flower Oil, Pelargonium Graveolens Flower Oil, Helianthus Annuus Seed Oil, Eugenia Caryophyllus Leaf/Flower Oil, Citrus Medica Limonum Peel Oil, Saccharomyces Cerevisiae Extract, Citrus Medica Limonum Peel Extract, Camellia Sinensis Leaf Extract, Algae Extract, Dipotassium Glycyrrhizate, Lecithin, Glucosamine HCL, Arginine/Lysine Polypeptide, Tocopheryl Acetate, Squalane, Sodium Hyaluronate, Polysilicone-11, Glycine Soja Protein, 1,2-Hexanediol, Caprylic/Capric Triglyceride, Cetearyl Alcohol, Stearic Acid, Ceteareth-20, Sodium Polyacrylate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sodium Acrylates Copolymer, Decyl Glucoside, Polysorbate 80, Urea, Galactoarabinan, Glyceryl Polyacrylate, Polysorbate 60, Aminomethyl Propanol, Disodium EDTA, Phenoxyethanol, Ethylhexylglycerin, Linalool, Eugenol, Limonene, Geraniol, Citronellol.",
        "n_loves": "4.3K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/super-rich-repair-P423135",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:38:32",
        "product_name": "Super Rich Repair Moisturizer",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$129.00"
                ],
                "sku": "Item 2002269"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.38 oz/ 100 mL"
                ],
                "price": [
                    "$199.00"
                ],
                "sku": "Item 2478451"
            }
        ],
        "rating": "width:92.554%",
        "product_reviews": "231",
        "ingredients": "-Shea Butter and Evening Primrose Oil: Replenish skin's moisture barrier.-Jojoba and Borage Seed Oils: Soothe, moisturize, and condition skin. -Polypeptide Blend: Improves the appearance of aging skin. Water/Aqua/Eau, Isohexadecane, Dipropylene Glycol, Caprylic/Capric/Myristic/Stearic Triglyceride, Lauryl PEG-9 Polydimethylsiloxyethyl Dimethicone, Simmondsia Chinensis (Jojoba) Seed Oil, Butyrospermum Parkii (Shea) Butter, Dimethicone, Glycerin, Octyldodecyl Neopentanoate, Sodium Chloride, Isostearic Acid, Arginine/Lysine Polypeptide, Palmitoyl Tripeptide-5, Avena Sativa (Oat) Kernel Extract, Pyrus Malus (Apple) Seed Extract, Borago Officinalis Seed Oil, Oenothera Biennis (Evening Primrose) Oil, Hydrogenated Coconut Oil, Gardenia Taitensis Flower, Laminaria Digitata Extract, Yeast Extract, Glucosamine HCL, Cedrus Atlantica Bark Oil, Cupressus Sempervirens Leaf/Stem Extract, Eucalyptus Globulus Leaf Oil, Helianthus Annuus (Sunflower) Seed Oil, Pelargonium Graveolens Flower Oil, Aniba Rosodora (Rosewood) Wood Oil, Abies Sibirica Oil, Santalum Album (Sandalwood) Oil, Sodium Hyaluronate, Tocopheryl Acetate, Colloidal Oatmeal, Madecassoside, Urea, Hexyldecanol, Polyglyceryl-4 Isostearate, Cetyl Dimethicone, Hydrogenated Castor Oil, Butylene Glycol, Caprylyl Glycol, Ethylhexylglycerin, Hexylene Glycol, Linalool, Geraniol, Citronellol, Phenoxyethanol.",
        "n_loves": "8K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/active-moist-P423142",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:38:45",
        "product_name": "Active Moist Moisturizer",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$63.00"
                ],
                "sku": "Item 2002137"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$99.00"
                ],
                "sku": "Item 2010247"
            }
        ],
        "rating": "width:91.97200000000001%",
        "product_reviews": "431",
        "ingredients": " -Oil-Free, Prebiotic Moisture Complex: Provides balanced and long-lasting hydration to oily skin without a heavy, greasy feel.  -Lemon and Burdock: Visibly refine and smooth the skin‘s texture. -Cucumber: Intensely hydrates and soothes the skin. Water/Aqua/Eau, Caprylic/Capric Triglyceride, Pentylene Glycol, Butylene Glycol, Methyl Gluceth-20, Coconut Alkanes, Cetearyl Alcohol, Palmitic Acid, Stearic Acid, Saccharide Isomerate, Dimethicone, Glyceryl Stearate, Hydrolyzed Jojoba Esters, Leuconostoc/Radish Root Ferment Filtrate, Arctium Lappa Root Extract, Citrus Limon (Lemon) Fruit Extract, Cucumis Sativus (Cucumber) Fruit Extract, Hedera Helix (Ivy) Extract, Malva Sylvestris (Mallow) Flower Extract, Nasturtium Officinale Extract, Propanediol, Polysorbate 60, Caprylyl Glycol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Allantoin, Tetrasodium Glutamate Diacetate, Coco-Caprylate/Caprate, Polyquaternium-10, Ethylhexylglycerin, Triethyl Citrate, Myristic Acid, Citrus Aurantium Bergamia (Bergamot) Fruit Extract, Citrus Limon (Lemon) Peel Extract, Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract, Lavandula Hybrida Flower Extract, Citric Acid, Sodium Citrate, Sodium Hydroxide, Aminomethyl Propanol, Citral, Linalool, Limonene.",
        "n_loves": "16.5K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/breakout-clearing-booster-P436124",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:38:58",
        "product_name": "Clear Start Breakout Clearing Booster",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.0 oz/ 30 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2129161"
            }
        ],
        "rating": "width:84.062%",
        "product_reviews": "325",
        "ingredients": "Water, PPG-15 Stearyl Ether, Glycerin, Butylene Glycol, Isopropyl Lauroyl Sarcosinate, Niacinamide, Salicylic Acid, Cetearyl Glucoside, Polysorbate 20, Chlorella Vulgaris Extract, Thymol, Terpineol, Citrus Aurantium Dulcis (Orange) Peel Oil, Chondrus Crispus Extract, Lactic Acid, Sodium Hyaluronate, Tocopherol, Dimethicone, Lecithin, Pullulan, Sclerotium Gum, Xanthan Gum, Propanediol, Gluconolactone, Silica, Ethylhexylglycerin, Tetrasodium Glutamate Diacetate, Sodium Citrate, Sodium Benzoate, Sodium Hydroxide, Phenoxyethanol.",
        "n_loves": "6.9K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-dynamic-skin-retinol-serum-P503814",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:39:09",
        "product_name": "Dynamic Skin Retinol Serum",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$128.00"
                ],
                "sku": "Item 2640365"
            }
        ],
        "rating": "width:95.816%",
        "product_reviews": "349",
        "ingredients": "-3.5% Retinoid Complex: Helps reduce the appearance of fine lines and wrinkles.-Concentrated Squalane: Improves the skin’s moisture barrier for boosted skin health and recovery.-Oat-Derived Beta-Glucan: Helps to hydrate, soothe, and restore skin.Water/Aqua/Eau, Squalane, Glycerin, Hexyldecanol, Propanediol, Dimethyl Isosorbide, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Hydroxyacetophenone, Hydroxypinacolone Retinoate, Retinol, Helianthus Annuus (Sunflower) Seed Oil, Rosmarinus Officinalis (Rosemary) Leaf Extract, Pelargonium Graveolens Flower Oil, Aniba Rosodora (Rosewood) Wood Oil, Eucalyptus Globulus Leaf Oil, Santalum Album (Sandalwood) Oil, Oryza Sativa (Rice) Bran Extract, Helianthus Annuus (Sunflower) Extract, Cupressus Sempervirens Oil, Juniperus Virginiana Oil, Abies Sibirica Oil, Tocopherol, Beta-Glucan, Caprylyl Glycol, BHT, Ceramide NP, Caprylic/Capric Triglyceride, Cetyl Palmitate, 1,2-Hexanediol, Ethylhexylglycerin, Polysorbate 60, Tetrasodium Glutamate Diacetate, Hydroxystearic Acid,Polysorbate 20, Sorbitan Isostearate, Laureth-23, Trideceth-6 Phosphate, Sodium Hydroxide, Citric Acid, Polyacrylate Crosspolymer-6, Sodium Benzoate, Benzyl Alcohol, Linalool.",
        "n_loves": "8.3K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-oil-to-foam-total-cleanser-P505825",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:39:22",
        "product_name": "Oil to Foam Total Cleanser",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL",
                    "NEW"
                ],
                "price": [
                    "$78.00"
                ],
                "sku": "Item 2687457"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "2",
        "ingredients": "-Sea Buckthorn Oil: Rich in antioxidant Vitamin E.-Plant-Derived Prebiotic, Saccharide Isomerate: Moisture magnet to support long-lasting hydration.-Sodium Cocoyl Glutamate: Provides an intense yet gentle cleanse.Water/Aqua/Eau, Glycerin, Cocamidopropyl Hydroxysultaine, Sodium Cocoyl Glutamate, PEG-60 Almond Glycerides, Hydroxyacetophenone, Camellia Oleifera Seed Extract, Citrus Aurantium Dulcis (Orange) Peel Oil, Lavandula Hybrida Oil, Citrus Paradisi (Grapefruit) Peel Oil, Citrus Nobilis (Mandarin Orange) Peel Oil, Lavandula Angustifolia (Lavender) Oil, Cymbopogon Citratus Leaf Oil, Hippophae Rhamnoides Fruit Oil, Tocopherol, Pentylene Glycol, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Caprylyl Glycol, Xanthan Gum, 1,2-Hexanediol, PEG-40 Hydrogenated Castor Oil, PEG-120 Methyl Glucose Dioleate, Saccharide Isomerate, Polysorbate 20, Tetrasodium Glutamate Diacetate, Citric Acid, Sodium Hydroxide, Sodium Citrate, O-Cymen-5-Ol, Limonene, Linalool, Citral.",
        "n_loves": "637",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-phyto-nature-oxygen-cream-P505139",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:39:34",
        "product_name": "Phyto Nature Oxygen Cream",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz / 50 mL"
                ],
                "price": [
                    "$174.00"
                ],
                "sku": "Item 2643195"
            }
        ],
        "rating": "width:96.342%",
        "product_reviews": "328",
        "ingredients": "-Ligustrum lucidum Seed, Glycogen, and Nasturtium Flower: Visibly revitalize skin with oxygen-optimizing phytoactives.-Adaptogenic Astragalus and Squalane: Hydrate and visibly firm skin, reducing the appearance of fine lines and wrinkles. -Antioxidant-Rich Rose of Winter: Soothes and boosts skin’s visible resilience.Water/Aqua/Eau, Simmondsia Chinensis (Jojoba) Seed Oil, Glycerin, Neopentyl Glycol Diheptanoate, Squalane, Hydrogenated Ethylhexyl Olivate, Propanediol, Caprylic/Capric Triglyceride, Pentylene Glycol, Camellia Japonica Seed Oil, Butylene Glycol, C12-15 Alkyl Benzoate, Sodium Hyaluronate, Ubiquinone, Glycine Soja (Soybean) Oil, PEG-40 Hydrogenated Castor Oil, Helianthus Annuus (Sunflower) Seed Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Citrus Limon (Lemon) Peel Oil, Rosmarinus Officinalis (Rosemary) Leaf Extract, Viola Odorata Leaf Extract, Carthamus Tinctorius (Safflower) Seed Oil, Tropaeolum Majus Flower/Leaf/Stem Extract, Astragalus Membranaceus Root Extract, Spilanthes Acmella Flower/Leaf/Stem Extract, Lavandula Spica (Lavender) Flower/Leaf/Stem Extract, Ligustrum Lucidum Seed Extract, Citrus Aurantium Dulcis (Orange) Oil, RosmarinusOfficinalis (Rosemary) Flower/Leaf/Stem Extract, Salvia Sclarea (Clary) Extract, Litsea Cubeba Fruit Oil, Mentha Piperita (Peppermint) Flower/Leaf/Stem Extract, Luffa Cylindrica Root Extract, Hydrogenated Olive Oil Unsaponifiables, Tocopherol, Phospholipids, Glycogen, Caprylyl Glycol, Glycolipids, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Glycine Soja (Soybean) Sterols, Dicaprylyl Ether, Xanthan Gum, C15-19 Alkane, Ethylhexylglycerin, Polysorbate 20, Tetrasodium Glutamate Diacetate, Phytic Acid, Lauryl Glucoside, SodiumHydroxide, Sodium Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sodium Benzoate.",
        "n_loves": "3.6K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/daily-microfoliant-P423688",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:39:46",
        "product_name": "Daily Microfoliant Exfoliator",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.6 oz/ 74g"
                ],
                "price": [
                    "$89.00"
                ],
                "sku": "Item 2002087"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.45 oz/ 13 g"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2221133"
            },
            {
                "swatch_group": "Refill size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.6 oz/ 74 g Refill"
                ],
                "price": [
                    "$77.00"
                ],
                "sku": "Item 2385532"
            }
        ],
        "rating": "width:93.718%",
        "product_reviews": "4.7K",
        "ingredients": "-Papain Enzymes and Salicylic Acid: Draw out excess oil, clear clogged pores, and smooth the look of skin.-Rice Bran-Derived Phytic Acid: Gently exfoliates to visibly brighten and balance uneven skin tone.-Colloidal Oatmeal: Calms skin, reducing the appearance of redness and irritation.Microcrystalline Cellulose, Magnesium Oxide, Sodium Cocoyl Isethionate, Colloidal Oatmeal, Disodium Lauryl Sulfosuccinate, Sodium Lauroyl Glutamate, Oryza Sativa (Rice) Bran Extract, Oryza Sativa (Rice) Starch, Hydrogenated Coconut Acid, Allantoin, Papain, Salicylic Acid, Ginkgo Biloba Leaf Extract, Camellia Sinensis Leaf Extract, Glycyrrhiza Glabra (Licorice) Root Extract, PCA, Populus Tremuloides Bark Extract, Cyclodextrin, Sodium Isethionate, Lauryl Methacrylate/Glycol Dimethacrylate Copolymer, Maltodextrin, Melaleuca, Alternifolia (Tea Tree) Leaf Oil, Citrus Paradisi (Grapefruit) Peel Oil, Sodium Dehydroacetate, Hydrolyzed Corn Starch Hydroxyethyl Ether, Water/Aqua/Eau, Limonene, Citric Acid.",
        "n_loves": "103.7K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/multivitamin-power-firm-P423134",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:40:00",
        "product_name": "MultiVitamin Power Firm Eye Cream",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$96.00"
                ],
                "sku": "Item 2002301"
            }
        ],
        "rating": "width:82.91199999999999%",
        "product_reviews": "206",
        "ingredients": " -Vitamins A, C, and E: Visibly firm the skin while protecting it against premature aging due to free radicals and UV rays.-Red Seaweed: Provides high quantities of peptides and fatty acids while resurfacing and protecting the skin. -Grapeseed Oil: Supports more even-looking skin.Cyclopentasiloxane, Bis-Diglyceryl Polyacyladipate-2, Dimethicone Crosspolymer, Cetyl Ethylhexanoate, Polylactic Acid, Tocopheryl Acetate, Caprylic/Capric Triglyceride, Camellia Sinensis Leaf Extract, Chamomilla Recutita (Matricaria) Extract, Spilanthes Acmella Flower Extract, Corallina Officinalis Extract, Carthamus Tinctorius (Safflower) Seed Oil, Vitis Vinifera (Grape) Seed Oil, Ascorbic Acid, Glycyrrhetinic Acid, Boron Nitride, Retinyl Palmitate, Tocopherol, Hydrogenated Soybean Oil, Benzyl Alcohol, Flavor/Aroma.",
        "n_loves": "8.9K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-circular-hydration-serum-with-hyaluronic-acid-P481697",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:40:12",
        "product_name": "Circular Hydration Serum with Hyaluronic Acid",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$89.00"
                ],
                "sku": "Item 2534261"
            }
        ],
        "rating": "width:94.92%",
        "product_reviews": "378",
        "ingredients": "-Hyaluronic Acid: Helps penetrate skin's surface for intense hydration.-Algae Extract-Infused Moisturizing Matrix: Binds water to the skin for both immediate and long-lasting hydration.-Polyglutamic Acid from Fermented Soybean: Supports skin's hydration reserves from within.Water/Aqua/Eau, PEG-8, Glycerin, Methylpropanediol, Propanediol, PPG-24-Glycereth-24, 1,2-Hexanediol, Xylitylglucoside, Butylene Glycol, Hydroxyethyl Urea, Panthenol, Hydroxyacetophenone, Lactic Acid, Hyaluronic Acid, Sodium Hyaluronate, Dunaliella Salina Extract, Avena Sativa (Oat) Kernel Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Citrus Paradisi (Grapefruit) Peel Oil, Citrus Limon (Lemon) Peel Oil, Santalum Album (Sandalwood) Oil, Laminaria Digitata Extract, Jasminum Sambac (Jasmine) Flower Extract, Chondrus Crispus Extract, Gigartina Stellata Extract, Macrocystis Pyrifera (Kelp) Extract, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Lithothamnion Calcareum Extract, Citrus Aurantium Dulcis (Orange) Oil, Cupressus Sempervirens Oil, Cistus Ladaniferus Leaf/Stem Extract, Juniperus Virginiana Oil, Rosmarinus Officinalis (Rosemary) Flower/Leaf/Stem Extract, Tagetes Minuta Flower Oil, Rosa Damascena Flower, Hydrolyzed Rice Protein, Pentylene Glycol, Sodium PCA, Anhydroxylitol, Xylitol, Polyglutamic Acid, Lactobacillus Ferment, Lysine HCl, Betaine, Sclerotium Gum, Sodium Lactate, PCA, Glucose, Serine, Alanine, Glycine, Silanetriol, Pantolactone, Glutamic Acid, Threonine, Arginine, Proline, Xanthan Gum, Tetrasodium Glutamate Diacetate, Polysorbate 20, Sorbitan Isostearate, Citric Acid, Sodium Hydroxide, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Amylopectin, Hydroxyethylcellulose, Sodium Benzoate, Potassium Sorbate, Limonene, Linalool.",
        "n_loves": "10.6K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-clear-start-post-breakout-fix-P480293",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:40:24",
        "product_name": "Clear Start Post Breakout Fix",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2555175"
            }
        ],
        "rating": "width:85.45400000000001%",
        "product_reviews": "11",
        "ingredients": "-Hexylresorcinol: Helps reduce excess oil and refines breakout-prone skin. -Carob Fruit Extract and Squalane: Restore and nourish compromised skin.-Salicylic Acid: Gently exfoliates and helps even skin tone. Water/Aqua/Eau, Ethylhexyl Olivate, Pentylene Glycol, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Caprylic/Capric Triglyceride, Polyacrylate Crosspolymer-6, Glyceryl Stearate Citrate, Salicylic Acid, Hexylresorcinol, Ceratonia Siliqua (Carob) Fruit Extract, Caprylyl Glycol, Propanediol, Squalane, Glycerin, Linoleic Acid, Phospholipids, Phytosterols, Polysorbate 60, SorbitanIsostearate, Sodium Hydroxide, Ethylhexylglycerin, Caffeyl Glucoside, Disodium Acetyl Glucosamine Phosphate.",
        "n_loves": "2.4K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-clear-start-cooling-aqua-jelly-P481208",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:40:36",
        "product_name": "Clear Start Cooling Aqua Jelly",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 59 mL"
                ],
                "price": [
                    "$35.00"
                ],
                "sku": "Item 2555159"
            }
        ],
        "rating": "width:73.334%",
        "product_reviews": "3",
        "ingredients": "-Bioflavonoid Complex: Helps reduce excess oil and refines breakout-prone skin.-Hyaluronic Acid: Locks in moisture to deeply hydrate skin.-Blue Tansy Flower and Blueberry Extract: Calm and soothe skin while providing antioxidant benefits.Water/Aqua/Eau, Glycerin, Sodium Hyaluronate, Carbomer, CaprylhydroxamicAcid, Sodium Hydroxide, SorbitanOleate DecylglucosideCrosspolymer, Citrus Limon (Lemon) Peel Extract, Citrus Aurantium Dulcis (Orange) Peel Extract, Cinnamomum Zeylanicum Leaf Oil, Vanilla PlanifoliaFruit Extract, Eugenia Caryophyllus(Clove) Leaf Oil, Eugenia Caryophyllus(Clove) Flower Extract, Cinnamomum Zeylanicum Bark Oil, Propanediol, MacluraCochinchinensisLeaf Prenylflavonoids, Vaccinium Angustifolium (Blueberry) Fruit Extract, HasleaOstreariaExtract, Melia AzadirachtaLeaf Extract, Melia AzadirachtaFlower Extract, Corallina Officinalis Extract, CocciniaIndica Fruit Extract, Solanum Melongena (Eggplant) Fruit Extract, Aloe BarbadensisFlower Extract, OcimumSanctum Leaf Extract, OcimumBasilicum(Basil) Flower/Leaf Extract, Curcuma Longa (Turmeric) Root Extract, Phenethyl Alcohol, Tanacetum Annuum Flower Oil, Sodium Chloride.",
        "n_loves": "672",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-invisible-physical-defense-sunscreen-spf-30-P456581",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:40:47",
        "product_name": "Invisible Physical Defense Sunscreen SPF 30",
        "brand_name": "Dermalogica",
        "options": [],
        "rating": "width:75.61%",
        "product_reviews": "41",
        "ingredients": "Unknown Ingredients",
        "n_loves": "4.3K",
        "categories": [
            "Skincare",
            "Sunscreen",
            "Face Sunscreen"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/biolumin-c-serum-P443370",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:40:58",
        "product_name": "BioLumin-C Vitamin C Serum",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$132.00"
                ],
                "sku": "Item 2221083"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.0 oz/ 59 mL"
                ],
                "price": [
                    "$205.00"
                ],
                "sku": "Item 2258531"
            }
        ],
        "rating": "width:91.19999999999999%",
        "product_reviews": "625",
        "ingredients": "-Vitamin C: Reduces the appearance of fine lines and wrinkles. -Lactic Acid: Hydrates and exfoliates. -Vitamin C Complex: Firms and brightens the appearance of skin.  Water/Aqua/Eau, Glycerin, Butylene Glycol, Ethoxydiglycol, Lactic Acid, Salvia Hispanica Seed Oil, Sodium PCA, Palmitoyl Tripeptide-5, Sophora Japonica Flower Extract, Ascorbyl Methylsilanol Pectinate, Sodium Hyaluronate, Tocopherol, Dipotassium Glycyrrhizate, Aminopropyl Ascorbyl Phosphate, Trehalose, Polyacrylate-13, Propanediol, Citrus Paradisi (Grapefruit) Peel Oil, Helianthus Annuus (Sunflower) Seed Oil, Polyisobutene, Methylpropanediol, Chondrus Crispus (Carrageenan), Pentylene Glycol, Glyceryl Polyacrylate, Caprylyl Glycol, Ethylhexylglycerin, Tetrasodium Glutamate Diacetate, Xanthan Gum, Polysorbate 20, Limonene, Sodium Hydroxide, Phenoxyethanol, Sorbitan Isostearate",
        "n_loves": "25.3K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/ultracalming-serum-concentrate-P423125",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:41:11",
        "product_name": "Ultracalming Serum Concentrate",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.3 oz/ 40 mL"
                ],
                "price": [
                    "$92.00"
                ],
                "sku": "Item 2002384"
            }
        ],
        "rating": "width:86.154%",
        "product_reviews": "156",
        "ingredients": " -Oat: Helps calm inflammation.-Glycerin: Hydrates skin. -Evening Primrose Oil: Helps calm rashes, inflammation, and dry skin.  Water, Glycerin, Cyclopentasiloxane, Caprylic/Capric Triglyceride, Oenothera Biennis (Evening Primrose) Oil, Dimethicone, Behenyl Alcohol, Butylene Glycol, Cetearyl Alcohol, Leuconostoc/Radish Root Ferment Filtrate, Portulaca Oleracea Extract, Ophiopogon Japonicas Root Extract, Avena Sativa (Oat) Kernel Extract, Coco-Glucoside, Acetyl Tetrapeptide-15, Pentylene Glycol, Hydroxyphenyl Propamidobenzoic Acid, Cetyl Ethylhexanoate, Bisabolol, Zingiber Officinale (Ginger) Root Extract, Boerhavia Diffusa Root Extract, Persea Gratissima (Avocado) Oil, Phytosterols, Helianthus Annuus (Sunflower) Seed Extract, Decyl Glucoside, Salvia Officinalis (Sage) Oil, Sodium Hyaluronate, Polysorbate 60, Limonene, Linalool.",
        "n_loves": "7.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/intensive-moisture-cleanser-P441234",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:41:24",
        "product_name": "Intensive Moisture Cleanser",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.1 oz/ 150 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2189579"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 10 oz/ 295 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$91.00"
                ],
                "sku": "Item 2189587"
            }
        ],
        "rating": "width:71.428%",
        "product_reviews": "14",
        "ingredients": "-Lipid-Enriched Directly Esterified Fatty Isethionate (DEFI) Surfactant System: Cleanses skin while helping to minimize damage of vital proteins and lipids, which defend against dryness.-BioReplenish Complex™, Combined with Phytoactives from Coconut and Murumuru Seed Butter: Help protect barrier lipids and support the skin’s natural resilience.-Extracts of Citrus, Palmarosa, and Jasmine: Refresh tired skin. Water, Glycerin, Caprylic/Capric Triglyceride. Sodium Cocoyl Isethionate, Sodium Lauroyl Glutamate, Divinyldimethicone/Dimethicone Copolymer, Sodium Astrocaryum Murumuruate, Ceramide NP, Phytosterols, Palmitic Acid, Stearic Acid, Hydrogenated Coconut Acid, Hydrolyzed Cottonseed Protein, Citrus Aurantium Dulcis (Orange) Peel Oil, Tocopherol, Xanthan Gum, Dimethicone, Butyrospermum Parkii (Shea) Butter, Carthamus Tinctorius (Safflower) Seed Oil, C12-13 Pareth-3, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Tetrasodium Glutamate Diacetate, Caprylyl Glycol, Citrus Paradisi (Grapefruit) Peel Oil, Citrus Reticulata (Tangerine) Leaf Oil, Myristic Acid, Trideceth-12, Jasminum Officinale (Jasmine) Oil, Linoleic Acid, Amyris Balsamifera Bark Oil, Cananga Odorata Flower Oil, Citrus Limon (Lemon) Peel Oil, Cymbopogon Martini Oil, Eugenia Caryophyllus (Clove) Leaf Oil, Pelargonium Graveolens Flower Oil, Salvia Sclarea (Clary) Oil, Citrus Limon (Lemon) Fruit Extract, Decyl Glucoside, Canarium Luzonicum Gum Nonvolatiles, Citrus Aurantium Dulcis (Orange) Flower Oil, Guaiacum Officinale Wood Oil, Rosa Damascena Flower Oil, Zingiber Officinale (Ginger) Root Oil, Disodium EDTA, Equisetum Arvense Extract, Humulus Lupulus (Hops) Extract, Pinus Sylvestris Cone Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Hexylene Glycol, Linolenic Acid, Pentylene Glycol, Aminomethyl Propanol, Sodium Chloride, Sodium, Isethionate, Propanediol, Butylene Glycol, Polysilicone-11, Sodium Hydroxide, Ethylhexylglycerin, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, PEG-12 Dimethicone, Limonene, Phenoxyethanol.",
        "n_loves": "1.1K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-biolumin-c-vitamin-c-eye-serum-P453930",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:41:37",
        "product_name": "Biolumin-C Vitamin C Eye Serum",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$102.00"
                ],
                "sku": "Item 2318046"
            }
        ],
        "rating": "width:90.39999999999999%",
        "product_reviews": "950",
        "ingredients": "-Vitamin C Complex: This stable form of vitamin C enhances the skin’s ability to fight free radical damage and blocks environmental pollutants.-Salvia Hispanica (Chia Seed) Oil: Helps to depuff the look of eye bags and combat the appearance of eye wrinkles while nurturing the delicate area. -Tremella Mushroom Extract: Hydrates, firms, and restores the look of skin's glow. Water/Aqua/Eau, Butylene Glycol, Propanediol, Glycerin, C15-19 Alkane, Salvia Hispanica Seed Oil, Sodium PCA, Trehalose, Poria Cocos Polysaccharide, Papain, Dunaliella Salina Extract, Aminopropyl Ascorbyl Phosphate, Terminalia Arjuna Extract, Tremella Fuciformis Sporocarp Extract, Ascorbyl Methylsilanol Pectinate, Palmitoyl Tripeptide-5, Sodium Hyaluronate, Phytosterols, Algin, Citrus Grandis (Grapefruit) Peel Oil, Phytosteryl Oleate, Tocopherol, Serine, Oleic Acid, Inositol, Helianthus Annuus (Sunflower) Seed Oil, Betaine, Carrageenan, Panthenol, Dipotassium Glycyrrhizate, Methylpropanediol, Proline, Xylitol, Calcium Gluconate, Pantolactone, Lecithin, Xanthan Gum, Pentylene Glycol, Aminomethyl Propanol, Caprylyl Glycol, Polyacrylate-13, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Tetrasodium Glutamate Diacetate, Polyisobutene, Ethylhexylglycerin, Sodium Benzoate, Citric Acid, Gluconolactone, Polysorbate 20, Potassium Sorbate, Carbomer, 1,2-Hexanediol, Sodium Hydroxide, Limonene, Phenoxyethanol.",
        "n_loves": "28.8K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/skin-resurfacing-cleanser-P423690",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:41:49",
        "product_name": "Skin Resurfacing Lactic Acid Cleanser",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.1 oz/ 150 mL"
                ],
                "price": [
                    "$67.00"
                ],
                "sku": "Item 2002202"
            }
        ],
        "rating": "width:82.758%",
        "product_reviews": "29",
        "ingredients": " -Lactic Acid: Hydrates and exfoliates skin. -Vitamin E: Helps nourish and protect skin from damage caused by free radicals.  Water, Sodium Laureth Sulfate, Lactic Acid, PPG-2 Hydroxyethyl Cocamide, Cocamidopropyl Betaine, Polyacrylate-1 Crosspolymer, Glycol Distearate, Caprylic/Capric Triglyceride, Tocopheryl Acetate, Sodium Hydroxide, Disodium EDTA, Phenoxyethanol, Caprylyl Glycol, Ethylhexyl Glycerin, Hexylene Glycol, Titanium Dioxide (CI 77891), Citronellol, Eugenol, Geraniol, Limonene, Linalool, Citrus Medica Limonum (Lemon) Peel Extract, Helianthus Annuus (Sunflower) Seed Oil, Rose Damascena Flower Oil, Eugenia Caryophyllus (Clove) Flower Oil, Aniba Rosaeodora (Rosewood) Wood Oil, Citrus Medica Limonum (Lemon) Peel Oil, Pelargonium Graveolens Oil, Cymbopogon Martini Oil, Eucalyptus Citriodora Oil.",
        "n_loves": "7.1K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-matte-defense-spf-30-P463027",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:42:01",
        "product_name": "Clear Start Matte Defense SPF 30",
        "brand_name": "Dermalogica",
        "options": [],
        "rating": "width:86.78000000000002%",
        "product_reviews": "59",
        "ingredients": " -Willow Bark and Green Tea Extract: Calm the irritating effects of pollution on breakout-prone skin. -Tapioca: Absorbs shine. Water/Aqua/Eau, Homosalate, Octocrylene, Ethylhexyl Salicylate, Butylene Glycol, Silica, Butyl Methoxydibenzoylmethane, Caprylyl Methicone, C12-15 Alkyl Benzoate,VP/Eicosene Copolymer, Dimethyl Capramide, Polyglyceryl-2 Stearate, Saccharide Isomerate, Tapioca Starch, Coriandrum Sativum (Coriander) Fruit Oil, Camellia Sinensis Leaf Extract, Sodium Ascorbyl Phosphate, Salix Alba (Willow) Leaf Extract, Terpineol, Thymol, Citrus Aurantium Dulcis (Orange) Peel Oil, Dipotassium Glycyrrhizate, Tocopherol, Potassium CetylPhosphate, Arachidyl Alcohol,  Glyceryl Stearate SE, PEG-100 Stearate, Behenyl Alcohol, Benzyl Alcohol, Xanthan Gum, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Arachidyl Glucoside, Ethylhexylglycerin,Tocopheryl Acetate, Trisodium Ethylenediamine Disuccinate, Citric Acid, Sodium Citrate, Sodium Hydroxide, Linalool, Limonene, Geraniol, Citronellol, Phenoxyethanol.",
        "n_loves": "3K",
        "categories": [
            "Skincare",
            "Sunscreen",
            "Face Sunscreen"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/mini-daily-milkfoliant-exfoliator-P500243",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:42:11",
        "product_name": "Mini Daily Milkfoliant Exfoliator",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: .45 oz / 13 g"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2588754"
            }
        ],
        "rating": "width:95.02599999999998%",
        "product_reviews": "599",
        "ingredients": "-AHAs and BHAs: Help polish dead skin cells to reveal visibly smoother, softer skin.-Hyaluronic Acid: Helps support skin’s moisture barrier.-Coconut Milk and Oat Bran Extract: Help nourish and soothe skin.Sodium CocoylIsethionate, Microcrystalline Cellulose, Sodium Bicarbonate, Sorbitol, ZeaMays (Corn) Starch, Sodium CocoylGlutamate, Saccharomyces Ferment, Oryza Sativa (Rice) Starch, Magnesium Oxide, Citric Acid, Tapioca Starch, AvenaSativa (Oat) Kernel Protein, Camellia Oleifera Seed Extract, Silica, Cocos Nucifera (Coconut) Fruit Extract, Inulin, Cassia HydroxypropyltrimoniumChloride, Silybum Marianum Seed Oil, Kaolin, Lauryl Methacrylate/Glycol DimethacrylateCrosspolymer, Papain, Hyaluronic Acid, AvenaSativa (Oat) Kernel Extract, Helianthus Annuus (Sunflower) Seed Oil, AvenaSativa (Oat) Bran Extract, Glycine Soja (Soybean) Oil, Citrus Aurantium Dulcis (Orange) Peel Extract, Vitis Vinifera (Grape) Fruit Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, AnibaRosodora(Rosewood) Wood Oil, Salvia Sclarea (Clary) Oil, Eucalyptus Globulus Leaf Oil, Chamomilla Recutita(Matricaria) Flower Oil, Cucurbita Pepo (Pumpkin) Fruit Extract, Cucumis Sativus (Cucumber) Fruit Extract, Perilla OcymoidesLeaf Extract, Daucus Carota Sativa (Carrot) Root Extract, Sea Salt (Maris Sal), Juniperus Virginiana Oil, Alpha-Glucan Oligosaccharide, Tocopherol, CastorylMaleate, Caprylyl Glycol, Allantoin, Diglycerin, Maltodextrin, LauroylLysine, Arginine, Saccharide Isomerate, Sodium LauroylGlutamate, Beta-Carotene, Xanthan Gum, Ethylhexylglycerin, 1,2-Hexanediol, Hydroxypropyl Methylcellulose, Dextrin, Sodium Palmitate, Sodium Chloride, Acacia Senegal Gum, Sodium Citrate, Water/Aqua/Eau, O-Cymen-5-Ol, Limonene, Linalool.",
        "n_loves": "23.6K",
        "categories": [
            "Mini Size",
            "Skincare"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/antioxidant-hydramist-P423131",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:42:24",
        "product_name": "Antioxidant Hydramist",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.1 oz/ 150 mL"
                ],
                "price": [
                    "$65.00"
                ],
                "sku": "Item 2002210"
            }
        ],
        "rating": "width:96.66600000000001%",
        "product_reviews": "6",
        "ingredients": "Water, Butylene Glycol, PEG-40 Hydrogenated Castor Oil, Arginine/Lysine Polypeptide, Aloe Barbadensis Leaf Juice, Sodium Lactate, Sodium PCA, Sorbitol, Proline, Dipotassium Glycyrrhizate, Methyl Gluceth-20, Camellia Sinensis Leaf Extract, Sodium Carboxymethyl Beta-Glucan, Lecithin, Magnesium Ascorbyl Phosphate, Tocopherol, Palmitoyl Tripeptide-5, Bambusa Vulgaris Leaf/Stem Extract, Pisum Sativum (Pea) Extract, Glucosamine HCl, Glycerin, Disodium EDTA, Capric/Caprylic Triglyceride, Leuconostoc/Radish Root Ferment Filtrate, Citronellol, Eugenol, Geraniol, Limonene, Linalool, Citrus Medica Limonum (Lemon) Peel Extract, Helianthus Annuus (Sunflower) Seed Oil, Rose Damascena Flower Oil, Eugenia Caryophyllus (Clove) Flower Oil, Aniba Rosaeodora (Rosewood) Wood Oil, Citrus Medica Limonum (Lemon) Peel Oil, Pelargonium Graveolens Oil.\n",
        "n_loves": "1.8K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/sebum-clearing-masque-P446904",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:42:37",
        "product_name": "Sebum Clearing Masque",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.5 oz/ 75 mL"
                ],
                "price": [
                    "$74.00"
                ],
                "sku": "Item 2239655"
            }
        ],
        "rating": "width:77.778%",
        "product_reviews": "9",
        "ingredients": "Sebum Clearing Masque:- Salicylic Acid (0.5%). Water, Kaolin, Bentonite, Glycerin, Polysorbate 20, Pentylene Glycol, Carthamus Tinctorius (Safflower) Seed Oil, Cetearyl Alcohol, Butylene Glycol, Glyceryl Stearate SE, Polysorbate 60, Avena Sativa (Oat) Kernel Extract, Bisabolol, Spiraea Ulmaria Extract, Menthol, 10-Hydroxydecanoic Acid, Sebacic Acid, 1,10-Decanediol, Camphor, Farnesyl Acetate, Panthenyl Triacetate, Tocopheryl Acetate, Dipotassium Glycyrrhizate, Cinnamomum Zeylanicum Bark Extract, Sarcosine, Niacinamide, Yeast Extract, Aesculus Hippocastanum (Horse Chestnut) Seed Extract, Ammonium Glycyrrhizate, Panthenol, Zinc Gluconate, Caffeine, Biotin, Hydroxyethylcellulose, Disodium EDTA, Capryloyl Glycine, 1,2-Hexanediol, Tropolone, Caprylyl Glycol, Caprylhydroxamic Acid, Ethylhexylglycerin, Methylpropanediol, Titanium Dioxide (CI 77891), Zinc Oxide (CI 77947).",
        "n_loves": "2.7K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/multivitamin-power-recovery-masque-P423130",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:42:49",
        "product_name": "MultiVitamin Power Recovery Mask",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.5 oz/ 75 mL"
                ],
                "price": [
                    "$89.00"
                ],
                "sku": "Item 2002244"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2326627"
            }
        ],
        "rating": "width:87.162%",
        "product_reviews": "391",
        "ingredients": "-Vitamins A, C, E, F, and B5: Vitamin A helps reduce the appearance of wrinkles while also evening skin tone and texture; Vitamin C brightens and exfoliates to improves damage from age and sun spots; Vitamin E nourishes and protects skin from damage caused by free radical pollution including UV rays; Vitamin F is an essential fatty acid rich in omega-6 that protects and maintains skins moisture barrier; and Vitamin B5 aids in skin repair and hydration. -Retinol: Fights the appearance of fine lines and wrinkles and gently promotes cell turnover for clearer, smoother-looking skin. -Superfood Algae Extract: Restores moisture balance for a youthful complexion. \nWater/Aqua/Eau, Butylene Glycol, Glycerin, C12-15 Alkyl Benzoate, Glycereth-7 Triacetate, Di-C12-15 Alkyl Fumarate, Panthenol, Tocopheryl Acetate, Glyceryl Stearate, PEG-100 Stearate, Orbignya Oleifera Seed Oil, Dipropylene Glycol Dibenzoate, Stearyl Alcohol, Sorbitan Stearate, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, Chondrus Crispus Extract, Arginine/Lysine Polypeptide, Camellia Sinensis Leaf Extract, Chamomilla Recutita (Matricaria) Flower Extract, Avena Sativa (Oat) Kernel Extract, Hydrolyzed Soy Protein, Phospholipids, Retinyl Palmitate, Ascorbyl Palmitate, Linoleic Acid, Beta-Carotene, Lactic Acid, Olea Europaea (Olive) Fruit Oil, Hydrogenated Olive Oil, Dimethicone, Vitis Vinifera (Grape) Seed Extract, Citrus Medica Limonum (Lemon) Peel Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Symphytum Officinale Root Extract, Arctium Majus Root Extract, Anthemis Nobilis Flower Oil, Sodium PCA, Allantoin, Decylene Glycol, Menthoxypropanediol, Potassium Cetyl Phosphate, Sodium Polyacrylate, Ammonium Glycyrrhizate, PPG-15 Stearyl Ether Benzoate, Polysorbate 20, Propylene Glycol, Carbomer, Sclerotium Gum, Disodium EDTA, Aminomethyl Propanol, Phenoxyethanol, Annatto (CI 75120).",
        "n_loves": "39.5K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/sound-sleep-cocoon-P429510",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:43:02",
        "product_name": "Sound Sleep Cocoon",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$123.00"
                ],
                "sku": "Item 2046415"
            }
        ],
        "rating": "width:84.86399999999999%",
        "product_reviews": "37",
        "ingredients": "Water, Dimethicone, Glycerin, Propanediol, Polymethylsilsesquioxane, Albizia Julibrissin Bark Extract, Dimethicone/PEG-10/15 Crosspolymer, Sodium Chloride, Evodia Rutaecarpa Fruit Extract, Lavandula Hybrida Abrial Herb Oil, Tocopheryl Acetate, Terminalia Ferdinandiana Fruit Extract, Caprylhydroxamic Acid, Trisodium Ethylenediamine Disuccinate, Tamarindus Indica Seed Polysaccharide, Dipropylene Glycol, Lavandula Angustifolia (Lavender) Flower Extract, Ethylhexylglycerin, Fusanus Spicatus Wood Oil, Pogostemon Cablin Leaf Oil, Sodium Citrate, PEG-10 Dimethicone, Hexanediol, Polyurethane Crosspolymer-1, Limonene, Tocopherol, Citric Acid, Linalool, Phenoxyethanol.",
        "n_loves": "3.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Night Creams"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-retinol-clearing-oil-P458768",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:43:15",
        "product_name": "Retinol Clearing Oil",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$119.00"
                ],
                "sku": "Item 2356707"
            }
        ],
        "rating": "width:80.91%",
        "product_reviews": "22",
        "ingredients": "-Retinol: Supports natural skin renewal to diminish the appearance of fine lines, wrinkles, and uneven skin tone.-Salicylic Acid: Supports natural exfoliation to help clear clogged follicles and smooth dullness that contribute to visible skin aging.-Jojoba, Rosehip Seed, and Argan Oils: Lightweight, skin-friendly oils packed with phytoactive lipids that melt into the skin’s natural lipid layer. Coconut Alkanes, PPG-15 Stearyl Ether, Rosa Canina Fruit Oil, Simmondsia Chinensis (Jojoba) Seed Oil, C13-15 Alkane, Coco-Caprylate/Caprate, Argania Spinosa Kernel Oil, Salicylic Acid, Caprylic/Capric Triglyceride, Isopropyl Lauroyl Sarcosinate, Retinyl Propionate, Butyl Avocadate, Phenylethyl Resorcinol, Tanacetum Annuum Flower Oil, Sclareolide, Triolein, Cetyl Alcohol, Hydroxymethoxyphenyl Decanone, Tocopherol, BHT, Propyl Gallate. Clean at Sephora products are formulated without:Sulfates—SLS + SLES, Parabens, Formaldehydes, Formaldehyde-releasing agents, Phthalates, Mineral Oil, Retinyl Palmitate, Oxybenzone, Coal Tar, Hydroquinone, Triclosan, Triclocarban, Undisclosed synthetic fragrances (Products can be formulated with disclosed synthetic fragrances that meet the following two criteria: (1) the synthetic fragrances do not include any of the ingredients listed in numbers 1 through 12 above and (2) the synthetic fragrances are at a concentration below 1% of the total formula) The following type of acrylates: (ethyl acrylate, ethyl methacrylate, methyl methacrylate, butyl methacrylate, hydroxypropyl methacrylate, tetrahydrofurfuryl methacrylate, trimethylolpropane trimethacrylate , aluminum salts), Animal Oils/Musks/Fats, Benzophenone + Related Compounds, Butoxyethanol, Carbon Black, Lead/Lead Acetate, Methyl Cellosolve + Methoxyethanol, Methylchloroisothiazolinone & Methylisothiazolinone, Mercury + Mercury Compounds (Thimerisol), Insoluble Plastic Microbeads (This prohibited ingredient applies to products that are meant to be rinsed off ), Resorcinol, Talc (Talc that is free of any asbestos can be used in the formulation provided that Brand conducts testing to ensure that talc is free of any asbestos.), Toluene, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) that is 0.1% or more of total formula, Ethanolamines DEA/TEA/MEA/ETA, Nanoparticles as defined by the European Commission, Petrolatum and Parrafin that is not USP grade, Phenoxyethanol that is 1% or more of total formulation, Polyacrylamide & Acrylamide, The following types of Styrene (Bromostyrene, Deastyrene/acrylates/dvbcopolymer, sodium styrene/divinylbenzene copolymer , styrene oxide, styrene), 1,4 Dioxane in final formulas must comply with the thresholds as follows: (10 or < ppm for products that are meant to be rinsed off, wiped off or removed, 3ppm or < for products that are meant to remain on the skin).",
        "n_loves": "2.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermalogica-biolumin-c-vitamin-c-gel-moisturizer-P475086",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:43:27",
        "product_name": "BioLumin-C Vitamin-C Gel Moisturizer",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$96.00"
                ],
                "sku": "Item 2479814"
            }
        ],
        "rating": "width:92.48200000000001%",
        "product_reviews": "274",
        "ingredients": "-Vitamin C Complex: Provides antioxidant protection and visibly brightens, firms, and fades dark spots.-Squalane & 5 Types of Hyaluronic Acid: Delivers long lasting hydration and minimizes fine lines and wrinkles.-Phytic Acid and Pumpkin Enzymes: Gently exfoliates for a brighter-looking, softer, and more even-looking skin tone.Water/Aqua/Eau, Glycerin, Squalane, Propanediol, Butylene Glycol, PPG-24-Glycereth-24, Jojoba Wax Peg-120 Esters, Hydroxyethyl Urea, Trehalose, Aminopropyl Ascorbyl Phosphate, Allantoin, Hyaluronic Acid, Hydrolyzed Hyaluronic Acid, Hydrolyzed Jojoba Esters, Biosaccharide Gum-1, Ethylhexylglycerin, Sodium PCA, Sodium Levulinate, Ergothioneine, Beta-Carotene, Lactobacillus Ferment, Aloe Barbadensis Leaf Juice, Camellia Sinensis Leaf Extract, Centella Asiatica Extract, Chamomilla Recutita (Matricaria) Flower Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Verbascum Thapsus Extract, Lactobacillus/Pumpkin Ferment Extract, Glycine Soja (Soybean) Oil, Citrus Aurantium Dulcis (Orange) Peel Extract, Citrus Paradisi (Grapefruit) Peel Oil, Helianthus Annuus (Sunflower) Seed Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Raspberry Ketone, Jasminum Sambac (Jasmine) Flower Extract, Santalum Album (Sandalwood) Oil, Daucus Carota Sativa (Carrot) Root Extract, Bisabolol, Cystine, Glycine, Dipotassium Glycyrrhizate, Hydrolyzed Glycosaminoglycans, Sodium Hyaluronate Crosspolymer, Sodium Hyaluronate, Pentylene Glycol, Caprylyl Glycol, Tocopherol, Mannitol, Tetrasodium Glutamate Diacetate, Sodium Hydroxide, Phytic Acid, Citric Acid, PEG-40 Hydrogenated Castor Oil, C12-13 Pareth-3, Xanthan Gum, Sclerotium Gum, Polyacrylate Crosspolymer-6, Ascorbyl Methylsilanol Pectinate, Glyceryl Caprylate, p-Anisic Acid, Benzyl Glycol, Methylpropanediol, Sodium Benzoate, Potassium Sorbate, Limonene.",
        "n_loves": "8K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/multi-active-toner-P423150",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:43:39",
        "product_name": "Multi-Active Toner ",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.4 oz/ 250 mL"
                ],
                "price": [
                    "$59.00"
                ],
                "sku": "Item 2002129"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$18.00"
                ],
                "sku": "Item 2221125"
            }
        ],
        "rating": "width:87.864%",
        "product_reviews": "323",
        "ingredients": "Water, Butylene Glycol, Aloe Barbadensis Extract, Arginine, Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract, Melissa Officinalis Leaf Extract, Citrus Limon (Lemon) Peel Oil, Citrus, Aurantium Bergamia (Bergamot) Fruit Oil, Cymbopogon Winterianus Herb Oil, Glycine, Alanine, Serine Lavandula Angustifolia (Lavender) Oil, Dipotassium Glycyrrhizate, Cucumis Sativus (Cucumber) Fruit Extract, Arnica Montana Flower Extract, Hedera Helix (Ivy) Extract, Malva Sylvestris (Mallow) Flower Extract, Parietaria Officinalis Extract, Sambucus Nigra Flower Extract, Tocopherol, Phenylalanine, Histidine, Valine, Isoleucine, Proline, Threonine, Sodium PCA, Sodium Lactate, Citric Acid, Polyquaternium-4, Aspartic Acid, PCA, Ethylhexylglycerin, Methyl Gluceth-20, Polysorbate 20, 1,2-Hexanediol, Caprylyl Glycol, PEG-12 Dimethicone, Ricinoleth-40, Sodium Citrate, Sodium Hydroxide, Tetrasodium Glutamate Diacetate, Linalool, Limonene, Citral, Geraniol, Phenoxyethanol.",
        "n_loves": "19.1K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/special-cleansing-gel-mini-P443700",
        "error": "",
        "scrape_timestamp": "08/21/2023, 13:43:51",
        "product_name": "Mini Special Cleansing Gel",
        "brand_name": "Dermalogica",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$18.00"
                ],
                "sku": "Item 2221091"
            }
        ],
        "rating": "width:90.01400000000001%",
        "product_reviews": "737",
        "ingredients": " -Lavender: Soothes skin.-Quillaja Saponaria Bark Extract: Naturally foams and cleanses.  Water/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, Sodium Lauroyl Sarcosinate, Butylene Glycol, Hydroxyethylcellulose,Lavandula Angustifolia (Lavender) Oil, Quillaja Saponaria Bark Extract, Citrus Limon (Lemon) Peel Oil, Melissa Officinalis Leaf Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Cymbopogon Nardus (Citronella) Oil, Glycerin, Cocamidopropyl Betaine, Sodium Cocoamphoacetate, Hydroxyacetophenone, Cocamidopropyl Hydroxysultaine, 1,2-Hexanediol, Caprylyl Glycol, Propanediol, Citric Acid, O-Cymen-5-Ol, Disodium EDTA, PPG-5-Ceteth-20, Sodium Hydroxide, Sodium Benzoate",
        "n_loves": "19.4K",
        "categories": [
            "Skincare",
            "Mini Size"
        ]
    }
]