[
    {
        "url": "https://www.sephora.com/ca/en/product/dr-brandt-skincare-cool-biotic-prebiotic-redness-relief-cream-P460758",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:17:52",
        "product_name": "Cool Biotic™ Prebiotic Redness Relief Cream",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 48 g",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$76.00"
                ],
                "sku": "Item 2377315"
            }
        ],
        "rating": "width:81.80199999999999%",
        "product_reviews": "111",
        "ingredients": " -Cannabis Sativa Seed Oil: Visibly calms, soothes, and relieves distressed skin. \n-Biotic Balancing Complex™: Replenishes the skin’s surface microenvironment for a soothed, even, and healthy appearance.\n-Colloidal Oatmeal: Attracts and seals in moisture while visibly calming signs of distress.  \n\nWater/Aqua/Eau, Caprylic/Capric Triglyceride, Hydroxystearic Acid, Cetyl Alcohol, Stearyl Alcohol, Polyglyceryl-6 Stearate, Cannabis Sativa Seed Oil, Lactococcus Ferment Lysate, Avena Sativa (Oat) Kernel Flour, Ophiopogon Japonicus Root Extract, Yogurt, Ceramide Np, Enteromorpha Compressa Extract, Polysorbate 60, Sorbitan Isostearate, Sucrose, Fructose, Glucose, Camellia Sinensis Leaf Extract, Ocimum Sanctum Leaf Extract, Silybum Marianum Fruit Extract, Lactic Acid, Vitis Vinifera (Grape) Seed Extract, Inulin, Maltodextrin, Glycerin, Polyglyceryl-6 Behenate, Ethylhexylglycerin, Propanediol, Benzyl Alcohol, Methyl Lactate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sodium Chloride, Sodium Benzoate, Citric Acid.",
        "n_loves": "8.7K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/needles-no-more-neck-sculpting-cream-P440302",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:18:05",
        "product_name": "needles no more® Neck Sculpting Cream",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 g",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$128.00"
                ],
                "sku": "Item 2167633"
            }
        ],
        "rating": "width:78.37799999999999%",
        "product_reviews": "37",
        "ingredients": " -Slim Sculpt Complex: Caffeine, soy isoflavones, spirulina, and guarana extract work together to help reduce the look of a fatty appearance below the chin and improve skin firmness. -Pea Extract: A plant-derived protein that provides an instant tightening sensation and moisturization.-Hydra-Firm Complex: A combination of hyaluronic acid, glycerin, and panthenol that provides long-term hydration and prevents moisture loss for up to 72 hours. Water/Aqua/Eau, Cyclomethicone, Propanediol, Glycerin, Caprylic/Capric Triglyceride, Pisum Sativum (Pea) Extract, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Polysorbate 80, Caffeine, Paullinia Cupana Seed Extract, Butylene Glycol, Microcrystalline Cellulose, Lactic Acid, Vaccinium Myrtillus Fruit/Leaf Extract, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Saccharum Officinarum (Sugar Cane) Extract, Spirulina Platensis Extract, Algae Extract, Ricinus Communis (Castor) Seed Oil, Anthemis Nobilis Flower Oil, Calcium Pantetheine Sulfonate, Cysteic Acid, Xanthan Gum, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Caprylyl Glycol, Acer Saccharum (Sugar Maple) Extract, Soy Isoflavones, Lavandula Angustifolia (Lavender) Oil, Hexylene Glycol, Sodium Hyaluronate, Ethylhexylglycerin, Panthenol, Sodium Hydroxide, Sodium Phytate, Sodium Chloride, Polysorbate 60, Sorbitan Isostearate, Carnatine, Maltodextrin, Alcohol, Phenoxyethanol, Linalool.",
        "n_loves": "6.3K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Decollete & Neck Creams"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/drop-strength-all-day-strengthening-serum-P500151",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:18:17",
        "product_name": "Drop of Strength All Day Strengthening Serum",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$115.00"
                ],
                "sku": "Item 2533511"
            }
        ],
        "rating": "width:90%",
        "product_reviews": "2",
        "ingredients": "-Immubarrier Complex: Supports skin’s immunity and visibly improves eight key signs of aging.Water/Aqua/Eau, Isopentyldiol, Glycerin, Pentylene Glycol, Diglycerin, 1,2-Hexanediol, Caprylic/Capric Triglyceride, Caprylyl Glycol, Caprylyl/Capryl Glucoside, Citric Acid, Glyceryl Caprylate, Polyglyceryl-6 Oleate, Punica Granatum Pericarp Extract, Rubus Idaeus (Raspberry) Leaf Extract, Sodium Citrate, Sodium Cocoyl Glutamate, Sodium Hyaluronate, Sodium Surfactin, Xanthan Gum, Yeast Extract/Extrait De Levure, Sodium Benzoate.",
        "n_loves": "769",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-brandt-skincare-c-scription-vitamin-c-brightening-serum-P467614",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:18:37",
        "product_name": "C Scription™ Vitamin C Brightening Serum",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$162.00"
                ],
                "sku": "Item 2304129"
            }
        ],
        "rating": "width:93.42200000000001%",
        "product_reviews": "149",
        "ingredients": "-THD Ascorbate 20%: Visibly brightens, smooths, and firms the skin by supporting collagen. -Hexylresorcinol Complex 4%: Brightens the appearance of dark spots. -Plankton Extract 1%: Visibly evens skin tone and reduces age spots. Water/Aqua/Eau, Tetrahexyldecyl Ascorbate, C9-12 Alkane, PPG-24-Glycereth-24, Propanediol, Glycerin, Potassium Cetyl Phosphate, Caprylic/Capric Triglyceride, Glyceryl Stearate, PEG-100 Stearate, 1,2-Hexanediol, Hexylresorcinol, Ethyl Linoleate, Plankton Extract, Bioflavonoids, Glucose, Lecithin, Lavandula Angustifolia (Lavender) Oil, Lavandula Hybrida Oil, Citric Acid, Citrus Aurantium Dulcis (Orange) Peel Extract, Tocopheryl Acetate, Xanthan Gum, Coco-Caprylate/Caprate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Phenethyl Alcohol, Polyglyceryl-6 Polyricinoleate, Pentylene Glycol, Tocopherol, Aminomethyl Propanol, Disodium EDTA, Linalyl Acetate, Chlorogenic Acids, Sodium Ascorbate, Phenoxyethanol, Linalool, Limonene, Geraniol.",
        "n_loves": "4.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-brandt-skincare-microdermabrasion-renewing-age-defying-face-exfoliator-P502640",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:18:54",
        "product_name": "Microdermabrasion Renewing Age-Defying Face Exfoliator",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2.1 oz / 60 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$107.00"
                ],
                "sku": "Item 2533438"
            }
        ],
        "rating": "width:92.18400000000001%",
        "product_reviews": "87",
        "ingredients": "-Biocellulose Microgranules (Wood-Derived Cellulose Pulp): Physically exfoliate.-Glycolic and Lactic Acid (AHAs): Chemically exfoliate. -Vegetable Wax: Nourishes, moisturizes, and softens skin. Water/Aqua/Eau, Cellulose, Caprylic/Capric Triglyceride, Cetearyl Alcohol, Glycerin, Hydrogenated Vegetable Glycerides, Stearyl Stearate, Cetearyl Glucoside, Glycolic Acid, Lactic Acid, Sodium Benzoate, Xanthan Gum, Sodium Hydroxide, Copernicia Cerifera (Carnauba) Wax/ Cire De Carnauba, Rhus Verniciflua Peel Wax, Menthol, Citral, Citrus Limon (Lemon) Peel Oil, Allantoin, Levulinic Acid, Citral, Sodium Levulinate, Sodium Phytate, Citrus Aurantifolia (Lime) Oil, Punica Granatum Pericarp Extract.",
        "n_loves": "3K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/24-7-retinol-eye-cream-P417625",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:19:11",
        "product_name": "24/7 Retinol Eye Cream",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 g",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$78.00"
                ],
                "sku": "Item 1929421"
            }
        ],
        "rating": "width:78.018%",
        "product_reviews": "111",
        "ingredients": " -Time-Release Retinol: Softens the appearance of lines and wrinkles. -Ruby Crystal Complex: Softens the look of lines and visibly brightens the eye contour. -Olive Fruit Pulp: Helps reduce the appearance of redness and protects skin against environmental stressors.Aqua/Water/Eau, Glycerin, Cyclopentasiloxane, Propanediol, Dimethiconol, Coco-Caprylate/Caprate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Phenoxyethanol, Mica, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Citrus Nobilis (Mandarin Orange) Peel Oil, Sodium Benzoate, Isohexadecane, Polysorbate 60, Triethoxycaprylylsilane, Maslinic Acid, Caprylic/Capric Triglyceride, Sodium Hydroxide, Hyaluronic Acid, Ruby Powder, Ethylhexylglycerin, Aluminium Hydroxide, Glycine Soja (Soybean) Oil, Glucosyl Hesperidin, Tocopherol Acetate, Retinol, Lecithin, Limonene, Titanium Dioxide (Ci 77891), Iron Oxides (Ci 77491). ",
        "n_loves": "8.7K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/poredermabrasion-pore-perfecting-exfoliator-P397310",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:19:31",
        "product_name": "PoreDermabrasion™ Pore Perfecting Exfoliator",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2 oz",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$80.00"
                ],
                "sku": "Item 1709831"
            }
        ],
        "rating": "width:84.82799999999999%",
        "product_reviews": "319",
        "ingredients": " -Micro-size Aluminum Oxide Crystals: Cleanse and improve the look of skin texture.-Salicylic Acid: Helps unclog pores. -Lentil Seed Extract: Refines the look of pores. Water/Aqua/Eau, Alumina, Glycerin, Butylene Glycol, Lactobacillus Ferment, Carica Papaya (Papaya) Fruit Extract, Carbomer, Methyl Gluceth-20, Lens Esculenta (Lentil) Fruit Extract, Microcitrus Australasica Fruit Extract, Lactobacillus/Pumpkin Fruit Ferment Filtrate, Amyris Balsamifera Bark Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Eugenia Caryophyllus (Clove) Leaf Oil, Jasminum Officinale (Jasmine) Oil, Lavandula Angustifolia (Lavender) Oil, Citrus Limon (Lemon) Peel Oil, Mentha Piperita (Peppermint) Oil, Rosa Damascena Flower Oil, Caprylic/Capric Triglyceride, Allantoin, Xanthan Gum,  Sodium Hyaluronate, Salicylic Acid, Methyl Methacrylate Crosspolymer, Alcohol Denat., Sodium Hydroxide, Leuconostoc/Radish Root Ferment Filtrate, Phenoxyethanol, Ethylhexylglycerin, Iron Oxide (Ci 77491), Sodium Oxide.",
        "n_loves": "21K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-brandt-skincare-triple-active-retinol-gentle-overnight-renewal-cream-P476570",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:19:49",
        "product_name": "Triple Active Retinol Gentle Overnight Renewal Cream",
        "brand_name": "Dr. Brandt Skincare",
        "options": [],
        "rating": "width:76.666%",
        "product_reviews": "12",
        "ingredients": "-Stabilized Retinol (Rapid Delivery): Visibly improves uneven skin tone and reduces fine lines and wrinkles. -Encapsulated Retinol (Time-Released): Smooths and brightens the look of skin while minimizing irritation. -Bakuchiol (Plant-Based Retinol Alternative): Targets signs of aging. Water/Aqua/Eau, Glycerin, Isoamyl Laurate, Dicaprylyl Carbonate, Ethylhexyl Palmitate, Glyceryl Stearate, Isostearyl Neopentanoate, Shea Butter Cetyl Esters, Sorbitan Oleate, Caprylic/Capric Triglyceride, Cetyl Alcohol, Stearyl Alcohol, Retinol, Bakuchiol, Ceramide NP,Squalane, Sodium Ascorbate, Sodium Lactate, Tocopherol, Tocopheryl Acetate, PEG-40, Hydrogenated Castor Oil, Glycine Soja (Soybean) Oil, Xanthan Gum, Cucumis Sativus (Cucumber) Fruit Extract, Chamomilla Recutita (Matricaria) Flower Extract, Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract, Arctium Lappa Root Extract, Aloe Barbadensis Leaf, Acacia Senegal Gum, Jasminum Officinale (Jasmine) Flower Extract, Acrylates/C10 30 Alkyl Acrylate Crosspolymer, Sodium Citrate, Trisodium EthylenediamineDisuccinate, Ethylhexylglycerin, Butylene Glycol, Pentylene Glycol, Propylene Glycol Alginate, Carbomer, Sodium Hydroxide, Behenyl Alcohol, Benzyl Alcohol.",
        "n_loves": "1.6K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-brandt-skincare-dark-spots-no-more-triple-acid-spot-minimizing-concentrate-P453822",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:20:00",
        "product_name": "Dark Spots No More® Triple Acid Spot Minimizing Concentrate",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$96.00"
                ],
                "sku": "Item 2304111"
            }
        ],
        "rating": "width:79.268%",
        "product_reviews": "82",
        "ingredients": " -10% Azelaic Acid Derivative: Water soluble and more tolerated version of azelaic acid that visibly brightens skin tone.-3% Tranexamic Acid: Clinical-grade acid, widely used in dermatology to prevent discoloration.-2% Phytic Acid: A resurfacing ingredient derived from rice to exfoliate skin. Water/Aqua/Eau, Niacinamide, Propanediol, Potassium Azeloyl Diglycinate, Tranexamic Acid, Glycerin, Polyacrylate Crosspolymer-6, Phytic Acid, Plankton Extract, Lecithin, Camellia Sinensis Leaf Extract, Tasmannia Lanceolata Fruit/Leaf Extract, Caprylyl Glycol, Tocopherol, Potassium Chloride, Potassium Sorbate, Sodium Benzoate, Sodium Ascorbate, Tetrahydrodiferuloylmethane, Ethylhexylglycerin, Chlorphenesin, T-Butyl Alcohol, Phenoxyethanol.",
        "n_loves": "10.1K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/magnetight-age-defier-P411254",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:20:12",
        "product_name": "MAGNETIGHT Age-Defier™ Mask",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 3 oz/ 89 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$101.00"
                ],
                "sku": "Item 1851898"
            }
        ],
        "rating": "width:78.432%",
        "product_reviews": "306",
        "ingredients": " -Firming Peptides: Improve visual firmness and smooth the look of wrinkles.-Black Tourmaline: Energizing minerals for a radiant look.-Skin Scavengers: Antioxidant molecules that purify the skin and reduce the visual signs of aging caused by pollutants, free-radicals, and environmental stress. Iron Powder, Dimethicone, C12-15 Alkyl Benzoate, Polysilicone-11, Nylon-12, Silica, Lavandula Angustifolia (Lavender) Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Pelargonium Graveolens Flower Oil, Anthemis Nobilis Flower Oil, Tourmaline Powder, Dimethylmethoxy Chromanol, Tribehenin, Cermide Ng, Peg-10 Rapeseed Sterol, Palmitoyl Hexapeptide-12, Peg-10 Dimethicone, Polysorbate 40, Isohexadecane, Ammonium Polyacryloyldimethyl Taurate, Polymethylsilsesquioxane, Hdi/Trimethylol Hexyllactone Crosspolymer.",
        "n_loves": "19.8K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pores-no-more-pore-purifying-cleanser-P448710",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:20:25",
        "product_name": "pores no more® Pore Purifying Cleanser",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 3.5 oz/ 105 mL",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$51.50"
                ],
                "sku": "Item 2267300"
            }
        ],
        "rating": "width:85.07400000000001%",
        "product_reviews": "67",
        "ingredients": " -Salicylic Acid: Exfoliates and removes dead skin cells, keeps pores clean, and helps prevent clogging. -Tea Tree Oil: Helps purify the skin and supports clarity for a smooth, clear-looking complexion.-White Willow Bark Extract: A natural beta hydroxy acid that gently and effectively exfoliates to unclog and purify pores while soothing the skin.   Water, Disodium C12-14 Pareth-3 Sulfosuccinate, Cocamidopropyl Betaine, Sodium Lauryl Sulfoacetate, Phenoxyethanol, Sodium Sulfate, Sodium Chloride, Peg-150 Pentaerythrityl Tetrastearate, Glycol Stearate, Hydroxypropyl Guar, Peg-6 Caprylic/Capric Glycerides, Laureth-10, Ethylhexylglycerin, Rosmarinus Officinalis (Rosemary) Leaf Oil, Citric Acid, Disodium Edta, Glycerin, Stearamide Amp, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Linalyl Acetate, Salicylic Acid, Salix Alba (Willow) Bark Extract, Geranium Maculatum Extract.",
        "n_loves": "5.4K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pores-no-more-vacuum-cleaner-pore-purifying-mask-P429662",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:20:38",
        "product_name": "pores no more® Vacuum Cleaner® Pore Purifying Mask",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 g",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2062933"
            }
        ],
        "rating": "width:77.714%",
        "product_reviews": "245",
        "ingredients": "-Salicylic Acid and Iris Extract: Exfoliate and remove dead skin cells, helping to loosen blackheads, keep pores clean, and prevent clogging.-Glycolic Acid, Alpha Hydroxy Acid: Derived from sugar cane, exfoliate and soften the appearance of skin’s texture.-Mineral Powder: Extracts dirt and absorbs excess oil. Water (Aqua), Silica, Butylene Glycol, Benzyl Alcohol, Mannitol, Alcohol Denat., Xanthan Gum, Cellulose, Lavandula Angustifolia (Lavender) Oil, Glycolic Acid, Menthone Glycerin Acetal, Enantia Chlorantha Bark Extract, Sodium Hydroxide, Disodium Edta, Glycerin, Salicylic Acid, Oleanolic Acid, Acrylates Copolymer, Caprylic/Capric Triglyceride, Tocopheryl Acetate, Hydroxypropyl Methylcellulose, Iris Florentina Root Extract, Sodium Benzoate, Potassium Sorbate, Rosa Multiflora (Rose) Fruit Extract, Ci 77007 (Ultramarines), Ci 77891 (Titanium Dioxide), Ci 77120 (Barium Sulfate).",
        "n_loves": "16.6K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pores-no-more-pore-refiner-primer-P139005",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:20:50",
        "product_name": "pores no more® pore refiner primer",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Matte finish - Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz"
                ],
                "price": [
                    "$65.00"
                ],
                "sku": "Item 1161629"
            },
            {
                "swatch_group": "Matte finish - Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 1640028"
            }
        ],
        "rating": "width:85.282%",
        "product_reviews": "3.3K",
        "ingredients": " -Oil-Absorbing Spheres: Mattify skin and diffuse light to minimize the appearance of pores, expression lines, and wrinkles.-Red Clover Flower Extract: Helps shrink the look of pores over time by rebalancing skin conditions responsible for pore enlargement.-Derivative of Salicylic Acid: Gently exfoliates dead skin cells and oil build-up within pores, smooths the look of the skin’s surface, and calms skin. Cyclopentasiloxane, Water/Aqua/Eau, Dimethicone Crosspolymer, Lauryl Peg/Ppg-18/18 Methicone, Methyl Methacrylate Crosspolymer,  Polymethylsilsesquioxane, Dimethicone/Vinyl Dimethicone Crosspolymer, Polysilicone-11,  Titanium Dioxide (Ci 77891), Dimethyl Isosorbide, Polymethyl Methacrylate,  Phenoxyethanol, Peg/Ppg-18/18 Dimethicone, Isopentyldiol, Ethylhexyl Palmitate, Capryloyl Salicylic Acid, Chlorphenesin, Lavandula Angustifolia (Lavender) Oil, Ethylhexylglycerin, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Silica,  Triethoxycaprylylsilane, Hdi/Trimethylol Hexyllactone Crosspolymer, Dimethyl Oxobenzo Dioxasilane, Silica Dimethyl Silylate, Trifolium Pratense (Clover) Flower Extract, Laureth-12, Iron Oxide (Ci 77492, Ci 77491, Ci 77499).",
        "n_loves": "110.1K",
        "categories": [
            "Makeup",
            "Face",
            "Face Primer"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/needles-no-more-P391802",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:21:02",
        "product_name": "Needles No More™ Wrinkle Smoothing Cream",
        "brand_name": "Dr. Brandt Skincare",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 0.5 oz",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$120.00"
                ],
                "sku": "Item 1658434"
            }
        ],
        "rating": "width:70.566%",
        "product_reviews": "513",
        "ingredients": " -Neuropeptides: Deliver skin relaxing ingredients where they are most needed.-Magnesium and Adenosine: Help soften and reduce the appearance of expression lines and wrinkles over time. Water/Aqua/Eau, Perfluorohexane, Perfluoroperhydrophenanthrene, Butyrospermum Parkii (Shea) Butter, Perfluorodecalin, C12-16 Alcohols, Butylene Glycol Dicaprylate/Dicaprate, Polymethyl Methacrylate, Sodium Acrylates Copolymer, Glycerin, Isopropyl Palmitate, Methyl Methacrylate Crosspolymer, Adenosine, Tocopherol, Ricinus Communis (Castor) Seed Oil, Lavandula Angustifolia (Lavender) Flower Extract, Anthemis Nobilis Flower Oil, Magnesium Gluconate, Prolinamidoethyl Imidazole, Butylene Glycol, Glutamylamidoethyl Imidazole, Palmitoyl Hexapeptide-52, Polyvinyl Alcohol, Lactic Acid, Glycolic Acid, Palmitoyl Heptapeptide-18, Hydrogenated Lecithin, Palmitic Acid, Sodium Cocoyl Glutamate, Glyceryl Stearate, Stearic Acid, Cetearyl Alcohol, Lecithin, Phenoxyethanol, Ethylhexylglycerin, Sodium Hydroxide, Gyceryl Caprylate, Menthone Glycerin Acetal, P-anisic Acid, Citric Acid, Xanthan Gum, Hydroxyethylcellulose, Helianthus Annus (Sunflower) Seed Oil, Chlorphenesin, Sodium Phytate, Silanediol Salicylate, Tromethamine, Methylpropanediol, Linalool.",
        "n_loves": "15.6K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hydro-biotic-tm-recovery-sleeping-mask-P427397",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:21:14",
        "product_name": "Hydro Biotic™ Recovery Sleeping Mask",
        "brand_name": "Dr. Brandt Skincare",
        "options": [],
        "rating": "width:91.548%",
        "product_reviews": "1.2K",
        "ingredients": " -Biotic Balancing Complex: Maintains skin's naturally occurring flora for a strengthened barrier. -Unique Delivery Matrix: Combines a soothing peptide with honey, boswellia, and tea extracts to reduce redness and soothe the skin.-Restorative Blend of Ceramides, Fatty Acids and Tamarindo Extract: Provides deep hydration, supports natural elasticity, and reduces water loss. Water/Aqua/Eau, Dimethicone, Propanediol, Glycerin, Sodium Chloride, Dimethicone Peg-10/15 Crosspolymer, Lactococcus Ferment Lysate, Hexyldecanol, Inulin, 1,2-hexanediol, Sodium Benzoate, Yogurt Powder, Peg-10 Dimethicone, Butylene Glycol, Tamarindus Indica Seed Polysaccharide, Sodium Citrate, Caprylhydroxamic Acid, Tocopheryl Acetate, Lavandula Angustifolia (Lavender)  Oil, Trisodium Ethylenediamine Disuccinate, Bisabolol, Cetylhydroxyproline Palmitamide, Stearic Acid, Honey, Brassica Campestris (Rapeseed) Sterols, Rosa Damascena Flower Oil, Camellia Sinensis Leaf Extract, Phenoxyethanol, Vitis Vinifera (Grape) Seed Extract, Boswellia Serrata Extract, Honey Extract, Chlorophyllin-copper Complex, Aspalathus Linearis (Rooibos) Extract, Saccharomyces Polypeptides.",
        "n_loves": "22.7K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    }
]