[
    {
        "url": "https://www.sephora.com/ca/en/product/dermask-intra-jet-firming-solution-P397627",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:31:40",
        "product_name": "Dermask Intra Jet Firming Solution™",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 1 Mask",
                "name": [
                    "Type: Dermask Intra Jet Firming Solution™ - 1 mask"
                ],
                "price": [
                    "$12.50"
                ],
                "sku": "Item 1723857"
            }
        ],
        "rating": "width:66.8%",
        "product_reviews": "50",
        "ingredients": " -Bio-peptides: Activate skin function recovery.\n-Coenzyme Q10: Contains antioxidant properties for skin elasticity improvement.\n-Beta-glucan: Reduces the appearance of fine lines and wrinkles.\n\n\nWater, Glycerin, 1,2-Hexanediol, Ceratonia Siliqua Gum, Chondrus Crispus Powder, PEG-60 Hydrogenated Castor Oil,Cetyl Ethylhexanoate, Phenyl Trimethicone, Allantoin, Butylene Glycol, Beta-Glucan, Agar, Dipotassium Glycyrrhizate, Adenosine, Disodium EDTA, Cupressus Sempervirens Leaf/Nut/Stem Oil, Potassium Hydroxide, Ubiquinone, Glyceryl Polymethacrylate, Propylene Glycol, Palmitoyl Oligopeptide.\nPlease be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "9.9K",
        "categories": [
            "Skincare",
            "Masks",
            "Sheet Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/vital-hydra-hydro-plump-water-cream-P506709",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:31:55",
        "product_name": "Vital Hydra Solution™ Water Cream Glow Moisturizer with Hyaluronic Acid ",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 1.69 oz / 50 mL",
                    "NEW"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2692218"
            }
        ],
        "rating": "width:92.844%",
        "product_reviews": "204",
        "ingredients": "-Hyaluronic Acid: Hydrates skin.-PENTAVITIN™: Supports skin’s barrier to hold in hydration.Water/Aqua/Eau, Propanediol, Phenyl Trimethicone, Betaine, Glycerin, Niacinamide, Glyceryl Glucoside, Saccharide Isomerate, Vinyl Dimethicone, Caprylyl Glycol, Sodium Hyaluronate, Dimethiconol, Ethylhexylglycerin, Adenosine, Beta-Glucan, Polymethylsilsesquioxane, Ammonium Acryloyldimethyltaurate/Vp Copolymer,  1,2-Hexanediol, Ammonium Acryloyldimethyltaurate/Beheneth-25 Methacrylate  Crosspolymer, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate  Copolymer, Pentylene Glycol, Sorbitan Isostearate, Citric Acid, Fragrance (Parfum), Sodium Citrate.",
        "n_loves": "4.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-cicapair-color-correcting-treatment-spf-30-P482524",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:32:08",
        "product_name": "Cicapair Color Correcting Treatment SPF 30",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$73.00"
                ],
                "sku": "Item 2580819"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 15 mL/ .50 fl oz"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2580801"
            }
        ],
        "rating": "width:80.08800000000001%",
        "product_reviews": "5K",
        "ingredients": "-Mineral Sunscreen (Zinc Oxide and Titanium Dioxide): Forms a protective barrier that reflects UV rays, shielding skin from sun damage.Water, Centella Asiatica Leaf Water, Isononyl Isononanoate, Cyclopentasiloxane, Butylene Glycol, Dimethicone, Phenyl Trimethicone, Methyl Methacrylate Crosspolymer, Beeswax/Cire D'abeille, Glycerin, Diethylhexyl Carbonate, Polyglyceryl-3 Polyricinoleate, Niacinamide, Polymethylsilsesquioxane, Cyclohexasiloxane, Pan-Thenol, Diglycerin, Iron Oxides, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Dimethicone/Vinyl Dimethi- Cone Crosspolymer, Isododecane, Ethylene/Methacrylate Copolymer, Cetearyl Alcohol, Polyglyceryl-2 Triisostearate, Aluminum Hydroxide, Stearic Acid, Disteardimonium Hectorite, Acrylates/Ammonium Methacrylate Copolymer, Sclerotium Gum, Sodium Benzoate, Acrylates/Dimethicone Copolymer, Hydrogen Dimethicone, Chromium Oxide Greens, Triethyl Citrate, Potassium Sorbate, Fragaria Vesca (Strawberry) Leaf Extract, Disodium EDTA, BHT, Alcohol, Asiaticoside, Aden- Osine, Triethoxycaprylylsilane, Lavandula Angustifolia (Lavender) Oil, Boron Nitride, Asiatic Acid, Madecassic Acid, Citrus Grandis (Grapefruit) Peel Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, 1,2- Hexanediol, Anthemis Nobilis Flower Oil, Houttuynia Cordata Extract, Propanediol, Centella Asiatica Extract, Gentiana Lutea Root Extract, Artemisia Absinthium Extract, Achillea Millefolium Extract, Arnica Montana Flower Extract, Polysorbate 20, Aniba Rosodora (Rosewood) Wood Oil, Sodium Glycerophosphate, Selaginella Lepidophylla Extract, Potassium Magnesium Aspartate, Citric Acid, Calcium Gluconate, Madecassoside, Magnesium Gluconate, Centella Asiatica Meristem Cell Culture, Xanthan Gum, Titanium Dioxide, Zinc Oxide.",
        "n_loves": "12.7K",
        "categories": [
            "Makeup",
            "Face",
            "Color Correct"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-ceramidin-body-lotion-P462860",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:32:21",
        "product_name": "Ceramidin™ Body Lotion",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 6.76 oz/ 200 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 2379279"
            }
        ],
        "rating": "width:85.518%",
        "product_reviews": "58",
        "ingredients": " -Five-Cera Complex: Supports the skin's natural barrier and prevents water loss.-Five Hyaluronic Acid Complex: Pulls moisture from the atmosphere to hydrate the skin’s top layer.-Natural Moisturizing Factor: Helps the skin retain moisture and addresses visible damage. Water/Eau, Glycerin, Cetyl Ethylhexanoate, Pentylene Glycol, Cetearyl Alcohol, Ceramide NP, Ceramide NS, Ceramide AP, Ceramide AS, Ceramide EOP, Cocos Nucifera (Coconut) Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Pelargonium Graveolens Flower Oil, Theobroma Cacao (Cocoa) Seed Extract, Melia Azadirachta Flower Extract, Melia Azadirachta Leaf Extract, Curcuma Longa (Turmeric) Root Extract, Ocimum Sanctum Leaf Extract, Salvia Ofﬁcinalis (Sage) Oil, Pogostemon Cablin Oil, Corallina Ofﬁcinalis Extract, Sodium Hyaluronate, Hydrolyzed Hyaluronic Acid, Hyaluronic Acid, Raspberry Ketone, Diisostearyl Malate, Cetearyl Glucoside, Glyceryl Stearate, Caprylyl Glycol, Tromethamine, Dipropylene Glycol, Hydrogenated Lecithin, Cetyl-PG Hydroxyethyl Palmitamide, Dextrin, Propanediol, Sodium Hyaluronate Crosspolymer, Hydrolyzed Glycosaminoglycans, Cholesterol, Benzyl Glycol, Ethylhexylglycerin, Carbomer, Xanthan Gum, Disodium EDTA. Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "7.3K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-premium-bb-tinted-moisturizer-with-niacinamide-spf-40-P505373",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:32:33",
        "product_name": "Premium BB Tinted Moisturizer with Niacinamide and SPF 40",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Natural finish - Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 1.35 fl. oz / 40 mL",
                "name": [
                    "Color: Deep Tan - Deep",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2676252"
            },
            {
                "swatch_group": "Natural finish - Standard size",
                "flag_label": null,
                "size": "Size 1.35 fl. oz / 40 mL",
                "name": [
                    "Color: Medium - Tan"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2676245"
            },
            {
                "swatch_group": "Natural finish - Standard size",
                "flag_label": null,
                "size": "Size 1.35 fl. oz / 40 mL",
                "name": [
                    "Color: Light Medium - Medium"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2676237"
            },
            {
                "swatch_group": "Natural finish - Standard size",
                "flag_label": null,
                "size": "Size 1.35 fl. oz / 40 mL",
                "name": [
                    "Color: Fair - Light"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2676260"
            }
        ],
        "rating": "width:85.68199999999999%",
        "product_reviews": "725",
        "ingredients": "-Glycerin: Rapidly moisturizes.-Mineral and Chemical Sunscreens: Provide UVA/UVB protection.-Niacinamide: Supports the skin barrier.Water/Aqua/Eau, Cyclopentasiloxane, Cyclohexasiloxane, Glycerin, PEG-10 Dimethicone, Talc, Hexyl Laurate, Dipropylene Glycol, C12-15 Alkyl Benzoate, Niacinamide, Diphenylsiloxy Phenyl Trimethicone, Disteardimonium Hectorite, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Citrus Limon (Lemon) Peel Oil, Citrus Aurantifolia (Lime) Oil, Pinus Sylvestris (Pine) Leaf Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Adenosine, Allantoin, Ethylhexylglycerin, Trihydroxystearin, Polyglyceryl-6 Polyricinoleate, Methicone, Dimethicone,Dimethicone/Vinyl Dimethicone Crosspolymer, 1,2-Hexanediol, Triethoxycaprylylsilane, Magnesium Sulfate, Eucalyptus Globulus Leaf Oil, Limonene, Tocopherol, BHT, Phenoxyethanol, Titanium Dioxide (CI 77891), Iron Oxides (CI 77492), Iron Oxides (CI 77491), Iron Oxides (CI 77499).",
        "n_loves": "7.8K",
        "categories": [
            "Makeup",
            "Face",
            "BB & CC Cream"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/mini-ceramidin-tm-skin-barrier-moisturizing-cream-P506727",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:32:49",
        "product_name": "Mini Ceramidin™ Skin Barrier Moisturizing Cream",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 0.5 oz / 15 ml",
                    "NEW"
                ],
                "price": [
                    "$27.00"
                ],
                "sku": "Item 2692234"
            }
        ],
        "rating": "width:86.976%",
        "product_reviews": "559",
        "ingredients": "Unknown Ingredients",
        "n_loves": "2.3K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cicapair-tiger-grass-calming-gel-cream-P448185",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:33:00",
        "product_name": "Cicapair™ Tiger Grass Calming Gel Cream Moisturizer for Redness",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.69 oz/ 50 mL"
                ],
                "price": [
                    "$67.50"
                ],
                "sku": "Item 2267821"
            }
        ],
        "rating": "width:89.89200000000001%",
        "product_reviews": "651",
        "ingredients": "-Tiger Grass: Is an herbal remedy that tigers roll around in to care for their wounds.-Niacinamide: Supports the skin barrier by retaining moisture-Glycerin: Delivers replenishing moisture to skin. Water, Butylene Glycol, Glycerin, Niacinamide, Caprylyl Methicone, Pentylene Glycol, 1,2-Hexanediol, Eryngium Maritimum Callus Culture Filtrate, Cetearyl Olivate, Houttuynia Cordata Extract, Hydrogenated Polydecene, Ilex Aquifolium (Holly) Leaf Extract, Sorbitan Olivate, Dimethicone/Vinyl Dimethicone Crosspolymer, Streptococcus Thermophilus Ferment, Achillea Millefolium Oil, Ammonium Acryloyldimethyltaurate/VP Copolymer, Hydroxyacetophenone, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Carbomer, Tromethamine, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Adenosine, DNA, Lavandula Angustifolia (Lavender) Oil, Disodium EDTA, Silica, Coccinia Indica Fruit Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Hydrolyzed Hibiscus Esculentus Extract, Lupinus Albus Seed Extract, Moringa Oleifera Seed Extract, Panthenol, Hedera Helix (Ivy) Extract, Amber Powder, Solanum Melongena (Eggplant) Fruit Extract, Ethylhexylglycerin, Curcuma Longa (Turmeric) Root Extract, Ocimum Sanctum Leaf Extract, Corallina Officinalis Extract, Moringa Oleifera Seed Oil, Madecassoside, Calcium Chloride, Asiatic Acid, Asiaticoside, Magnesium Sulfate, Madecassic Acid, Centella Asiatica Extract.",
        "n_loves": "37.3K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermask-water-jet-vital-hydra-solution-P397623",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:33:12",
        "product_name": "Dermask™ Water Jet Vital Hydra Solution™ Face Mask",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 1 Mask",
                "name": [],
                "price": [
                    "$9.50"
                ],
                "sku": "Item 1723881"
            }
        ],
        "rating": "width:90.648%",
        "product_reviews": "293",
        "ingredients": " -Aquaxyl: Derived from plant glucose; replenishes and protects vital moisture in your skin.\n-Xylitol: Hydrates and strengthens skin barrier by preventing water loss.\n-Oligo-hyaluronic Acid: Supports long-lasting moisturization.\n-Algae Extract: Supports natural collagen synthesis.\n\n Water, Glycerin, Butylene Glycol, Alcohol, Panthenol, Betaine, Xylitylglucoside, Anhydroxylitol, Xylitol, Hydrolyzed Hyaluronic Acid, Algae Extract, Laminaria Japonica Extract, Chlorphenesin, Hydroxyethylcellulose, Disodium EDTA, Xanthan Gum, PEG-60 Hydrogenated Castor Oil, Glycyrrhiza Glabra (Licorice) Root Extract, Zingiber Officinale (Ginger) Root Extract, Schizandra Chinensis Fruit Extract, Coptis Japonica Root Extract, Camellia Sinensis Leaf Extract, Caprylyl Glycol, 1,2-Hexanediol, Dipotassium Glycyrrhizate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Carbomer, Arginine, Citrus Grandis (Grapefruit) Seed Extract, Acorus Calamus Root Extract, Perilla Ocymoides Leaf Extract, Cyclopentasiloxane, Cyclohexasiloxane, PEG-10 Dimethicone/Vinyl Dimethicone Crosspolymer, Pelargonium Graveolens Flower Oil.\nPlease be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "43.5K",
        "categories": [
            "Skincare",
            "Masks",
            "Sheet Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/vital-hydra-solution-tm-hydro-plump-treatment-essence-with-hyaluronic-acid-P506799",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:33:24",
        "product_name": "Vital Hydra Solution™ Hydro Plump Treatment Essence with Hyaluronic Acid",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 5.07 oz / 150 ml",
                    "NEW"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2692226"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "-Hyaluronic Acid: Hydrates skin.-PENTAVITIN™: Supports skin’s barrier to hold in hydration.Water/Aqua/Eau, Glycerin, Methylpropanediol, Pentylene Glycol, 1,2-Hexanediol, Glyceryl Glucoside, Saccharide Isomerate, Polyglycerin-3, Sodium Hyaluronate, Hydrolyzed Vegetable Protein, Ethylhexylglycerin, Allantoin, Citric Acid, Xanthan Gum, Maltodextrin, Sodium Citrate.",
        "n_loves": "1.7K",
        "categories": [
            "Skincare",
            "Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/mask-variety-pack-P505912",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:33:37",
        "product_name": "Mask Variety Pack",
        "brand_name": "Dr. Jart+",
        "options": [],
        "rating": "width:84.00000000000001%",
        "product_reviews": "5",
        "ingredients": "-Ceramide NP: Strengthens the skin barrier.-Panthenol: Increases water retention.-Niacinamide: Visibly brightens skin.Dr.Jart+ Dermask Water Jet Vital Hydra Solution:Water/Eau, Glycerin, Butylene Glycol, Alcohol, Panthenol, Betaine, Xylitylglucoside, Anhydroxylitol, Xylitol, Hydrolyzed Hyaluronic Acid, Algae Extract, Laminaria Japonica Extract, Chlorphenesin, Hydroxyethylcellulose, Disodium Edta, Xanthan Gum, Peg-60 Hydrogenated Castor Oil, Glycyrrhiza Glabra (Licorice) Root Extract, Zingiber Officinale (Ginger) Root Extract, Schizandra Chinensis Fruit Extract, Coptis Japonica Root Extract, Camellia Sinensis Leaf Extract, Caprylyl Glycol, 1,2-Hexanediol, Dipotassium Glycyrrhizate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Carbomer, Arginine, Citrus Grandis (Grapefruit) Seed Extract, Acorus Calamus Root Extract, Perilla Ocymoides Leaf Extract, Cyclopentasiloxane, Cyclohexasiloxane, Peg-10 Dimethicone/Vinyl Dimethicone Crosspolymer, Pelargonium Graveolens Flower Oil. *Aquaxyl Xylitylglucoside, Anhydroxylitol, Xylitol.*Super Vital Complex Hydrolyzed Hyaluronic Acid, Algae Extract, Laminaria Japonica Extract.Dr.Jart+ Dermask Micro Jet Brightening Solution: Water/Eau, Caprylic/Capric Triglyceride, Glycerin, Niacinamide, Dipropylene Glycol, Calcium Pantothenate, Sodium Ascorbyl Phosphate, Tocopheryl Acetate, Pyridoxine Hcl, Maltodextrin, Sodium Starch Octenylsuccinate, Silica, Glutathione, Bisabolol, Sodium Hyaluronate, Tromethamine, Stearic Acid, Lavandula Angustifolia (Lavender) Oil, Eucalyptus Globulus Leaf Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Limon (Lemon) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Trehalose, Carbomer, Glyceryl Stearate, Hydroxyethylcellulose, Polysorbate 60, Ethylhexylglycerin, Cetearyl Alcohol, Sorbitan Sesquioleate, Allantoin, Phenoxyethanol, Disodium Edta. *Brightening Solution Complex Niacinamide, Bisabolol.Dr.Jart+ Dermask Micro Jet Clearing Solution:Water/Eau, Glycerin, Niacinamide, Glycereth-26, Calcium Pantothenate, Sodium Ascorbyl Phosphate, Tocopheryl Acetate, Pyridoxine Hcl, Maltodextrin, Sodium Starch Octenylsuccinate, Silica, Glutathione, Betaine, Sodium Hyaluronate, Butylene Glycol, Salicylic Acid, Tromethamine, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Xanthan Gum, Hydroxyethyl Urea, Erythritol, Peg-14m, Peg/Ppg-17/6 Copolymer, Peg-60 Hydrogenated Castor Oil, Trehalose, Carbomer, Ethylhexylglycerin, Allantoin, Phenoxyethanol, Disodium Edta. Clearing Solution Complex Niacinamide, Melaleuca Alternifolia (Tea Tree) Leaf Oil.                                                                                                      Dr.Jart+ Ceramidin Skin Barrier Moisturizing Mask:Water/Aqua/Eau, Glycerin, Dipropylene Glycol, 1,2-Hexanediol, Panthenol, Hydrogenated Poly (C6-14 Olefin), Dicaprylyl Carbonate, Betaine, Methyl Trimethicone, Ceramide Np, Sodium Stearoyl Glutamate, Polyglyceryl-10 Stearate, Allantoin, Ethylhexylglycerin, Cholesterol, Pelargonium Graveolens (Geranium) Flower Oil, Olea Europaea (Olive) Fruit Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Cetearyl Alcohol, Behenyl Alcohol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Hydrogenated Lecithin, Tromethamine, Glyceryl Stearate Se, Salvia Officinalis (Sage) Oil, Sodium Phytate, Tocopherol, Yellow 5 (Ci 19140).",
        "n_loves": "8.2K",
        "categories": [
            "Skincare",
            "Masks",
            "Sheet Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cicapair-tiger-grass-calming-mist-P448184",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:33:47",
        "product_name": "Cicapair™ Tiger Grass Calming Mist",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.69 oz/ 50 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2265916"
            }
        ],
        "rating": "width:88.592%",
        "product_reviews": "561",
        "ingredients": " -Jartbiome: Helps strengthen, balance, and improve skin’s defenses against irritation and damage.  -Centella Rx: Soothes and protects sensitive skin.-Cicabond: Helps care for and rebuild damaged skin resulting from external stressors. Water, Dipropylene Glycol, Butylene Glycol, Eryngium Maritimum Callus Culture Filtrate, Niacinamide, Pentylene Glycol, Houttuynia Cordata Extract, Ilex Aquifolium (Holly) Leaf Extract, Achillea Millefolium Oil, 1,2-Hexanediol, Erythritol, Chondrus Crispus Extract, C12-14 Pareth-12, Saccharum Officinarum (Sugarcane) Extract/Extrait de canne à sucre, Streptococcus Thermophilus Ferment, Panthenol, Caprylyl Glycol, Ethylhexylglycerin, Lavandula Angustifolia (Lavender) Oil, Adenosine, Glycerin, DNA, Diphenyl Dimethicone, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Carbomer, Triethylhexanoin, Tromethamine, Disodium EDTA, Melia Azadirachta Leaf Extract, Hydrogenated Lecithin, Hedera Helix (Ivy) Extract, Melia Azadirachta Flower Extract, Madecassoside, Asiatic Acid, Asiaticoside, Madecassic Acid, Calcium Chloride, Centella Asiatica Extract, Magnesium Sulfate.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "25.6K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Mists & Essences"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermask-micro-jet-clearing-solution-P397624",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:33:59",
        "product_name": "Dermask Micro Jet Clearing Solution™",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 1 Mask",
                "name": [],
                "price": [
                    "$12.50"
                ],
                "sku": "Item 1723832"
            }
        ],
        "rating": "width:89.184%",
        "product_reviews": "331",
        "ingredients": "-Glutathione: Contains antioxidant properties and visibly brightens skin. -Niacinamide: Visibly brightens complexion. -Salicylic Acid and Tea Tree Leaf Oil: Absorbs excess oil.WATER\\AQUA\\EAU, GLYCERIN, NIACINAMIDE, GLYCERETH-26, ME[1]LALEUCA ALTERNIFOLIA (TEA TREE) LEAF OIL, BUTYLENE GLYCOL, SODIUM HYALURONATE, ALLANTOIN, BETAINE, TREHALOSE, SALI[1]CYLIC ACID, PYRIDOXINE HCL, ETHYLHEXYLGLYCERIN, CALCIUM PANTOTHENATE, PEG-14M, PEG/PPG-17/6 COPOLYMER, SILICA, PEG-60 HYDROGENATED CASTOR OIL, XANTHAN GUM, CARBOMER, HYDROXYETHYL UREA, ERYTHRITOL, TROMETHAMINE, SODIUM STARCH OCTENYLSUCCINATE,MALTODEXTRIN,SODIUMASCORBYL PHOSPHATE, TOCOPHERYL ACETATE, GLUTATHIONE, DISODIUM EDTA, PHENOXYETHANOLPlease be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "38.8K",
        "categories": [
            "Skincare",
            "Masks",
            "Sheet Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pore-remedy-tm-5-multi-acid-radiance-peel-P501031",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:34:11",
        "product_name": "Pore Remedy™ 5% Multi-Acid Radiance Peel Exfoliator",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz / 150 mL"
                ],
                "price": [
                    "$57.00"
                ],
                "sku": "Item 2609519"
            }
        ],
        "rating": "width:90.848%",
        "product_reviews": "118",
        "ingredients": "-AHA and BHA Multi-Acid Complex: Dissolves dead skin cells that cause dullness and enlarged-looking pores.Water\\Aqua\\Eau, C9-12 Alkane, Butylene Glycol, Glycerin, Citric Acid, Sodium Hydroxide, Lactic Acid, Helianthus Annuus (Sunflower) Seed Oil, Tartaric Acid, Isononyl Isononanoate, Lactobacillus Ferment, Algae Extract, Honey\\Mel\\Miel, Caffeine, Camellia Sinensis (Green Tea) Leaf Extract, Curcuma Longa (Turmeric) Root Extract, Chamomilla Recutita (Matricaria) Extract, Laminaria Saccharina Extract, Panthenol, Sodium Hyaluronate, Xanthan Gum, Carbomer, Salicylic Acid, Di-C12-18 Alkyl Dimonium Chloride, Hydrogenated Lecithin, Laureth-4, Glycine, Serine, Glutamic Acid, Aspartic Acid, Leucine, Alanine, Tyrosine, Arginine, Lysine, Proline, Phenylalanine, Threonine, Isoleucine, Valine, Histidine, Fragrance (Parfum), Limonene, Citronellol, Geraniol, Linalool, Citral, Disodium Edta, Sodium Citrate, Tocopheryl Acetate, Bht, PhenoxyethaNol, Potassium Sorbate. Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "8.6K",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cryo-rubber-tm-face-mask-with-brightening-vitamin-c-P506797",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:34:27",
        "product_name": "Cryo Rubber™ Face Mask With Brightening Vitamin C",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.14 oz / 4 g"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 2344497"
            }
        ],
        "rating": "width:86.34600000000002%",
        "product_reviews": "583",
        "ingredients": "-Niacinamide and Vitamin C Step 01: Water/Eau, Dipropylene Glycol, Glycerin, Caprylic/Capric Triglyceride, Niacinamide, Butylene Glycol, 1,2-Hexanediol, PEG-240/HDI Copolymer Bis-Decyltetradeceth-20 Ether, Glyceryl Stearate, PEG-100 Stearate, Dimethicone, Glycereth-26, Sorbitan Ses-Quioleate, Cetearyl Alcohol, Macadamia Ternifolia Seed Oil, Mangifera Indica (Mango) Seed Butter, 3-O- Ethyl Ascorbic Acid*, Trehalose, Glyceryl Acrylate/Acrylic Acid Copolymer, Disodium EDTA, Betaine, Ethyl- Hexylglycerin, Curcuma Longa (Turmeric) Root Extract, Melia Azadirachta Flower Extract, Melia Azadirachta Leaf Extract, Melia Azadirachta Bark Extract, Corallina Of?Cinalis Extract, Ocimum Sanctum Leaf Extract, Moringa Oleifera Seed Oil, Potassium Laurate, Tocopherol, Asparagus Of?Cinalis Extract, Cynara Scolymus (Artichoke) Leaf Extract, Brassica Oleracea Capitata (Cabbage) Leaf Extract, Allium Cepa (Onion) Bulb Extract, Undaria Pinnati?Da Extract, Musa Sapientum (Banana) Fruit Extract.Step 02: Water/Eau, Methylpropanediol, Chondrus Crispus Extract, Glycerin, Xanthan Gum, Ceratonia Siliqua (Carob) Gum, Potassium Chloride, Dipropylene Glycol, Hydroxya- Cetophenone, Butylene Glycol, Sucrose, Panthenol, Polyglyceryl-10 Laurate, Algin, Titanium Dioxide/CI 77891, Caprylyl Glycol, Allantoin, Calcium Chloride, Dipotassium Glycyrrhizate, Ethylhexylglycerin, Disodium EDTA, Sodium Citrate, Coptis Japonica Root Extract, Hippophae Rhamnoides Fruit Extract**, Citric Acid, Xylitylglucoside, Anhydroxylitol, Xylitol, Hydrogen Dimethicone, Glucose, Kaolin, Diatomaceous Earth/Terre De Diatomees.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "1.1K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-teatreement-moisturizer-P454019",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:34:41",
        "product_name": "Teatreement™ Moisturizer",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.69 oz/ 50 mL"
                ],
                "price": [
                    "$47.50"
                ],
                "sku": "Item 2300275"
            }
        ],
        "rating": "width:84.928%",
        "product_reviews": "625",
        "ingredients": " -Teatreement™ Solution (Tea Tree Leaf Extract, Tea Tree Leaf Oil, 4-Terpineol): Removes impurities and supports skin's pH balance.-Green Calming Complex (Green Tea Extract, Aloe Vera Leaf Extract, Chamomile Flower Extract, Pinus Pinaster Bark Extract): Soothes and hydrates. Melaleuca Alternifolia (Tea Tree) Leaf Extract, Glycerin, Ethylhexyl Stearate, Methylpropanediol, Niacinamide, Trehalose, Methyl Trimethicone, Cetearyl Glucoside, Sorbitan Olivate, 1,2-Hexanediol, Water/Eau, Cetearyl Alcohol, Xanthan Gum, Centella Asiatica Extract, Ficus Carica (Fig) Fruit Extract, Eclipta Prostrata Leaf Extract, Laminaria Japonica Extract, Gloiopeltis Furcata Extract, Allantoin, Aloe Barbadensis Leaf Extract, Anthemis Nobilis Flower Extract, Butylene Glycol, Camellia Sinensis Leaf Extract, Carthamus Tinctorius (Safflower) Seed Oil, Ethylhexylglycerin, Glycyrrhiza Glabra (Licorice) Rhizome/Root, Hamamelis Virginiana (Witch Hazel) Extract, Melaleuca Alternifolia (tea Tree) Leaf Oil, Amaranthus Caudatus Seed Extract, Ulmus Davidiana Root Extract, Cinnamomum Zeylanicum Bark Extract, Pinus Pinaster Bark Extract, Hydrogenated Lecithin, Sodium Polyacryloyldimethyl Taurate, Sorbitan Stearate, Caprylic/Capric Triglyceride, Glycine Soja (Soybean) Sterols, Linoleic Acid, Phospholipids, Disodium EDTA, Fructooligosacchadrides, Salicylic Acid, Beta-Glucan, Hydrolyzed Hyaluronic Acid, Capryloyl Glycine, Ceramide NP, Hexylene Glycol, Camphor Silica, Sarcosine, 4-Terpineol, Methyl Methacrylate Crosspolymer.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "15.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cicapair-redness-rescue-kit-P500722",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:34:53",
        "product_name": "Cicapair™ Redness Rescue Kit",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [],
                "price": [
                    "$52.00"
                ],
                "sku": "Item 2606895"
            }
        ],
        "rating": "width:68.182%",
        "product_reviews": "22",
        "ingredients": "Cicapair™ Tiger Grass Serum:Water/Eau, Dipropylene Glycol, Glycerin, Butylene Glycol, Propanediol, Eryngium Maritimum Callus Culture Filtrate, 1,2-Hexanediol, Niacinamide, Houttuynia Cordata Extract, Ilex Aquifolium (Holly) Leaf Extract, Achillea Millefolium Oil, Panthenol, Chondrus Crispus Extract, C12-14 Pareth-12, Saccharum Officinarum (Sugarcane) Extract, Streptococcus Thermophilus Ferment, Carbomer, Tromethamine, Madecassoside, Melia Azadirachta Leaf Extract, Xanthan Gum, Ethylhexylglycerin, Adenosine, Lavandula Angustifolia (Lavender) Oil, DNA, Disodium EDTA, Melia Azadirachta Flower Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Asiaticoside, Dextrin, Theobroma Cacao (Cocoa) Extract, Centella Asiatica Leaf Extract, Hedera Helix (Ivy) Extract, Asiatic Acid, Madecassic Acid, Calcium Chloride, Centella Asiatica Extract, Magnesium Sulfate.Cicapair™ Tiger Grass Cream:Water/Eau, Butylene Glycol, Propanediol, Caprylic/Capric Triglyceride, Cetearyl Alcohol, Hydrogenated Poly(C6-14 Olefin), Cetyl Ethylhexanoate, Polyglyceryl-3 Methylglucose Distearate, Butyrospermum Parkii (Shea) Butter, Niacinamide, Vinyl Dimethicone, Macadamia Integrifolia Seed Oil, Glyceryl Stearate, Pentylene Glycol, 1,2-Hexanediol, Diisostearyl Malate, Eryngium Maritimum Callus Culture Filtrate, Hydrogenated Vegetable Oil, Polymethylsilsesquioxane, Beeswax, Cetearyl Olivate, Sorbitan Olivate, Madecassoside, Houttuynia Cordata Extract, Ilex Aquifolium (Holly) Leaf Extract, Streptococcus Thermophilus Ferment, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Achillea Millefolium Oil, Hydroxyacetophenone, Palmitic Acid, Stearic Acid, Lavandula Angustifolia (Lavender) Oil, Sodium Polyacryloyldimethyl Taurate, Carbomer, Xanthan Gum, Hydrogenated Polydecene, Tromethamine, Caramel, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Melia Azadirachta Leaf Extract, DNA, Melia Azadirachta Flower Extract, Adenosine, Sorbitan Isostearate, Asiaticoside, Disodium EDTA, Centella Asiatica Leaf Extract, Hedera Helix (Ivy) Extract, Coccinia Indica Fruit Extract, Trideceth-10, Panthenol, Amber Powder, Solanum Melongena (Eggplant) Fruit Extract, Ethylhexylglycerin, Curcuma Longa (Turmeric) Root Extract, Ocimum Sanctum Leaf Extract, Corallina Officinalis Extract, Moringa Oleifera Seed Oil, Tocopherol, Calcium Chloride, Magnesium Sulfate, Asiatic Acid, Madecassic Acid, Centella Asiatica Extract.Cicapair™ Tiger Grass Color Correcting Treatment SPF 30:Water, Centella Asiatica Leaf Water, Isononyl Isononanoate, Caprylic/Capric Triglyceride, Isotridecyl Isononanoate, Methylpropanediol, BIS-Hydroxyethoxypropyl Dimethicone, Methyl Methacrylate Crosspolymer, Butyloctyl Salicylate, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Beeswax, Lauryl Polyglyceryl-3 Polydimethylsiloxyethyl Dimethicone, Glycerin, Niacinamide, Disteardimonium Hectorite, Magnesium Sulfate, Polyme- thylsilsesquioxane, Iron Oxides (CI 77492), Triethoxycaprylylsilane, Caprylyl Glycol, Chromium Oxide Greens, Synthetic Fluorphlogopite, Iron Oxides (CI 77491), Glyceryl Caprylate, Zein, Lavandula Angustifolia (Lavender) Oil, Ethylhexylglycerin, Citrus Paradisi (Grapefruit) Peel Oil, Silica Dimethyl Silylate, Rosmarinus Officinalis (Rosemary) Leaf Oil, Aluminum Hydroxide, Adenosine, Zea Mays (Corn) Starch, Helianthus Annuus (Sunflower) Seed Oil, Hydrogenated Lecithin, Anthemis Nobilis Flower Oil, Tocopherol, Dipotassium Phosphate, Madecassoside, Sodium Chloride, Calcium Stearate, Butylene Glycol, Panthenol, Houttuynia Cordata Extract, Aniba Rosodora (Rosewood) Wood Oil, Gossypium Herbaceum (Cotton) Extract, Alcohol, Centella Asiatica Meristem Cell Culture, Anastatica Hierochuntica Extract, 1,2-Hexanediol, Pentylene Glycol, Magnesium Aspartate, Zinc Gluconate, Arnica Montana Flower Extract, Lecithin, Brassica Campestris (Rapeseed) Sterols, Gentiana Lutea Root Extract, Achillea Millefolium Extract, Artemisia Absinthium Extract, Leuconostoc/Radish Root Ferment Filtrate, Sucrose Laurate, Polyglyceryl-2 Caprate, Centella Asiatica Extract, Fragaria Vesca (Strawberry) Fruit Extract, Phenoxyethanol, Gluconolactone, Lysolecithin, Ceramide NP, Copper Gluconate, Sodium Benzoate, Sodium Ascorbyl Phosphate, Xanthan Gum, Potassium Sorbate, Disodium EDTA, Madecassic Acid, Asiaticoside, Asiatic Acid.",
        "n_loves": "8.7K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-ceramidin-tm-skin-barrier-serum-toner-P504001",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:35:07",
        "product_name": "Ceramidin™ Skin Barrier Serum Toner",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.07 oz / 150 mL"
                ],
                "price": [
                    "$53.00"
                ],
                "sku": "Item 2640639"
            }
        ],
        "rating": "width:92.39200000000001%",
        "product_reviews": "397",
        "ingredients": "-Ceramide NP: Supports the skin barrier.-Panthenol: Moisturizes and nourishes skin’s barrier to prevent water loss.Water/Aqua/Eau, Dipropylene Glycol, Betaine, Propanediol, Alcohol Denat., Glycosyl Trehalose, Glycerin, 1,2-Hexanediol, Panthenol, Pentylene Glycol, Erythritol, Hydrogenated Starch Hydrolysate, Triethylhexanoin, Diphenyl Dimethicone, Polyglyceryl-10 Myristate, Ceramide Np, Sucrose Distearate, Ethylhexylglycerin, Sodium Hyaluronate, Theobroma Cacao (Cocoa) Seed Extract, Pelargonium Graveolens Flower Oil, Olea Europaea (Olive) Fruit Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, C12-14 Pareth-12, Hydrogenated Lecithin, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Tromethamine, Carbomer, Glyceryl Polymethacrylate, Glyceryl Stearate, Dextrin, Salvia Officinalis (Sage) Oil, Citronellol, Disodium Edta, Yellow 5 (Ci 19140).",
        "n_loves": "13.2K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-teatreement-toner-P454085",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:35:20",
        "product_name": "Teatreement™ Toner",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.05 oz/ 120 mL"
                ],
                "price": [
                    "$40.50"
                ],
                "sku": "Item 2300267"
            }
        ],
        "rating": "width:85.16999999999999%",
        "product_reviews": "472",
        "ingredients": " -Teatreement™ Solution (Tea Tree Leaf Extract, Tea Tree Leaf Oil, 4-Terpineol): Targets problematic areas and supports skin’s pH balance. -Green Calming Complex (Green Tea Extract, Aloe Vera Leaf Extract, Chamomile Flower Extract, Pinus Pinaster Bark Extract): Soothes and hydrates. Anthemis Nobilis Flower Extract, Camellia Sinesis Leaf Extract,Glycyrrhiza Glabra (Licorice) Rhizome/Root, Hamamelis Virginiana (Witch Hazel) Extract, Sodium Citrate, Cinnamomum Zelanicum Bark Extract, Pinus Pinaster Bark Extract, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Ethylhexylglycerin, Citric Acid, Disodium EDTA, Hydrogenated Lecithin, Capryloyl Glycine, Hexylene Glycol, Octylododeceth-16, Allantoin, Sarcosine, Ceramide NP, Camphor, Carthamus Tinctorius (Sunflower) Seed Oil, 1,2-Hexanediol, Silica, Glycine Soja (Soybean) Sterols, Linoleic Acid, Phospholipids, 4-Terpineol, Methyl Methacrylate Crosspolymer, Salicylic Acid.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "8K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-pore-remedy-trade-pha-exfoliating-serum-P479632",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:35:31",
        "product_name": "Pore Remedy™ PHA Exfoliating Serum",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2531374"
            }
        ],
        "rating": "width:83.42599999999999%",
        "product_reviews": "432",
        "ingredients": "-7% PHA: Helps resurface skin and remove dead skin cells and the appearance of pore-clogging buildup. -Panthenol: Soothes skin with moisture.-Macadamia Seed Oil: Helps control sebum without clogging pores.Water/Aqua/Eau, Macadamia Integrifolia Seed Oil, Gluconolactone, Propanediol, Alcohol Denat., Panthenol, 1,2-Hexanediol, Tromethamine, Butylene Glycol, Ethylhexylglycerin, Adenosine, Pantolactone, Glycoproteins, Mentha Viridis (Spearmint) Leaf Oil, Mentha Piperita (Peppermint) Oil, Eucalyptus Globulus Leaf Oil, Limonene, Disodium Edta .",
        "n_loves": "18.9K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermask-micro-jet-brightening-solution-P397625",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:35:46",
        "product_name": "Dermask Micro Jet Brightening Solution™",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 1 Mask",
                "name": [],
                "price": [
                    "$12.50"
                ],
                "sku": "Item 1723840"
            }
        ],
        "rating": "width:81.126%",
        "product_reviews": "71",
        "ingredients": "-Glutathione: Contains antioxidant properties and brightens complexion. -Niacinamide: Brightens the complexion. -a-Bisabolol: Derived from a natural plant to promote melanin production and brighten skin. WATER\\AQUA\\EAU, CAPRYLIC/CAPRIC TRIGLYCERIDE, GLYCERIN, NIACINAMIDE, DIPROPYLENE GLYCOL, SODIUM HYALURONATE, \nALLANTOIN, ETHYLHEXYLGLYCERIN, TREHALOSE, BISABOLOL, CALCIUM PANTOTHENATE, PYRIDOXINE HCL, CITRUS AURANTIUM DULCIS (ORANGE) PEEL OIL, CITRUS GRANDIS (GRAPEFRUIT) PEEL OIL, CITRUS LIMON (LEMON) PEEL OIL, ROSMARINUS OFFICINALIS (ROSEMARY) LEAF OIL, CITRUS AURANTIUM BERGAMIA (BERGAMOT) FRUIT OIL, LAVANDULA ANGUSTIFOLIA (LAVENDER) OIL, SILICA,  MALTODEXTRIN, SODIUM STARCH OCTENYLSUCCINATE, CARBOMER, HYDROXYETHYLCELLULOSE, SORBITAN SESQUIOLEATE,  POLYSORBATE 60,STEARIC ACID, GLYCERYL STEARATE, CETEARYL \nALCOHOL, TROMETHAMINE, EUCALYPTUS GLOBULUS LEAF OIL,  TOCOPHERYL ACETATE, SODIUM ASCORBYL PHOSPHATE, GLUT[1]ATHIONE, DISODIUM EDTA, PHENOXYETHANOLPlease be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "17.6K",
        "categories": [
            "Skincare",
            "Masks",
            "Sheet Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cryo-rubber-tm-face-mask-with-soothing-allantoin-P506790",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:35:58",
        "product_name": "Cryo Rubber™ Face Mask With Soothing Allantoin",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.14 oz / 4 g"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 2344596"
            }
        ],
        "rating": "width:86.34600000000002%",
        "product_reviews": "583",
        "ingredients": "-A Complex with Allantoin: Visibly calms sensitized skin with soothing moisture.Step 01: Allantoin Ampoule Pack Water/Eau, Dipropylene Glycol, Glycerin, Caprylic/Capric Triglyceride, Niacinamide, Butylene Glycol, 1,2-Hexanediol, PEG-240/HDI Copolymer Bis-Decyltetradeceth-20 Ether, Glyceryl Stearate, PEG-100 Stearate, Glycereth-26, Dimethicone, Sorbitan Sesquioleate, Cetearyl Alcohol, Macadamia Ternifolia Seed Oil, Mangifera Indica (Mango) Seed Butter, Allantoin, Trehalose, Glyceryl Acrylate/Acrylic Acid Copolymer, Disodium EDTA, Ethylhexylglycerin, Betaine, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Potassium Laurate, Tocopherol, Brassica Oleracea Capitata (Cabbage) Leaf Extract, Allium Cepa (Onion) Bulb Extract, Asparagus Of Cinalis Extract, Cynara Scolymus (Artichoke) Leaf Extract, Undaria Pinnati?Da Extract, Musa Sapientum (Banana) Fruit Extract.Step 02: Water/Eau, Methylpropanediol, Chondrus Crispus Extract, Gl- Ycerin, Xanthan Gum, Ceratonia Siliqua (Carob) Gum, Potassium Chloride, Dipropylene Glycol, Hydroxy- Acetophenone, Sucrose, Panthenol, Polyglyceryl-10 Laurate, Algin, Titanium Dioxide/CI 77891, Caprylyl Glycol, Melia Azadirachta Leaf Extract, Allantoin, Calcium Chloride, Melia Azadirachta Flower Extract, Dipotassium Glycyrr- Hizate, Coccinia Indica Fruit Extract, Ethylhexylglycerin, Disodium EDTA, Sodium Citrate, Solanum Melongena (Eggplant) Fruit Extract, Aloe Barbadensis Flower Extract, Citric Acid, Ocimum Sanctum Leaf Extract, Xylitylg- Lucoside, 1,2-Hexanediol, Anhydroxylitol, Curcuma Longa (Turmeric) Root Extract, Corallina Of?Cinalis Extract, Xylitol, Centella Asiatica Extract*, Hydrogen Dimethicone, Glucose, Kaolin, Diatomaceous Earth/Terre De DiatomeesPlease be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "755",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-pore-remedy-trade-purifying-mud-mask-P479633",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:36:09",
        "product_name": "Pore Remedy™ Purifying Mud Face Mask",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.45 oz/ 13 g"
                ],
                "price": [
                    "$12.50"
                ],
                "sku": "Item 2531382"
            }
        ],
        "rating": "width:83.598%",
        "product_reviews": "328",
        "ingredients": "-Green Mud: Helps to visibly remove buildup, blackheads, and excess oil without dehydrating skin.-Sea Salt: Helps to gently exfoliate dead skin cells for smoother skin texture.Water/Aqua/Eau, Kaolin, Butylene Gycol, Bentonite, Polysorbate 80, 1,2-Hexanediol, Magnesium Aluminum Silicate, Sea Salt/Maris Sal/Sel Marin, Montmorillonite, Allantoin, Artemisia Vulgaris (Mugwort) Oil, Gycerin, Ethylhexylglycerin, Arginine, Glyoproteins, Copper Tripeptide-1, Polygylyceryl-10 Laurate, Illite, Stearic Acid, Panthenol, Lecithin, Citric Acid, Myristic Acid, Gluconolactone, Disodium Edta, Sodium Citrate, Tocopherol, Blue 1 (Ci 42090), Yellow 5 (Ci 19140).",
        "n_loves": "22.9K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-ceramidin-tm-cream-infused-mask-P504064",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:36:21",
        "product_name": "Ceramidin™ Cream-Infused Mask",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 Mask / 1 Mask"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 2640654"
            }
        ],
        "rating": "width:92.82999999999998%",
        "product_reviews": "371",
        "ingredients": "-Ceramide NP: Moisturizes and supports the skin barrier.-Barrier Comfort Complex™: Contains shea butter and argan oil to soften.Water/Aqua/Eau, Glycerin, Caprylic/Capric Triglyceride, Dipropylene Glycol, Butyrospermum Parkii (Shea) Butter, Butyrospermum Parkii (Shea) Butter Extract, 1,2-Hexanediol, Cetyl Alcohol, Hydrogenated Polydecene, Glyceryl Stearate, Behenyl Alcohol, Panthenol, Pentylene Glycol, Polyglyceryl-3 Methylglucose Distearate, Polyglyceryl-10 Laurate, Argania Spinosa Kernel Oil, Ceramide Np(0.2%), Theobroma Cacao (Cocoa) Seed Extract, Pelargonium Graveolens Flower Oil, Olea Europaea (Olive) Fruit Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Ethylhexylglycerin, Pentaerythrityl Distearate, Sodium Polyacryloyldimethyl Taurate, Spent Grain Wax, Betaine, Sodium Stearoyl Glutamate, Dextrin, Salvia Officinalis (Sage) Oil, Citronellol, Disodium Edta, Tocopherol, Yellow 5 (Ci 19140).",
        "n_loves": "7.8K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-teatreement-cleansing-foam-P454086",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:36:33",
        "product_name": "Teatreement™ Cleansing Foam",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.05 oz/ 120 mL"
                ],
                "price": [
                    "$39.00"
                ],
                "sku": "Item 2300259"
            }
        ],
        "rating": "width:82.83%",
        "product_reviews": "509",
        "ingredients": " -Teatreement™ Solution (Tea Tree Leaf Extract, Tea Tree Leaf Oil, 4-Terpineol): Cleanses impurities and supports skin's pH balance.-Green Calming Complex (Green Tea Extract, Aloe Vera Leaf Extract, Chamomile Flower Extract, Pinus Pinaster Bark Extract): Soothes and hydrates. Melaleuca Alternifolia (Tea Tree) Leaf Extract, Water/Eau, Disodium Laureth Sulfosuccinate, Sodium Cocoyl Glutamate, Methylpropanediol, 1,2-Hexanediol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Salicylic Acid, Melaleuca Alternifolia (Tea Tree) Lead Oil, Centella Asiatica Extract, Ficus Carica (Fig) Fruit Extract, Polyglyceryl-10 Laurate, Anthemis Nobilis Flower Extract, Camellia Sinensis Leaf Extract, Glycyrrhiza Glabra (Licorice) Rhizome/Root, Amaranthus Caudatus Seed Extract, Ulmus Davidiana Root Extract, Hamamelis Virginiana (Witch Hazel) Extract, Undaria Pinnatifida Extract, Gloiopeltis Furcata Extract, Aloe Barbadensis Leaf Extract, Cinnamomum Zeylanicum Bark Extract, Pinus Pinaster Bark Extract, Butylene Glycol, Disodium EDTA, Hydrogenated Lecithin, Ceramide NP, Allantoin, Niacinamide, Silica, Capryloyl Glycine, Hexylene Glycol, Camphor, Sarcosine, 4-Terpineol, Methyl Methacrylate Crosspolymer.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "10.3K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-ceramidin-tm-skin-barrier-moisturizing-mask-P504042",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:36:44",
        "product_name": "Ceramidin™ Skin Barrier Moisturizing Mask",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.77 oz / 22 g"
                ],
                "price": [
                    "$12.50"
                ],
                "sku": "Item 2640647"
            }
        ],
        "rating": "width:93.436%",
        "product_reviews": "393",
        "ingredients": "-Ceramide NP: Supports the skin barrier.-Panthenol: Moisturizes and nourishes skin’s barrier to prevent water loss.-Glycerin: Moisturizes skin.Water/Aqua/Eau, Glycerin, Dipropylene Glycol, 1,2-Hexanediol, Panthenol, Hydrogenated Poly(C6-14 Olefin), Dicaprylyl Carbonate, Betaine, Methyl Trimethicone, Ceramide Np, Sodium Stearoyl Glutamate, Polyglyceryl-10 Stearate, Allantoin, Ethylhexylglycerin, Cholesterol, Pelargonium Graveolens (Geranium) Flower Oil, Olea Europaea (Olive) Fruit Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Cetearyl Alcohol, Behenyl Alcohol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Hydrogenated Lecithin, Tromethamine, Glyceryl Stearate Se, Salvia Officinalis (Sage) Oil, Sodium Phytate, Tocopherol, Yellow 5 (Ci 19140).",
        "n_loves": "17.5K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermask-intra-jet-wrinkless-solution-P397626",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:36:57",
        "product_name": "Dermask Intra Jet Wrinkless Solution™",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 1 Mask",
                "name": [
                    "Type: Dermask Intra Jet Wrinkless Solution™ - 1 mask"
                ],
                "price": [
                    "$12.50"
                ],
                "sku": "Item 1723865"
            }
        ],
        "rating": "width:71.212%",
        "product_reviews": "66",
        "ingredients": " -Bio-peptides: Support natural skin recovery.-Coenzyme Q10: Contains antioxidant properties to address environmental stressors.-Beta-glucan: Reduces the appearance of fine lines and wrinkles.  Water, Glycerin, 1,2-Hexanediol, Ceratonia Siliqua Gum, Chondrus Crispus Powder, PEG-60 Hydrogenated Castor Oil,Cetyl Ethylhexanoate, Phenyl Trimethicone, Allantoin, Butylene Glycol, Beta-Glucan, Agar, Dipotassium Glycyrrhizate, Adenosine, Disodium EDTA, Cupressus Sempervirens Leaf/Nut/Stem Oil, Potassium Hydroxide, Ubiquinone, Glyceryl Polymethacrylate, Propylene Glycol, Palmitoyl Oligopeptide.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "14.1K",
        "categories": [
            "Skincare",
            "Masks",
            "Sheet Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-ceramidin-eye-cream-P473828",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:37:09",
        "product_name": "Ceramidin ™ Eye Cream with Niacinamide",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.52 oz/ 15 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 2480861"
            }
        ],
        "rating": "width:90.8%",
        "product_reviews": "437",
        "ingredients": "-Ceramidin Complex: A blend of five ceramides that prevents water loss and visibly plumps skin with moisture. -Niacinamide: Supports ceramide production for improved moisture. Water/Eau, Glycerin, Betaine, Cyclohexasiloxane, Squalane, Pentaerythrityl Distearate, Methylpropanediol, Niacinamide, Dicaprylyl Ether, Ammonium Acryloyldimethyltaurate/VP Copolymer, Cetearyl Glucoside, Cetearyl Alcohol, Panthenol, 1,2-Hexanediol, Sodium Stearoyl Glutamate, Ceramide NP, Dipropylene Glycol, Hydroxyacetophenone, Mannitol, Zea Mays (Corn) Starch, Microcrystalline Cellulose, Ethylhexylglycerin, Pelargonium Graveolens Flower Oil, Hydrogenated Lecithin, Allantoin, Adenosine, Dextrin, Theobroma Cacao (Cocoa) Seed Extract, Disodium EDTA, Pyrus Malus (Apple) Fruit Extract, Salvia Officinalis (Sage) Oil, Gardenia Florida Fruit Extract, Pogostemon Cablin Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Tocopherol, Glyceryl Stearate, Ceramide AP, Cholesterol, Ceramide AS, Ceramide NS, Ceramide EOP.",
        "n_loves": "23K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-cicapair-tiger-grass-sleepair-intensive-mask-P467615",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:37:22",
        "product_name": "Cicapair™ Tiger Grass Sleepair Intensive Night Mask",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.38 oz/ 100 mL"
                ],
                "price": [
                    "$57.00"
                ],
                "sku": "Item 2425874"
            }
        ],
        "rating": "width:90.642%",
        "product_reviews": "763",
        "ingredients": "-Dr.Jart+ Green Repair Solution: Containing Centella asiatica and a blend of herbs, minerals, a moisturizing humectant, and a probiotic ferment, this solution soothes skin with moisture. Water/Eau, Dipropylene Glycol, Propanediol, Glycerin, Caprylyl Methicone, 1,2-Hexanedoil, Niacinamide, Trehalose, Vinyle Dimethicone, Butylene Glycol, Eryngium Maritimum Callus Culture Diltrate, Fusidium Coccineum Ferment Filtrate, Cetyl Dimethicone, Houttuynia Cordata Extract, Ilex Aquifolium (Holly) Leaf Extract, Diethiconol, Chondrus Crispus Extract, Achillea Millefolium Oil, Ammonium Acryloyldimethyltaurate/VP Copolymer, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Dehydroxanthan Gum, Polyvinyl Alcohol, Saccharum Officinarum (Sugarcane) Extract, Tromethamine, Caprylyl Glycol, Sodium Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Polyisobutene, Methylpropanedoil, Adenosine, Melisa Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Disodium EDTA, Caprylyl/Capryl Glucoside, Panthenol, Sorbitan Oleate, Bamboo Vinegar, Glycine Soja (Soybean) Peptide, Streptococcus Thermophilus Ferment, Madecassoside, Ethylhexlglycerin, Coccinia Indica Fruit Extract, Curcuma Longa (Tumeric) Root Extract, Ocimum Sanctum Leaf Extract, Amber Powder, Solanum Meaongena (Eggplant) Fruit Extract, Hedera Helix (Ivy) Extract, Dextrin, Theobroma Cacao (Cocoa) Seed Extract, Carallina Officinalis Extract, Moringa Olefiera Seed Oil, Asiaticoside, Centella Asiatica Leaf Extract, Asiatic Acid, Madecassic Acid, Calcium Chloride, Centella Asiatica Extract, Magnesium Sulfate.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "43.3K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/tiger-grass-re-pair-serum-P423259",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:37:34",
        "product_name": "Cicapair™ Tiger Grass Serum",
        "brand_name": "Dr. Jart+",
        "options": [],
        "rating": "width:85.136%",
        "product_reviews": "1.1K",
        "ingredients": "-Tiger Grass: Is an herbal remedy that tigers roll around in to care for their wounds. -Niacinamide: Supports the skin barrier by retaining moisture. -Glycerin: Delivers replenishing moisture to skin.Water/Eau, Dipropylene Glycol, Glycerin, Butylene Glycol, Propanediol, Eryngium Maritimum Callus Culture Filtrate, 1,2-Hexanediol, Niacinamide, Houttuynia Cordata Extract, Ilex Aquifolium (Holly) Leaf Extract, Achillea Millefolium Oil, Panthenol, Chondrus Crispus Extract, C12-14 Pareth-12, Saccharum Officinarum (Sugarcane) Extract/Extrait de canne à sucre, Streptococcus Thermophilus Ferment, Carbomer, Tromethamine, Madecassoside, Melia Azadirachta Leaf Extract, Xanthan Gum, Ethylhexylglycerin, Adenosine, Lavandula Angustifolia (Lavender) Oil, DNA, Disodium EDTA, Melia Azadirachta Flower Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Asiaticoside, Dextrin, Theobroma Cacao (Cocoa) Extract, Centella Asiatica Leaf Extract, Hedera Helix (Ivy) Extract, Asiatic Acid, Madecassic Acid, Calcium Chloride, Centella Asiatica Extract, Magnesium Sulfate.",
        "n_loves": "76.5K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermask-water-jet-soothing-hydra-solution-P397622",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:37:44",
        "product_name": "Dermask™ Water Jet Soothing Hydra Solution Face Mask",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 1 Mask",
                "name": [],
                "price": [
                    "$9.50"
                ],
                "sku": "Item 1723873"
            }
        ],
        "rating": "width:81.504%",
        "product_reviews": "133",
        "ingredients": " -Aquaxyl: Derived from plant glucose; replenishes and protects vital moisture.-Xylitol: Hydrates and supports natural barrier function to prevent water loss.-Aloe Vera: Moisturizes and contains soothing properties to help relieve the discomfort of acne and sun burns.-Phytoncide: Provides soothing effects. Water, Glycerin, Butylene Glycol, Alcohol, Panthenol, Betaine, Xylitylglucoside, Anhydroxylitol, Xylitol, Aloe Barbadensis Leaf Extract, Bambusa Vulgaris Extract, Pinus Densiflora Leaf Extract, Thuja Orientalis Extract, Chamaecyparis Obtusa Leaf Extract, Chlorphenesin, Hydroxyethylcellulose, Disodium EDTA, Xanthan Gum, PEG-60 Hydrogenated Castor Oil, Glycyrrhiza Glabra (Licorice) Root Extract, Zingiber Officinale (Ginger) Root Extract, Schizandra Chinensis Fruit Extract, Coptis Japonica Root Extract, Camellia Sinensis Leaf Extract, Caprylyl Glycol, 1,2-Hexanediol, Dipotassium Glycyrrhizate, Hydroxyethyl Acrylate/Sodium, Acryloyldimethyl Taurate Copolymer, Carbomer, Arginine, Citrus Grandis (Grapefruit) Seed Extract, Acorus Calamus Root Extract, Perilla Ocymoides Leaf Extract, Cyclopentasiloxane, Cyclohexasiloxane, PEG-10 Dimethicone/Vinyl Dimethicone Crosspolymer, Polyglutamic Acid, Methylpropanediol, Phenoxyethanol, Thymus Vulgaris (Thyme) Flower/Leaf Oil.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up-to-date list of ingredients.",
        "n_loves": "24.2K",
        "categories": [
            "Skincare",
            "Masks",
            "Sheet Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cryo-rubber-tm-face-mask-with-moisturizing-hyaluronic-acid-P506804",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:37:57",
        "product_name": "Cryo Rubber™ Face Mask With Moisturizing Hyaluronic Acid",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.14 oz / 4 g"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 2344513"
            }
        ],
        "rating": "width:86.34600000000002%",
        "product_reviews": "583",
        "ingredients": "-Hyaluronic Acid: Improves moisture retention.Step 01: Water/Eau, Dipropylene Glycol, Glycerin, Caprylic/Capric Triglyceride, Niacinamide, 1,2-Hexanediol, Butylene Glycol, Peg-240/Hdi Copolymer Bis-Decyltetradeceth-20 Ether, Glyceryl Stearate, Peg-100 Stearate, Sorbitan Sesquioleate, Glycereth-26, Dimethicone, Cetearyl Alcohol, Trehalose, Mangifera Indica (Mango) Seed Butter, Macadamia Ternifolia Seed Oil, Sodium Hyaluronate, Glyceryl Acrylate/Acrylic Acid Copolymer, Ethylhexylglycerin, Disodium Edta, Betaine, Allantoin, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Coccinia Indica Fruit Extract, Tocopherol, Potassium Laurate, Solanum Melongena (Eggplant) Fruit Extract, Aloe Barbadensis Flower Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Ocimum Sanctum Leaf Extract, Curcuma Longa (Turmeric) Root Extract, Corallina Of?Cinalis Extract, Undaria Pinnati?Da Extract, Musa Sapientum (Banana) Fruit Extract, Cynara Scolymus (Artichoke) Leaf Extract, Brassica Oleracea Capitata (Cabbage) Leaf Extract, Asparagus Of?Cinalis Extract, Allium Cepa (Onion) Bulb Extract.Step 02: Water/Eau, Methylpropanediol, Chondrus Crispus Extract, Glycerin, Xanthan Gum, Ceratonia Siliqua (Carob) Gum, Potassium Chloride, Dipropylene Glycol, Hydroxya- Cetophenone, Sucrose, Panthenol, Polyglyceryl-10 Laurate, Algin, Titanium Dioxide/CI 77891, Caprylyl Glycol, Allantoin, Calcium Chloride, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Dipotassium Glycyrrhizate, Butylene Glycol, Ethylhexylglycerin, Coccinia Indica Fruit Extract, Disodium EDTA, Sodium Citrate, Citric Acid, Solanum Melongena (Eggplant) Fruit Extract, Aloe Barbadensis Flower Extract, Xylitylglucoside, Simmondsia Chinensis (Jojoba) Seed Oil, Anhydroxylitol, Ocimum Sanctum Leaf Extract, Curcuma Longa (Turmeric) Root Extract, Corallina Of?Cinalis Extract, Xylitol, Laminaria Japonica Extract*, Hydrogen Dimethicone, Glucose, Kaolin, Diatomaceous Earth/Terre De Diatomees.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "1.7K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dermask-tm-vital-hydra-solution-tm-face-mask-5-pack-value-set-P506793",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:38:09",
        "product_name": "Dermask™ Vital Hydra Solution™ Face Mask 5-Pack Value Set",
        "brand_name": "Dr. Jart+",
        "options": [],
        "rating": "width:90.648%",
        "product_reviews": "293",
        "ingredients": "-Hydrating Complex with Glycerin: Delivers comforting moisture to the skin and keeps it there. Water, Glycerin, Butylene Glycol, Alcohol, Panthenol, Betaine, Xylitylglucoside, Anhydroxylitol, Xylitol, Hydrolyzed Hyaluronic Acid, Algae Extract, Laminaria Japonica Extract, Chlorphenesin, Hydroxyethylcellulose, Disodium EDTA, Xanthan Gum, PEG-60 Hydrogenated Castor Oil, Glycyrrhiza Glabra (Licorice) Root Extract, Zingiber Officinale (Ginger) Root Extract, Schizandra Chinensis Fruit Extract, Coptis Japonica Root Extract, Camellia Sinensis Leaf Extract, Caprylyl Glycol, 1,2-Hexanediol, Dipotassium Glycyrrhizate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Carbomer, Arginine, Citrus Grandis (Grapefruit) Seed Extract, Acorus Calamus Root Extract, Perilla Ocymoides Leaf Extract, Cyclopentasiloxane, Cyclohexasiloxane, PEG-10 Dimethicone/Vinyl Dimethicone Crosspolymer, Pelargonium Graveolens Flower Oil.",
        "n_loves": "987",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-mini-cicapair-color-correcting-treatment-spf-30-P482525",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:38:19",
        "product_name": "Mini Cicapair Color Correcting Treatment SPF 30",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 15 mL/ .50 fl oz"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2580801"
            }
        ],
        "rating": "width:80.08800000000001%",
        "product_reviews": "5K",
        "ingredients": " -Mineral Sunscreen (Zinc Oxide and Titanium Dioxide): Reflects UVA/UVB rays to protect skin from sun damage.Water, Centella asiatica Leaf Water, Isononyl Isononanoate, Cyclopentasiloxane, Butylene Glycol, Dimethicone, Phenyl Trimethicone, Methyl Methacrylate Crosspolymer, Beeswax/Cire D‘abeille, Glycerin, Diethylhexyl Carbonate, Polyglyceryl-3 Polyricinoleate, Niacinamide, Polymethylsilsesquioxane, Cyclohexasiloxane, Pan-Thenol, Diglycerin, Iron Oxides, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Dimethicone/Vinyl Dimethi- Cone Crosspolymer, Isododecane, Ethylene/Methacrylate Copolymer, Cetearyl Alcohol, Polyglyceryl-2 Triisostearate, Aluminum Hydroxide, Stearic Acid, Disteardimonium Hectorite, Acrylates/Ammonium Methacrylate Copolymer, Sclerotium Gum, Sodium Benzoate, Acrylates/Dimethicone Copolymer, Hydrogen Dimethicone, Chromium Oxide Greens, Triethyl Citrate, Potassium Sorbate, Fragaria Vesca (Strawberry) Leaf Extract, Disodium EDTA, BHT, Alcohol, Asiaticoside, Aden- Osine, Triethoxycaprylylsilane, Lavandula Angustifolia (Lavender) Oil, Boron Nitride, Asiatic Acid, Madecassic Acid, Citrus Grandis (Grapefruit) Peel Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, 1,2- Hexanediol, Anthemis Nobilis Flower Oil, Houttuynia Cordata Extract, Propanediol, Centella asiatica Extract, Gentiana Lutea Root Extract, Artemisia Absinthium Extract, Achillea Millefolium Extract, Arnica Montana Flower Extract, Polysorbate 20, Aniba Rosodora (Rosewood) Wood Oil, Sodium Glycerophosphate, Selaginella Lepidophylla Extract, Potassium Magnesium Aspartate, Citric Acid, Calcium Gluconate, Madecassoside, Magnesium Gluconate, Centella asiatica Meristem Cell Culture, Xanthan Gum, Titanium Dioxide, Zinc Oxide.",
        "n_loves": "25.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "BB & CC Cream"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-ceramidin-tm-skin-barrier-moisturizing-cream-P504007",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:38:33",
        "product_name": "Ceramidin™ Skin Barrier Moisturizing Cream",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz / 50 mL"
                ],
                "price": [
                    "$65.00"
                ],
                "sku": "Item 2640662"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 0.5 oz / 15 ml",
                    "NEW"
                ],
                "price": [
                    "$27.00"
                ],
                "sku": "Item 2692234"
            }
        ],
        "rating": "width:86.976%",
        "product_reviews": "559",
        "ingredients": "-Five Ceramides: Support a strong skin barrier.-Panthenol: Moisturizes and reinforces the skin barrier, preventing water loss. -Glycerin: Moisturizes skin. Water/Aqua/Eau, Glycerin, Caprylic/Capric Triglyceride, Dipropylene Glycol, Cetearyl Alcohol, Hydrogenated Polydecene, Methyl Trimethicone, Hydrogenated Poly(C6-14 Olefin), Butyrospermum Parkii (Shea) Butter, 1,2-Hexanediol, Phenyl Trimethicone, Dicaprylyl Ether, Cetearyl Olivate, Panthenol, Glyceryl Stearate, Behenyl Alcohol, Sorbitan Olivate, Theobroma Cacao (Cocoa) Seed Extract, 2,3-Butanediol, Cetearyl Glucoside, Ceramide NP, Ceramide NG, Ceramide NS, Ceramide AS, Ceramide AP, Cholesterol, Pentaerythrityl Distearate, Hydrogenated Lecithin, Palmitic Acid, Stearic Acid, Microcrystalline Cellulose, Glyceryl Stearate Se, Ammonium Acryloyldimethyltaurate/VP Copolymer, Cellulose Gum, Dextrin, Glyceryl Polymethacrylate, Pelargonium Graveolens Flower Oil, Olea Europaea (Olive) Fruit Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Salvia Officinalis (Sage) Oil, Citronellol, Tocopherol, Yellow 5 (CI 19140).",
        "n_loves": "32.3K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-cicapair-trade-tiger-grass-calming-serum-mask-P481699",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:38:49",
        "product_name": "Cicapair™ Tiger Grass Redness Reducing Serum Face Mask",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 Mask"
                ],
                "price": [
                    "$12.50"
                ],
                "sku": "Item 2532315"
            }
        ],
        "rating": "width:86.66600000000001%",
        "product_reviews": "33",
        "ingredients": "-Tiger Grass Extract and Madecassoside: Calm and soothe skin with moisture.-Tiger Grass Complex, Allantoin, and Niacinamide: Provide nourishment and support a strong skin barrier. Water/Aqua/Eau, Butylene Glycol, Niacinamide, Glycerin, Centella Asiatica Extract, Diglycerin, Carbomer, Tromethamine, Caffeine, Allantoin, 1,2-Hexanediol, Polyglyceryl-10 Laurate, Xanthan Gum, Caprylyl Glycol, Ethylhexylglycerin, Adenosine, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Streptococcus Thermophilus Ferment, Glycine Soja (Soybean) Peptide, Dextrin, Theobroma Cacao (Cocoa) Seed Extract, Althaea Rosea Flower Extract, Prunus Persica (Peach) Resin Extract, Asiaticoside, Centella Asiatica Leaf Extract, Disodium EDTA, Hydroxyacetophenone, Madecassoside.",
        "n_loves": "15.6K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cicapair-tiger-grass-cream-P411539",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:39:01",
        "product_name": "Cicapair™ Tiger Grass Cream Moisturizer",
        "brand_name": "Dr. Jart+",
        "options": [],
        "rating": "width:86.212%",
        "product_reviews": "1.4K",
        "ingredients": "-Tiger Grass: Is an herbal remedy that tigers roll around in to care for their wounds. -Niacinamide: Supports the skin barrier by retaining moisture. -Glycerin: Delivers replenishing moisture to skin.Water/Eau, Butylene Glycol, Propanediol, Caprylic/Capric Triglyceride, Cetearyl Alcohol, Hydrogenated Poly(C6-14 Olefin), Cetyl Ethylhexanoate, Polyglyceryl-3 Methylglucose Distearate, Butyrospermum Parkii (Shea) Butter, Niacinamide, Vinyl Dimethicone, Macadamia Integrifolia Seed Oil, Glyceryl Stearate, Pentylene Glycol, 1,2-Hexanediol, Diisostearyl Malate, Eryngium Maritimum Callus Culture Filtrate, Hydrogenated Vegetable Oil, Polymethylsilsesquioxane, Beeswax/Cire d'abeille, Cetearyl Olivate, Sorbitan Olivate, Madecassoside, Houttuynia Cordata Extract, Ilex Aquifolium (Holly) Leaf Extract, Streptococcus Thermophilus Ferment, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Achillea Millefolium Oil, Hydroxyacetophenone, Palmitic Acid, Stearic Acid, Lavandula Angustifolia (Lavender) Oil, Sodium Polyacryloyldimethyl Taurate, Carbomer, Xanthan Gum, Hydrogenated Polydecene, Tromethamine, Caramel, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Melia Azadirachta Leaf Extract, DNA, Melia Azadirachta Flower Extract, Adenosine, Sorbitan Isostearate, Asiaticoside, Disodium EDTA, Centella Asiatica Leaf Extract, Hedera Helix (Ivy) Extract, Coccinia Indica Fruit Extract, Trideceth-10, Panthenol, Amber Powder, Solanum Melongena (Eggplant) Fruit Extract, Ethylhexylglycerin, Curcuma Longa (Turmeric) Root Extract, Ocimum Sanctum Leaf Extract, Corallina Officinalis Extract, Moringa Oleifera Seed Oil, Tocopherol, Calcium Chloride, Magnesium Sulfate, Asiatic Acid, Madecassic Acid, Centella Asiatica Extract.",
        "n_loves": "77.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cryo-rubber-tm-face-mask-with-firming-collagen-P506825",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:39:16",
        "product_name": "Cryo Rubber™ Face Mask With Firming Collagen",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.14 oz / 4 g"
                ],
                "price": [
                    "$20.50"
                ],
                "sku": "Item 2344505"
            }
        ],
        "rating": "width:86.34600000000002%",
        "product_reviews": "583",
        "ingredients": "-Glycerin: Delivers skin-plumping moisture.-Collagen and NiacinamideStep 01: Water/Eau, Dipropylene Glycol, Glycerin, Caprylic/Capric Triglyceride, Niacinamide, Butylene Glycol, 1,2-Hexanediol, PEG-240/HDI Copolymer Bis-Decyltetradeceth-20 Ether, Glyceryl Stearate, PEG-100 Stearate, Sorbitan Sesquioleate, Glycereth-26, Dimethicone, Cetearyl Alcohol, Trehalose, Mangifera Indica (Mango) Seed Butter, Macadamia Ternifolia Seed Oil, Hydrolyzed Collagen, Glyceryl Acrylate/Acrylic Acid Copolymer, Ethylhexylglycerin, Disodium EDTA, Betaine, Allantoin, Adenosine, Eclipta Prostrata Extract, Melia Azadirachta Leaf Extract, Tocopherol, Potassium Laurate, Moringa Oleifera Seed Oil, Undaria Pinnati?da Extract, Musa Sapientum (Banana) Fruit Extract, Cynara Scolymus (Artichoke) Leaf Extract, Brassica Oleracea Capitata (Cabbage) Leaf Extract, Asparagus Of?cinalis Extract, Allium Cepa (Onion) Bulb Extract.Step 02:  Water/Eau, Methylpropanediol, Chondrus Crispus Extract, Glycerin, Xanthan Gum, Ceratonia Siliqua (Carob) Gum, Potassium Chloride, Dipropylene Glycol, Hydroxyace- Tophenone, Sucrose, Panthenol, Polyglyceryl-10 Laurate, Algin, Titanium Dioxide/CI 77891, Caprylyl Glycol, Eclipta Prostrata Extract, Allantoin, Calcium Chloride, Dipotassium Glycyrrhizate, Ethylhexylglycerin, Melia Azadirachta Leaf Extract, 1,2-Hexanediol, Disodium EDTA, Sodium Citrate, Ceratonia Siliqua (Carob) Fruit Extract*, Butylene Glycol, Citric Acid, Moringa Oleifera Seed Oil, Xylitylglucoside, Anhydroxylitol, Xylitol, Hydrogen Dimethicone, Glucose, Kaolin, Diatomaceous Earth/Terre De Diatomees.Please be aware that ingredient lists may change or vary from time to time. Please refer to the ingredient list on the product package you receive for the most up to date list of ingredients.",
        "n_loves": "1.6K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dr-jart-cicapair-tm-tiger-grass-camo-drops-color-corrector-spf-35-P505371",
        "error": "",
        "scrape_timestamp": "08/21/2023, 14:39:30",
        "product_name": "Cicapair ™ Tiger Grass Camo Drops Color Corrector SPF 35",
        "brand_name": "Dr. Jart+",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$66.00"
                ],
                "sku": "Item 2676211"
            }
        ],
        "rating": "width:82.69%",
        "product_reviews": "513",
        "ingredients": "-Mineral Sunscreen (Zinc Oxide and Titanium Dioxide): Reflects UVA/UVB rays, protecting skin from sun damage.Water/Aqua/Eau, Cyclopentasiloxane, Isononyl Isononanoate, Pentaerythrityl Tetraisostearate, Butyloctyl Salicylate, Methyl Trimethicone, Isododecane, Dipropylene Glycol, Diphenylsiloxy Phenyl Trimethicone, Lauryl PEG-10 Tris(Trimethylsiloxy)Silylethyl Dimethicone, Methyl Methacrylate Crosspolymer, Acrylates/Dimethicone Copolymer, Niacinamide, Polymethylsilsesquioxane, Disteardimonium Hectorite, Polyglyceryl-4 Isostearate, Magnesium Sulfate, Dipentaerythrityl Hexahydroxystearate/Hexastearate/Hexarosinate, Beeswax/Cera Alba/Cire D'abeille, 1,2-Hexanediol, Triethoxycaprylylsilane, Centella Asiatica Extract, Caprylyl Glycol, Synthetic Fluorphlogopite, Glyceryl Caprylate, Zein, Ethylhexylglycerin, Silica Dimethyl Silylate, Aluminum Hydroxide, Adenosine, Lavandula Angustifolia (Lavender) Oil, Zea Mays (Corn) Starch, Citrus Paradisi (Grapefruit) Peel Oil, Hydrogenated Lecithin, Rosmarinus Officinalis (Rosemary) Leaf Oil, Caprylic/Capric Triglyceride, Helianthus Annuus (Sunflower) Seed Oil, Sodium Chloride, Dipotassium Phosphate, Calcium Stearate, Gossypium Herbaceum (Cotton) Seed Oil, Anthemis Nobilis (Chamomile) Flower Oil, Panthenol, Butylene Glycol, Anastatica Hierochuntica (Rose Of Jericho) Extract, Houttuynia Cordata Extract, Aniba Rosaeodora (Rosewood) Wood Oil, Citral, Pentylene Glycol, Zinc Gluconate, Magnesium Aspartate, Lecithin, Glycerin, Brassica Campestris (Rapeseed) Sterols, Alcohol, Sucrose Laurate, Polyglyceryl-2 Caprate, Leuconostoc/Radish Root Ferment Filtrate, Arnica Montana Flower Extract, Centella Asiatica Leaf Extract, Fragaria Vesca (Strawberry) Fruit Extract, Copper Gluconate, Lysolecithin, Ceramide NP, Limonene, Linalool, Caprylhydroxamic Acid, Madecassoside, Tocopherol, Sodium Ascorbyl Phosphate, Phenoxyethanol, Titanium Dioxide (CI 77891), Iron Oxides (CI 77491), Iron Oxides (CI 77492), Chromium Oxide Greens (CI 77288).",
        "n_loves": "3.7K",
        "categories": [
            "Makeup",
            "Face",
            "Color Correct"
        ]
    }
]