[
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-claryifying-spot-serum-with-bija-seed-oil-P468672",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:32:01",
        "product_name": "Clarifying Spot Serum with Bija Seed Oil",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$26.00"
                ],
                "sku": "Item 2444321"
            }
        ],
        "rating": "width:90.754%",
        "product_reviews": "106",
        "ingredients": "-Bija Seed Oil: Helps address visible imperfections and soothes. -Salicylic Acid: Plant-derived salicylic acid to help exfoliate dead skin cells.-Glycerin, Rose, and Cocoa Extract: Hydrating, non-stripping formula.Water / Aqua / Eau, Butylene Glycol, Alcohol Denat., Dipropylene Glycol, Glycerin, Ammonium Acryloyldimethyltaurate/Vp Copolymer, 1,2-Hexanediol, Torreya Nucifera Seed Oil, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Polyglyceryl-6 Caprylate, Polyglyceryl-4 Caprate, Silica, Propanediol, Polyacrylate Crosspolymer-6, Salicylic Acid, Tromethamine, Dipotassium Glycyrrhizate, Glyceryl Caprylate, Fragrance / Parfum, Rosa Centifolia Flower Extract, Sorbitan Isostearate, Xanthan Gum, Dextrin, Theobroma Cacao (Cocoa) Extract, Beta-Glucan, Disodium Edta, Limonene, T-Butyl Alcohol, Ethylhexylglycerin, Linalool.",
        "n_loves": "5K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-green-tea-hydrating-cleansing-oil-P503942",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:32:12",
        "product_name": "Green Tea Hydrating Cleansing Oil",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.07 oz / 150 mL"
                ],
                "price": [
                    "$32.50"
                ],
                "sku": "Item 2640415"
            }
        ],
        "rating": "width:78.71000000000001%",
        "product_reviews": "31",
        "ingredients": "-Green Tea Water: Delivers antioxidant-, amino-acid-rich hydration.-Triple Amino Acid Complex: Helps add moisture to deliver a gentle, non-stripping cleanse.-Blend of Eight Botanical OilsTriethylhexanoin, Isopropyl Palmitate, Caprylic/Capric Triglyceride, Sorbeth-30 Tetraoleate, Cetyl Ethylhexanoate, Olea Europaea (Olive) Fruit Oil, Cocos Nucifera (Coconut) Oil, Fragrance / Parfum, Coco-Caprylate/Caprate, Linalool, Limonene, Helianthus Annuus (Sunflower) Seed Oil, Prunus Armeniaca (Apricot) Kernel Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Oryza Sativa (Rice) Bran Oil, Camellia Sinensis Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Water/Aqua/Eau, Phytosteryl/Octyldodecyl Lauroyl Glutamate,* Utylene Glycol, Propanediol, 1,2-Hexanediol, Acorus Calamus Root Extract, Ethylhexylglycerin, Disodium Edta, Camellia Sinensis Leaf Extract, Tocopherol. *Phytosteryl/Octyldodecyl Lauroyl Glutamate: a complex of amino acid and plant-based sterol.",
        "n_loves": "11.5K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-retinol-cica-moisture-recovery-serum-P505570",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:32:31",
        "product_name": "Retinol Cica Moisture Recovery Serum",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2677888"
            }
        ],
        "rating": "width:92.784%",
        "product_reviews": "97",
        "ingredients": "-Retinol: Visibly improves rough texture, wrinkles, and elasticity.-Jeju Cica Liposomlogy™: Cushions retinol formula with a ceramide, cica, and hyaluronic acid blend.-Salicylic Acid: Clears pore buildup. Water/Aqua/Eau, Glycerin, Butylene Glycol, Niacinamide, Dibutyl Adipate, Caprylic/Capric Triglyceride, 1,2-Hexanediol, Hydrogenated Lecithin, Ammonium Acryloyldimethyltaurate/VP Copolymer, Helianthus Annuus (Sunflower) Seed Oil, Cholesterol, Allantoin, Glycine Soja (Soybean) Oil, Tocopherol, Tocopheryl Acetate, Sodium Methyl Stearoyl Taurate, Propanediol, Daucus Carota Sativa (Carrot) Root Extract, Ethylhexylglycerin, Adenosine, Asiaticoside, Madecassic Acid, Camellia Sinensis Seed Extract, Asiatic Acid, Retinol, Stearyl Glycyrrhetinate, Hyaluronic Acid, Mannitol, Ceramide NP, Betaglucan, Betacarotene, Phytosphingosine, BHT, Salicylic Acid, Acetyl Tetrapeptide-11.",
        "n_loves": "3.6K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/green-tea-caffeine-bright-eye-serum-P507478",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:32:43",
        "product_name": "Green Tea Caffeine Bright-Eye Serum",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 0.33 oz / 10 ml",
                    "NEW"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2698298"
            }
        ],
        "rating": "width:92.292%",
        "product_reviews": "96",
        "ingredients": "-Green Tea and Five Types of Hyaluronic Acid: Antioxidant rich, helps hydrate dry areas.-2% Caffeine: Helps support and visibly depuff.-3% Niacinamide: Helps brighten dull areas.Water/Aqua/Eau, Butylene Glycol, Glycerin, Propanediol, Niacinamide, Dimethicone, Phenyl Trimethicone, Caffeine, 1,2-Hexanediol, Squalane, Polysorbate 20, Polysilicone-11, Pca Dimethicone, Polyacrylate Crosspolymer-6, Carbomer, Boron Nitride, Sodium Polyacryloyldimethyl Taurate, Titanium Dioxide (Ci 77891), Tromethamine, Dimethiconol, Synthetic Fluorphlogopite, Glyceryl Caprylate, Ethylhexylglycerin, Adenosine, Disodium Edta, Camellia Sinensis Leaf Extract, Arginine, Cyclodextrin, Hydroxypropyl Cyclodextrin, Maltodextrin, Citric Acid, Sodium Hyaluronate, Tin Oxide, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Hyaluronic Acid, Tocopherol, Sodium Acetylated Hyaluronate.",
        "n_loves": "6K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-hydration-heroes-green-tea-skincare-routine-set-P503901",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:32:55",
        "product_name": "Hydration Heroes Green Tea Skincare Routine Set",
        "brand_name": "innisfree",
        "options": [],
        "rating": "width:92.608%",
        "product_reviews": "138",
        "ingredients": "-5 Types of Hyaluronic Acid: Provide thorough, amplified hydration.-Green Tea Tri-Biotics™: Hydrate and help fortify skin’s moisture barrier.-Allantoin and Panthenol: Help nurture and soothe skin.Green Tea Hyaluronic Acid Hydrating Serum: Water/Aqua/Eau, Propanediol, Glycerin, Alcohol Denat., 1,2-Hexanediol, Trehalose, Niacinamide, Betaine, Saccharide Isomerate, Camellia Sinensis Seed Oil, Cetearyl Olivate, Hydrogenated Lecithin, Sorbitan Olivate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Lactobacillus Ferment Lysate, Butylene Glycol, Squalane, Panthenol, Allantoin, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Tromethamine, Ceratonia Siliqua (Carob) Gum, Ethylhexylglycerin, Disodium Edta, Fragrance / Parfum, Dipotassium Glycyrrhizate, Camellia Sinensis Leaf Extract, Sodium Hyaluronate, Hyaluronic Acid, Dextrin, Theobroma Cacao (Cocoa) Extract, 3-O-Ethyl Ascorbic Acid, Sorbitan Isostearate, Sodium Citrate, Citric Acid, Linalool, Limonene, Poloxamer 235, Sucrose, Lactic Acid, Epigallocatechin Gallate, Ethoxydiglycol, Tocophersolan, Poloxamer 338, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Caprylyl Glycol, Sodium Acetylated Hyaluronate.  Green Tea Hyaluronic Acid Hydrating Cream: Water/Aqua/Eau, Butylene Glycol, Propanediol, Glycerin, Diisostearyl Malate, Hydrogenated Poly(C6-14 Olefin), Caprylic/Capric Triglyceride, Polyglyceryl-3 Methylglucose Distearate, Methyl Trimethicone, Phytosteryl/Behenyl/Octyldodecyl Lauroyl Glutamate, 1,2-Hexanediol, Trehalose, Squalane, Panthenol, Glyceryl Stearate Citrate, C14-22 Alcohols, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Arachidyl Alcohol, Hydroxypropyl Starch Phosphate, Polymethylsilsesquioxane, Behenyl Alcohol, C12-20 Alkyl Glucoside, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Arachidyl Glucoside, Lactobacillus Ferment Lysate, Glyceryl Caprylate, Fragrance/Parfum, Ethylhexylglycerin, Disodium Edta, Camellia Sinensis Seed Extract, Camellia Sinensis Leaf Extract, Sorbitan Isostearate, Camellia Sinensis Seed Oil, Lactic Acid, Linalool, Limonene, Glucose, Ceramide Np, Dextrin, Theobroma Cacao (Cocoa) Extract, Sodium Hyaluronate, Hydrogenated Lecithin, Phytosphingosine, Hydrolyzed Hyaluronic Acid, Tocopherol, Sodium Hyaluronate Crosspolymer, Hyaluronic Acid, Sodium Acetylated Hyaluronate.  Green Tea Seed Hyaluronic Acid Hydrating Toner: Water/Aqua/ Eau, Butylene Glycol, Propanediol, Glycerin, 1,2-Hexanediol, Trehalose, Panthenol, Polyglycerin-3, Ppg-13-Decyltetradeceth-24, Caprylic/Capric Triglyceride, Lactobacillus Ferment Lysate, Xanthan Gum, Ethylhexylglycerin, Fragrance/Parfum, Disodium Edta, Cellulose Gum, Camellia Sinensis Leaf Extract, Squalane, Camellia Sinensis Seed Oil, Lactic Acid, Linalool, Limonene, Sodium Hyaluronate, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Hyaluronic Acid, Acrylates/Stearyl Methacrylate Copolymer, Tremella Fuciformis Sporocarp Extract, Sodium Acetylated Hyaluronate, Tocopherol, Ceramide Np.  Green Tea Amino Acid Face Cleanser: Water/Aqua/Eau, Glycerin, Myristic Acid, Lauric Acid, Potassium Hydroxide, Stearic Acid, Glyceryl Stearate, Glycol Distearate, Palmitic Acid, Laurylhydroxysultaine, Polyquaternium-22, Lauryl Glucoside, Propanediol, Fragrance/Parfum, Potassium Cocoyl Glycinate, 1,2-Hexanediol, Hydrolyzed Corn Starch, Pinus Densiflora Leaf Extract, Disodium Edta, Butylene Glycol, Arginine, Aspartic Acid, Glutamic Acid, Ethylhexylglycerin, Amellia Sinensis Leaf Extract, Acrylates/Stearyl Methacrylate Opolymer,Tremella Fuciformis Sporocarp Extract, Tetrasodium Edta, Hyaluronic Acid, Xanthan Gum, Ceramide Np, Acorus Calamus Root Extract.",
        "n_loves": "14.8K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-volcanic-pore-clearing-facial-cleanser-P503935",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:33:04",
        "product_name": "Volcanic Pore Clearing Facial Cleanser with AHA + BHA",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz / 150 mL"
                ],
                "price": [
                    "$19.00"
                ],
                "sku": "Item 2535193"
            }
        ],
        "rating": "width:86.84200000000001%",
        "product_reviews": "38",
        "ingredients": "-Jeju Volcanic Clusters™: Absorbs excess sebum and helps draw out impurities.\t\t-Lactic Acid: Helps exfoliate dead skin cells and minimize the appearance of pores.\t-Salicylic Acid: Helps exfoliate and clears build up that can cause clogged pores.\t\nWATER / AQUA / EAU, GLYCERIN, MYRISTIC ACID, STEARIC ACID, PEG-32, POTASSIUM HYDROXIDE, BUTYLENE GLYCOL, PALMITIC ACID, LAURIC ACID, COCAMIDOPROPYL BETAINE, HYDRATED SILICA, LAURYL GLUCOSIDE, GLYCERYL STEARATE, PEG100 STEARATE, FRAGRANCE / PARFUM, SODIUM CHLORIDE, SILICA, SALICYLIC ACID, POLYQUATERNIUM-7, ONSEN-SUI, ZINC PCA, VOLCANIC ASH, SODIUM METAPHOSPHATE, SODIUM BENZOATE, PROPANEDIOL, LACTIC ACID, LACTIC ACID/GLYCOLIC ACID COPOLYMER, 1,2- HEXANEDIOL, GLYCOLIC ACID, MADECASSOSIDE, CITRIC ACID, POLYQUATERNIUM-10, ETHYLHEXYLGLYCERIN, DISODIUM EDTA\t\t\t\t\t\t\n",
        "n_loves": "10.1K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-brightening-pore-caring-serum-P468676",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:33:19",
        "product_name": "Brightening & Pore-Caring Serum",
        "brand_name": "innisfree",
        "options": [],
        "rating": "width:100%",
        "product_reviews": "8",
        "ingredients": "-Tangerine Peel Extract: Helps with pore care and brightening. -Vitamin C: Controls the invisible melanin. -Niacinamide: Targets melasma and visibly improves the skin tone.Water/Aqua/Eau, Propanediol, Panthenol, Glycerin, Alcohol Denat., Niacinamide, 1,2-Hexanediol, Citric Acid, Sodium Chloride, Xanthan Gum, Gellan Gum, Fragrance/Parfum, Sodium Citrate, Citrus Reticulata (Tangerine) Peel Extract, Ethylhexylglycerin, Magnesium Sulfate, Disodium Edta, Hyaluronic Acid, 3-O-Ethyl Ascorbic Acid, Tocopherol.",
        "n_loves": "2.7K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-green-tea-hyaluronic-acid-hydrating-moisturizer-P503891",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:33:28",
        "product_name": "Green Tea Hyaluronic Acid Hydrating Moisturizer",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz / 50 mL"
                ],
                "price": [
                    "$36.00"
                ],
                "sku": "Item 2635217"
            }
        ],
        "rating": "width:94.638%",
        "product_reviews": "761",
        "ingredients": "-Five Types of Hyaluronic Acid: Amplify hydration.-Green Tea Tri-biotics™: Hydrate and fortify skin’s moisture barrier.-Squalane and Ceramide: Lock in moisture by creating a protective barrier.Water/Aqua/Eau, Propanediol, Glycerin, Methyl Trimethicone, Stearyl Dimethicone, Butylene Glycol Dicaprylate/Dicaprate, Pentaerythrityl Tetraethylhexanoate, Camellia Sinensis Seed Oil, 1,2-Hexanediol, Glyceryl Polymethacrylate, Polymethylsilsesquioxane, Trehalose, Octadecene, Squalane, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Polyglyceryl-3 Methylglucose Distearate, Carbomer, Hydrogenated Lecithin, Cholesterol, Glyceryl Stearate, Tromethamine, Lactobacillus Ferment Lysate, Fragrance/Parfum, Hyaluronic Acid, Panthenol, Allantoin, Cetearyl Alcohol, Xanthan Gum, Glyceryl Caprylate, Sodium Stearoyl Glutamate, Butylene Glycol, Disodium EDTA, Ethylhexylglycerin, Sorbitan Isostearate, Camellia Sinensis Leaf Extract, Linalool, Sodium Hyaluronate, Limonene, Madecassoside, Lactic Acid, Dextrin, Theobroma Cacao (Cocoa) Extract, Camellia Sinensis Seed Extract, Hydrolyzed Hyaluronic Acid, Ceramide NP, Tocopherol, Sodium Hyaluronate Crosspolymer, Phytosphingosine, Sodium Acetylated Hyaluronate.",
        "n_loves": "30.4K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-hydrate-purify-mini-bestsellers-discovery-skincare-set-P504840",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:33:40",
        "product_name": "Hydrate + Purify Mini Bestsellers Discovery Skincare Set",
        "brand_name": "innisfree",
        "options": [],
        "rating": "width:73.846%",
        "product_reviews": "13",
        "ingredients": "-5 Types of Hyaluronic Acid: Provide thorough, amplified hydration.-Green Tea Tri-Biotics™: Hydrate and help fortify skin’s moisture barrier.-Volcanic Clusters + AHA (Mask): Absorb excess serum and visibly smooths skin.Green Tea Hyaluronic Acid Hydrating Serum: Water/Aqua/Eau, Propanediol, Glycerin, Alcohol Denat., 1,2-Hexanediol, Trehalose, Niacinamide, Betaine, Saccharide Isomerate, Camellia Sinensis Seed Oil, Cetearyl Olivate, Hydrogenated Lecithin, Sorbitan Olivate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Lactobacillus Ferment Lysate, Butylene Glycol, Squalane, Panthenol, Allantoin, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Tromethamine, Ceratonia Siliqua (Carob) Gum, Ethylhexylglycerin, Disodium Edta, Fragrance/Parfum, Dipotassium Glycyrrhizate, Camellia Sinensis Leaf Extract, Sodium Hyaluronate, Hyaluronic Acid, Dextrin, Theobroma Cacao (Cocoa) Extract, 3-O-Ethyl Ascorbic Acid, Sorbitan Isostearate, Sodium Citrate, Citric Acid, Linalool, Limonene, Poloxamer 235, Sucrose, Lactic Acid, Epigallocatechin Gallate, Ethoxydiglycol, Tocophersolan, Poloxamer 338, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Caprylyl Glycol, Sodium Acetylated Hyaluronate.  Green Tea Hyaluronic Acid Hydrating Cream: Water/Aqua/Eau, Butylene Glycol, Propanediol, Glycerin, Diisostearyl Malate, Hydrogenated Poly(C6-14 Olefin), Caprylic/Capric Triglyceride, Polyglyceryl-3 Methylglucose Distearate, Methyl Trimethicone, Phytosteryl/Behenyl/Octyldodecyl Lauroyl Glutamate, 1,2-Hexanediol, Trehalose, Squalane, Panthenol, Glyceryl Stearate Citrate, C14-22 Alcohols, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Arachidyl Alcohol, Hydroxypropyl Starch Phosphate, Polymethylsilsesquioxane, Behenyl Alcohol, C12-20 Alkyl Glucoside, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Arachidyl Glucoside, Lactobacillus Ferment Lysate, Glyceryl Caprylate, Fragrance/Parfum, Ethylhexylglycerin, Disodium Edta, Camellia Sinensis Seed Extract, Camellia Sinensis Leaf Extract, Sorbitan Isostearate, Camellia Sinensis Seed Oil, Lactic Acid, Linalool, Limonene, Glucose, Ceramide Np, Dextrin, Theobroma Cacao (Cocoa) Extract, Sodium Hyaluronate, Hydrogenated Lecithin, Phytosphingosine, Hydrolyzed Hyaluronic Acid, Tocopherol, Sodium Hyaluronate Crosspolymer, Hyaluronic Acid, Sodium Acetylated Hyaluronate.  Pore Clearing Clay Mask: Water/Aqua/Eau, Titanium Dioxide (Ci 77891), Butylene Glycol, Silica, Glycerin, Trehalose, Volcanic Ash, Polyvinyl Alcohol, Bentonite, Kaolin, Caprylic/Capric Triglyceride, Glyceryl Stearate, Stearic Acid, Cetearyl Alcohol, Pvp, 1,2-Hexanediol, Peg-100 Stearate, Polysorbate 60, Iron Oxides (Ci 77499), Hydrogenated Vegetable Oil, Xanthan Gum, Juglans Regia (Walnut) Shell Powder, Sorbitan Stearate, Zea Mays (Corn) Starch, Polyacrylate-13, Polysorbate 20, Iron Oxides (Ci 77492), Mannitol, Microcrystalline Cellulose, Lactic Acid/Glycolic Acid Copolymer, Lactic Acid, Polyisobutene, Iron Oxides (Ci 77491), Menthoxypropanediol, Tetrasodium Pyrophosphate, Disodium Edta, Ethylhexylglycerin, Sorbitan Isostearate, Aluminum Hydroxide, Triethoxycaprylylsilane, Tocopherol.",
        "n_loves": "4.5K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-retinol-cica-overnight-patches-P504642",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:33:49",
        "product_name": "Retinol Cica Focusing Patches",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 18 / patches"
                ],
                "price": [
                    "$32.50"
                ],
                "sku": "Item 2669091"
            }
        ],
        "rating": "width:87.5%",
        "product_reviews": "88",
        "ingredients": "-Retinol and Salicylic Acid: Visibly improves rough skin texture and clears build up.-Cica and Allantoin: Soothes skin. -Hyaluronic Acid: Derived from jeju green soybeans to hydrate skin.Trehalose, Sodium Hyaluronate, Cellulose Gum, Glycerin, Polyglyceryl-10 Laurate, Glycine Soja (Soybean) Oil, Allantoin, Dipotassium Glycyrrhizate, Adenosine, Retinol, Madecassoside, Hyaluronic Acid, Salicylic Acid, Water/Aqua/Eau, Asiaticoside, Madecassic Acid, Asiatic Acid, Bht, Propanediol, 1,2-Hexanediol, Centella Asiatica Flower/Leaf/Stem Extract, Ethylhexylglycerin, Disodium Edta.",
        "n_loves": "10.3K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-green-tea-seed-intensive-hydrating-serum-P475951",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:34:06",
        "product_name": "Green Tea Hyaluronic Acid Hydrating Serum",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.7 oz / 80 mL"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 2635225"
            }
        ],
        "rating": "width:92.53%",
        "product_reviews": "656",
        "ingredients": "-Five Types of Hyaluronic Acid: Amplify hydration.-Green Tea Tri-biotics™: Hydrate and fortify skin’s moisture barrier.-Green Tea Extracts: Provide intense hydration rich in amino acids.Water/Aqua/Eau, Propanediol, Glycerin, Alcohol Denat., 1,2-Hexanediol, Trehalose, Niacinamide, Betaine, Saccharide Isomerate, Camellia Sinensis Seed Oil, Cetearyl Olivate, Hydrogenated Lecithin, Sorbitan Olivate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Lactobacillus Ferment Lysate, Butylene Glycol, Squalane, Panthenol, Allantoin, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Tromethamine, Ceratonia Siliqua (Carob) Gum, Ethylhexylglycerin, Disodium EDTA, Fragrance/Parfum, Dipotassium Glycyrrhizate, Camellia Sinensis Leaf Extract, Sodium Hyaluronate, Hyaluronic Acid, Dextrin, Theobroma Cacao (Cocoa) Extract, 3-O-Ethyl Ascorbic Acid, Sorbitan Isostearate, Sodium Citrate, Citric Acid, Linalool, Limonene, Poloxamer 235, Sucrose, Lactic Acid, Epigallocatechin Gallate, Ethoxydiglycol, Tocophersolan, Poloxamer 338, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Caprylyl Glycol, Sodium Acetylated Hyaluronate.",
        "n_loves": "52.5K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-dewy-glow-jam-cleanser-with-jeju-cherry-blossom-P482007",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:34:20",
        "product_name": "Dewy Glow Jam Cleanser with Jeju Cherry Blossom",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.29 oz/ 150 mL"
                ],
                "price": [
                    "$18.00"
                ],
                "sku": "Item 2503175"
            }
        ],
        "rating": "width:87.17%",
        "product_reviews": "53",
        "ingredients": "-Cherry Blossom Extracts and Betaine: Visibly boost radiance and leave skin with a hydrated look and feel.-Micellar Cleansing Complex: Thoroughly cleanses skin and helps remove residual makeup.-Quillaja saponaria Bark (Soapbark) Extract: A plant extract that produces bubbles (naturally suds up).Water/Aqua/Eau, Glycerin, Sodium Cocoyl Alaninate, Disodium Cocoamphodiacetate, Lauryl Hydroxysultaine, Betaine, 1,2-Hexanediol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Xanthan Gum, Caprylyl Glycol, Sodium Chloride, Coco-Glucoside, Fragrance/Parfum, Sodium Cocoyl Isethionate, Sodium Phytate, Propanediol, Hexylene Glycol, Quillaja Saponaria Bark Extract, Prunus Yedoensis Leaf Extract, Cyanocobalamin.",
        "n_loves": "10.8K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/youth-enriched-cream-with-orchid-P501772",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:34:31",
        "product_name": "Youth-enriched Cream with Orchid",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.69 oz / 50 mL"
                ],
                "price": [
                    "$40.00"
                ],
                "sku": "Item 2613222"
            }
        ],
        "rating": "width:89.108%",
        "product_reviews": "224",
        "ingredients": "Unknown Ingredients",
        "n_loves": "2.1K",
        "categories": [
            "Skincare",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-pore-clearing-clay-mask-P468658",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:34:43",
        "product_name": "Volcanic AHA Pore Clearing Clay Mask",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.38 oz/ 100 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2443240"
            }
        ],
        "rating": "width:92.308%",
        "product_reviews": "1.4K",
        "ingredients": " -Jeju Volcanic Clusters™: Finely ground hardened volcanic lava that helps absorb excess sebum.-Lactic Acid: Helps exfoliate dead skin cells and minimize appearance of pores. Water / Aqua / Eau, Titanium Dioxide (Ci 77891),Butylene Glycol, Silica, Glycerin, Trehalose, Volcanic Ash, Polyvinyl Alcohol, Bentonite, Kaolin, Caprylic/Caprictriglyceride, Glyceryl Stearate, Stearic Acid, Cetearylalcohol, Pvp, 1,2-Hexanediol, Peg-100 Stearate, Polysorbate60, Iron Oxides (Ci 77499), Hydrogenated Vegetableoil, Xanthan Gum, Juglans Regia (Walnut) Shell Powder,Sorbitan Stearate, Zea Mays (Corn) Starch, Polyacrylate-13, Polysorbate 20, Iron Oxides (Ci 77492), Mannitol, Microcrystalline Cellulose, Lactic Acid/Glycolic Acidcopolymer, Lactic Acid, Polyisobutene, Iron Oxides (Ci 77491), Menthoxypropanediol, Tetrasodium Pyrophosphate, Disodium Edta, Ethylhexylglycerin, Sorbitan Isostearate, Aluminum Hydroxide, Triethoxycaprylylsilane, Tocopherol.",
        "n_loves": "131K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-green-tea-hyaluronic-acid-face-cleanser-P503928",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:34:55",
        "product_name": "Green Tea Hyaluronic Acid Face Cleanser",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.07 oz / 150 mL"
                ],
                "price": [
                    "$16.50"
                ],
                "sku": "Item 2640407"
            }
        ],
        "rating": "width:72.048%",
        "product_reviews": "83",
        "ingredients": "-Green Tea Water: Delivers antioxidant-, amino-acid-rich hydration.-Triple Amino Acid Complex: Helps add moisture to deliver a gentle, non-stripping cleanse.Water/Aqua/Eau, Glycerin, Myristic Acid, Lauric Acid, Potassium Hydroxide, Stearic Acid, Glyceryl Stearate, Glycol Distearate, Palmitic Acid, Laurylhydroxysultaine, Polyquaternium-22, Lauryl Glucoside, Propanediol, Fragrance / Parfum, Potassium Cocoyl Glycinate, 1,2-Hexanediol, Hydrolyzed Corn Starch, Pinus Densiflora Leaf Extract, Disodium Edta, Butylene Glycol, Arginine, Aspartic Acid, Glutamic Acid, Ethylhexylglycerin, Amellia Sinensis Leaf Extract, Acrylates/Stearyl Methacrylate Opolymer,Tremella Fuciformis Sporocarp Extract, Tetrasodium Edta, Hyaluronic Acid, Xanthan Gum, Ceramide Np, Acorus Calamus Root Extract.",
        "n_loves": "13.5K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-brightening-pore-caring-facial-cleanser-P468677",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:35:06",
        "product_name": "Brightening & Pore-Caring Facial Cleanser",
        "brand_name": "innisfree",
        "options": [],
        "rating": "width:88.75%",
        "product_reviews": "16",
        "ingredients": "-Tangerine Peel Extract: Helps with pore care and brightening. -Vitamin C: Controls the invisible melanin. -Niacinamide: Targets melasma and visibly improves the skin tone.Water/Aqua/Eau, Potassium Cocoyl Glycinate, Glycerin, Acrylates Copolymer, Propanediol, Kaolin, Coco-Glucoside, Cocamidopropyl Betaine, Disodium Cocoamphodiacetate, Sodium Chloride, Sodium Methyl Cocoyl Taurate, 1,2-Hexanediol, Titanium Dioxide (Ci 77891), Fragrance/Parfum, Potassium Hydroxide, Polyquaternium-7, Sodium Benzoate, Disodium Edta, Ethylhexylglycerin, Tetrasodium Edta, Panthenol, Niacinamide, 3-O-Ethyl Ascorbic Acid, Citrus Reticulata (Tangerine) Peel Extract, Tocopherol.",
        "n_loves": "4.1K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/youth-enriched-eye-cream-with-orchid-P501803",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:35:16",
        "product_name": "Youth-enriched Eye Cream with Orchid",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.01 oz / 30 mL"
                ],
                "price": [
                    "$40.00"
                ],
                "sku": "Item 2613230"
            }
        ],
        "rating": "width:87.20000000000002%",
        "product_reviews": "25",
        "ingredients": "Unknown Ingredients",
        "n_loves": "1.7K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-dewy-glow-moisturizer-with-cherry-blossom-niacinamide-P482006",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:35:28",
        "product_name": "Dewy Glow Moisturizer with Cherry Blossom & Niacinamide",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.69 oz/ 50 mL"
                ],
                "price": [
                    "$35.00"
                ],
                "sku": "Item 2535201"
            }
        ],
        "rating": "width:85.924%",
        "product_reviews": "368",
        "ingredients": "-Cherry Blossom Flavonoids: Soothe.-Niacinamide: Visibly brightens.-Sugar Beet Betaine: Hydrates. Water/Aqua/Eau, Glycerin, Propanediol, Dipropylene Glycol, Niacinamide, Betaine, 1,2-Hexanediol, Carbomer, Tromethamine, Ammonium Acryloyldimethyltaurate/Beheneth-25 Methacrylate Crosspolymer, Disodium EDTA, Ethylhexylglycerin, Fragrance/Parfum, Prunus Yedoensis Leaf Extract, Tocopherol.",
        "n_loves": "55.4K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-brightening-pore-caring-sleeping-mask-P468675",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:35:38",
        "product_name": "Brightening & Pore-Caring Sleeping Mask",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 3.38 oz/ 100 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$35.00"
                ],
                "sku": "Item 2443117"
            }
        ],
        "rating": "width:83.75%",
        "product_reviews": "16",
        "ingredients": "-Tangerine Peel Extract: Helps brighten the appearance of skin.-Vitamin C: Supports the invisible melanin. -Niacinamide: Helps reduce melasma and improve the skin tone. Water/Aqua/Eau, Propanediol, Dimethicone, Hydrogenated Poly(C6-14 Olefin), Trehalose, Glycerin, Niacinamide, 1,2-Hexanediol, Panthenol, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Behenyl Alcohol, Jojoba Esters, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Polyacrylate-13, Fragrance/Parfum, Tromethamine, Polyisobutene, Glyceryl Caprylate, Citrus Reticulata (Tangerine) Peel Extract, Ethylhexylglycerin, Polysorbate 20, Sorbitan Isostearate, Disodium Edta, 3-O-Ethyl Ascorbic Acid, Tocopherol.",
        "n_loves": "6.3K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-green-tea-hyaluronic-acid-hydrating-toner-P503890",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:35:49",
        "product_name": "Green Tea Hyaluronic Acid Hydrating Toner",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.41 oz / 160 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2640399"
            }
        ],
        "rating": "width:92.51799999999999%",
        "product_reviews": "139",
        "ingredients": "-5 Types of Hyaluronic Acid: Provide more thorough, amplified hydration.-Green Tea Tri-Biotics™: Hydrate and helps fortify skin’s moisture barrier.-Panthenol: Helps nurture skin.Water/Aqua/ Eau, Butylene Glycol, Propanediol, Glycerin, 1,2-Hexanediol, Trehalose, Panthenol, Polyglycerin-3, Ppg-13-Decyltetradeceth-24, Caprylic/Capric Triglyceride, Lactobacillus Ferment Lysate, Xanthan Gum, Ethylhexylglycerin, Fragrance/Parfum, Disodium Edta, Cellulose Gum, Camellia Sinensis Leaf Extract, Squalane, Camellia Sinensis Seed Oil, Lactic Acid, Linalool, Limonene, Sodium Hyaluronate, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Hyaluronic Acid, Acrylates/Stearyl Methacrylate Copolymer, Tremella Fuciformis Sporocarp Extract, Sodium Acetylated Hyaluronate, Tocopherol, Ceramide Np.",
        "n_loves": "19.8K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-pore-clearing-matte-moisturizer-with-volcanic-clusters-P475112",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:36:02",
        "product_name": "Pore Clearing Matte Moisturizer with Volcanic Clusters",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$32.50"
                ],
                "sku": "Item 2500114"
            }
        ],
        "rating": "width:89.344%",
        "product_reviews": "122",
        "ingredients": "-Volcanic Cluster Sphere Plus™: Provides seven times more oil absorption than innisfree's original volcanic clusters.-BHA: Helps gently exfoliate and decongest skin.-PHA: Helps gently exfoliate and smooth skin's appearance.Water / Aqua / Eau, Butylene Glycol, Propanediol, Limnanthes Alba (Meadowfoam) Seed Oil, Methyl Trimethicone, Hydrogenated Poly(C6-14 Olefin), Polymethylsilsesquioxane, 1,2-Hexanediol, Diphenylsiloxy Phenyl Trimethicone, C14-22 Alcohols, Titanium Dioxide (Ci 77891), Hydrogenated Lecithin, Hydroxypropyl Starch Phosphate, Cetyl Hydroxyethylcellulose, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Glyceryl Stearate, C12-20 Alkyl Glucoside, Glyceryl Caprylate, Disodium Edta, Ethylhexylglycerin, Tromethamine, Lactic Acid, Salicylic Acid, Gluconolactone, Sorbitan Isostearate, Hydrated Silica, Volcanic Ash, Disodium Phosphate, Silica Dimethyl Silylate, Glucose, Silica, Lactic Acid/Glycolic Acid Copolymer, Tocopherol, Polyquaternium-10.",
        "n_loves": "15K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/innisfree-claryifying-cleansing-foam-with-bija-seed-oil-P468671",
        "error": "",
        "scrape_timestamp": "08/21/2023, 19:36:14",
        "product_name": "Clarifying Cleansing Foam with Bija Seed Oil",
        "brand_name": "innisfree",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.07 oz/ 150 mL"
                ],
                "price": [
                    "$16.50"
                ],
                "sku": "Item 2444313"
            }
        ],
        "rating": "width:79.584%",
        "product_reviews": "48",
        "ingredients": "-Bija Seed Oil: Helps address visible imperfections and soothes.-Willow Bark Extract (BHA): Plant-derived salicylic acid to help exfoliate dead skin cells.-Menthol, Rose, and Cocoa Extracts: Provide a cooling cleanse with a hydrating, non-stripping formula.Water / Aqua / Eau, Glycerin, Myristic Acid, Lauric Acid, Potassium Hydroxide, Stearic Acid, Lauryl Hydroxysultaine, Glyceryl Stearate, Glycol Distearate, Palmitic Acid, Torreya Nucifera Seed Oil, Fragrance / Parfum, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Salix Alba (Willow) Bark Extract, Menthol, Limonene, Disodium Edta, Linalool, Dextrin, Theobroma Cacao (Cocoa) Extract, Rosa Centifolia Flower Extract.",
        "n_loves": "7.1K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    }
]