[
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-black-reserve-body-hair-cleanser-P455232",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:01:38",
        "product_name": "Black Reserve Body & Hair Cleanser",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 33 oz/ 975 mL"
                ],
                "price": [
                    "$70.00"
                ],
                "sku": "Item 2332955"
            }
        ],
        "rating": "width:92%",
        "product_reviews": "10",
        "ingredients": " -Aloe Vera: Helps soothe, calm, and visibly soften the skin. -Panthenol (Pro-Vitamin B5): Provides lightweight moisturization that visibly softens and smooths skin and hair.-Shea Butter: Contains essential fatty acids to hydrate and moisturize dry skin and hair. Aqua (Water/Eau), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, PEG-120 Methyl Glucose Dioleate, Fragrance (Parfum), Lauryl Glucoside, Ethylhexylglycerin, Rosmarinus Officinalis (Rosemary/Romarin) Leaf Extract, Eucalyptus Globulus Leaf Extract, Juniperus Communis Fruit Extract, Ocimum Basilicum (Basil/Basilic) Leaf Extract*, Camellia Sinensis (Green Tea/Thé vert) Leaf Extract*, Laminaria Digitata Extract*, Aloe Barbadensis Leaf Juice Powder, Helianthus Annuus (Sunflower/Tournesol) Seed Oil, Helianthus Annuus (Sunflower/Tournesol) Extract, Butyrospermum Parkii (Shea/Karité) Butter, Arnica Montana Flower Extract, Citrus Grandis (Grapefruit/Pamplemousse) Fruit Extract, Oryza Sativa (Rice/Riz) Bran Extract, Thymus Vulgaris (Thyme/Thym) Leaf Extract, Ascorbic Acid, Ascorbyl Palmitate, Hydrolyzed Jojoba Protein, Panthenol, Retinyl Palmitate, Tocopheryl Acetate, Tocopherol, Glycerin, Glycol Stearate, Glycol Distearate, Citric Acid, PEG-20 Methyl Glucose Sesquistearate, Polyquaternium-7, Sodium Benzoate, Sorbic Acid, Sodium Phytate, Sodium Chloride, Chlorphenesin, Phenoxyethanol, Potassium Sorbate, Sodium Hydroxide, Alcohol, Tetrasodium EDTA, Benzyl Benzoate, Coumarin, Geraniol, Citral, Limonene, Linalool.*Certified Organic/Certifiés Biologiques. ",
        "n_loves": "1.4K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-balancing-foam-cleanser-P477992",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:01:50",
        "product_name": "Balancing Foam Cleanser",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 150 mL",
                    "ONLY A FEW LEFT",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2500551"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "-Salicylic Acid 0.5%: Addresses acne and blackheads.-Turmeric Root Extract: A natural antioxidant that fights external stressors, gently clarifies, nourishes, and balances.-Lactic Acid: Gently exfoliates for a smoother-, even-looking complexion while boosting skin’s moisture levels.Water, Disodium Cocoamphodiacetate, Cocamidopropyl Betaine, Butylene Glycol, Glycerin, Propanediol, Lactic Acid, Bisabolol, Curcuma Longa (Turmeric) Root Extract, Aloe Barbadensis Leaf Juice, Camellia Sinensis Leaf Extract, Sodium Chloride, Phenoxyethanol, Cocamidopropyl PG-Dimonium Chloride Phosphate, Ethylhexylglycerin.",
        "n_loves": "131",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/deep-dive-glycolic-facial-cleanser-P385674",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:02:02",
        "product_name": "Deep Dive™ Glycolic Facial Cleanser",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 147 mL"
                ],
                "price": [
                    "$32.50"
                ],
                "sku": "Item 1604438"
            }
        ],
        "rating": "width:91.684%",
        "product_reviews": "279",
        "ingredients": "Water, Kaolin, Glycerin, Sodium Methyl Cocoyl Taurate, Magnesium Aluminum Silicate, Volcanic Ash, Aveena Sativa (Oat) Kernel Meal, Acrylates Copolymer, Glycolic Acid, Helianthus Anuus (Sunflower) Seed Oil, Calendula Officinalis (Pot Marigold) Flower Extract, Chamomilla Recutita (Matricaria) Flower Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Camellia Sinensis (Green Tea) Leaf Extract, Olea Europaea (Olive) Leaf Extract, Disodium Cocoamphodiacetate, Phenoxyethanol, Aloe Barbadensis (Aloe Vera) Leaf Juice, Caprylyl Glycol, Sodium Hydroxide, Ethylhexylglycerin, Hexylene Glycol, Panthenol, Epilobium Angustifolium Flower/Leaf/Stem Extract, Arnica Montana (Wolf's Bane) Flower Extract, Allantoin, Tetrahexyldecyl Ascorbate, Tocopheryl Acetate.",
        "n_loves": "13K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/two-for-road-set-P503344",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:02:13",
        "product_name": "Two For The Road Set",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:20%",
        "product_reviews": "1",
        "ingredients": "-Vitamin A: Acts as an antioxidant. -Vitamin E: Protects against free-radical damage.-Macadamia Nut Oil: Softens and hydrates skin.Intense Therapy Hand Cream: Water, Cetearyl Alcohol, Glycerin, Cocoglycerides, Peg-100 Stearate, Hydrogenated Polyisobutene, Macadamia Integrifolia Seed Oil, Polymethyl Methacrylate, Helianthus Annuus (Sunflower) Seed Oil*, Camellia Sinensis (White Tea) Extract*, Punica Granatum (Pomegranate) Extract*, Linum Usitatissimum (Linseed) Seed Extract*, Morinda Citrifolia (Noni) Extract*, Laminaria Digitata Extract* Retinyl Palmitate (Vitamin A), Tocopheryl Acetate (Vitamin E), Hydrogenated Lecithin, Eucalyptus Globulus Oil, Allantoin, Sodium Hyaluronate, Methyl Trimethicone, Myristyl Myristate, Dimethicone, Steareth-2, Glycereth-26, Glycereth-2 Cocoate, Benzoic Acid,  Benzalkonium Chloride *Certified Organic.Moisture Therapy Lip Balm in Mint: Theobroma Cacao (Cocoa) Seed Butter, Lanolin Oil, Beeswax, Ozokerite, Polyglyceryl-3 Beeswax, Flavor, Butyrospermum Parkii (Shea) Butter, C18-38 Alkyl Hydroxystearoyl Stearate, Persea Gratissima (Avocado) Oil, Tocopheryl Acetate, Cyclopentasiloxane, Microcrystalline Wax, Camellia Sinensis (Green Tea) Leaf Extract, Cyclohexasiloxane, *Certified Organic.",
        "n_loves": "786",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/double-duty-face-moisturizer-spf-20-P381187",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:02:23",
        "product_name": "Double-Duty Face Moisturizer SPF 20",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.3 oz/ 100 mL"
                ],
                "price": [
                    "$40.50"
                ],
                "sku": "Item 1387703"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 251 mL"
                ],
                "price": [
                    "$66.00"
                ],
                "sku": "Item 1726116"
            }
        ],
        "rating": "width:86.75399999999999%",
        "product_reviews": "77",
        "ingredients": "Water, Hydrogenated Polyisobutene, Cyclomethicone, Hydroxy-Propyl Starch Phosphate, PEG-8, Phenyl Trimethicone, Phospholipids, Glycerin, Phenoxyethanol, Balm Mint Leaf Extract, Apple Fruit Extract, Geranium Maculatum Oil, Chamomile Flower Oil, Lavender Oil, Rosemary Oil, Calluna Vulgaris Extract, Algae Extract, Sea Parsley Extract, Bisabolol, Butylene Glycol, Sodium PCA, Urea, Trehalose, Sodium Hyaluronate, Carbomer, Xanthan Gum, Dimethiconol, Acrylates C10-30 Acrylate Crosspolymer, Acrylates/Vinyl Isodecanoate Crosspolymer, Ceratonia Silqua Gum, Cyamopsis Tetragenoloba (Guar Gum), Polyquaternium-51, Polyphosphorylcholine Glycol Acrylate, Hydrogenated Butylene/Ethylene/Styrene Copolymer, Hydrogenated Ethylene/Propoylene/Styrene, Chlorophensin, Methylparaben, Benzoic Acid.",
        "n_loves": "4.4K",
        "categories": [
            "Skincare",
            "Sunscreen",
            "Face Sunscreen"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/line-smoother-oil-free-face-moisturizer-P12574",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:02:36",
        "product_name": "Line Smoother Oil-Free Moisturizer",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.3 oz"
                ],
                "price": [
                    "$43.50"
                ],
                "sku": "Item 564294"
            }
        ],
        "rating": "width:89.09%",
        "product_reviews": "44",
        "ingredients": "Water (Aqua), Glycolic Acid, Butylene Glycol, C12-15 Alkyl Benzoate, Stearic Acid, Caprylic/Capric Triglyceride, Sodium Hydroxide, Glyceryl Stearate, Dimethicone, Grape (Vitis Vinifera) Seed Extract, Licorice (Glycyrrhiza Glabra) Extract, Retinyl Palmitate (vitamin A), Tocopheryl Acetate (vitamin E), Panthenol, Cetyl Alcohol, Sorbitan Stearate, Polysorbate 80, PEG-100 Stearate, Magnesium Aluminum Silicate, Hydroxyethylcellulose, Xanthan Gum, Allantoin, Polycrylamide, C13-14 Isoparaffin, Laureth-7, Propylene Glycol, Diazolidinyl Urea, Methylparaben, Propylparaben.",
        "n_loves": "4.2K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/true-volume-thickening-shampoo-P397024",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:02:48",
        "product_name": "True Volume Thickening Shampoo",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16 oz"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1692052"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "13",
        "ingredients": " -Wheat Protein: Fortifies and gives thinning strands a bulked-up look. \n-Lavender Oil: Soothes.\n-Nettle Leaf: Creates a healthy-looking sheen.\n-Organic Basil Leaf: Protects.\n\n Water, Sodium Methyl 2-Sulfolaurate, Cocamidopropyl Hydroxysultaine, Glycerin, Disodium Laureth Sulfosuccinate, PEG-200 Hydrogenated Glyceryl Palmate, PEG-2 Cocamide, Disodium 2-Sulfolaurate, Ocimum Basilicum (Basil)*, Hydrolyzed Lupine Protein, Hydrolyzed Wheat Protein, Hydrolyzed Soy Protein, Macrocystis Pyrifera (Kelp) Extract*, Creatine, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Panthenol, Helianthus Annuus (Sunflower) Seed Extract*, Citrus Grandis (Grapefruit) Peel Oil, Helianthus Annuus (Sunflower) Seed Oil, Glycerin*, Prunus Cerasus (Bitter Cherry) Extract,  Salix Nigra (Willow) Bark Extract, Salvia Officinalis (Sage) Oil, Urtica Dioica (Nettle) Leaf Extract, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Lavandula Angustifolia (Lavender) Oil, Retinyl Palmitate, Tocopheryl Acetate, C11-15 Pareth-7, C12-16 Pareth-9, Citric Acid, Cocamidopropyl Betaine, Coco-Glucoside, Disodium EDTA, Glyceryl Oleate , PEG-150 Distearate, PEG-7 Glyceryl Cocoate, Polyquaternium-10, Polysorbate 20, Trideceth-12, Trimethylsiloxyamodimethicone, Caprylyl Glycol, Chlorphenesin, Phenoxyethanol, Potassium Sorbate.\n*Certified Organic\n",
        "n_loves": "1.9K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/power-peel-multi-acid-resurfacing-pads-P298331",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:03:00",
        "product_name": "Power Peel Multi-Acid Resurfacing Pads",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:87.17%",
        "product_reviews": "53",
        "ingredients": "Water, Alcohol Denat., Butylene Glycol, Glycolic Acid, Niacinamide, Salicylic Acid, Vaccinium Myrtillus Fruit/Leaf Extract, Glucosamine HCl, Gluconolactone, Saccharomyces Cerevisiae Extract, Algae Extract, Urea, Saccharum Officinarum (Sugar Cane) Extract, Xanthan Gum, Sodium Hydroxide, Glycerin, Lycium Barbarum Fruit Extract*, Anthemis Nobilis Flower Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Betula Alba Bark Extract, Hexanoyl Dipeptide-3 Norleucine Acetate, Sodium Benzoate, Magnesium Ascorbyl Phosphate, Hamamelis Virginiana (Witch Hazel) Water*, Alcohol, Lecithin, Acer Saccharum (Sugar Maple) Extract, Vaccinium Angustifolium (Blueberry) Fruit Extract, Sodium Hyaluronate, Pelargonium Graveolens Flower Oil*, Phenethyl Alcohol, Caprylyl Glycol, Potassium Sorbate, Tocopheryl Acetate, Phyllanthus Emblica Fruit Extract, Glycine Soja (Soybean) Oil   *Certified Organic.\n",
        "n_loves": "5.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-charcoal-body-buff-exfoliating-cleanser-P477174",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:03:10",
        "product_name": "Charcoal Body Buff Exfoliating Cleanser",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 16 oz/ 473 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$51.50"
                ],
                "sku": "Item 2483618"
            }
        ],
        "rating": "",
        "product_reviews": "",
        "ingredients": "-Charcoal Powder: Helps absorb odor and dirt from the skin.-Natural Volcanic Stone: Exfoliates to remove rough patches and dead skin to reveal smooth soft skin.-Sea Algea Blend: Contains macro- and micro-nutrients to nourish and hydrate skin.Aqua/Water/Eau, Sodium C14-16 Olefin Sulfonate, Pumice, Decyl Glucoside, Acrylates Crosspolymer-4, Glycerin, Coco-Betaine, Charcoal Powder, Volcanic Ash, Candelilla Cera/Euphorbia Cerifera (Candelilla) Wax/Cire de candelilla, Adansonia Digitata Oil*, Butyrospermum Parkii (Shea) Butter*, Aloe Barbadensis Leaf Juice Powder*, Jojoba Esters, Porphyra Umbilicalis Extract, Hypnea Musciformis Extract, Spirulina Maxima Extract, Fucus Vesiculosus Extract, Panthenol, Sodium Gluconate, Citric Acid, Potassium Sorbate, Sodium Chloride, Fragrance (Parfum), Stearyl Stearate, Sodium Benzoate, Methyl Glucose Caprate/Caprylate/Oleate, Propanediol, Citronellol. *Certified Organic",
        "n_loves": "512",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pure-clean-daily-facial-cleanser-P171300",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:03:21",
        "product_name": "Pure Clean Daily Facial Cleanser",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16 oz/ 473 mL"
                ],
                "price": [
                    "$47.50"
                ],
                "sku": "Item 1240464"
            }
        ],
        "rating": "width:91.51%",
        "product_reviews": "245",
        "ingredients": " -Oat and Coconut derived surfactants: Work into a thick rich lather to gently cleanse skin and break down pore clogging residue.-Certified Organic Sage Leaf Extract: Provides antibacterial and anti-inflammatory benefits.-Certified Organic Chamomile Extract: Soothes calms and helps reduce redness and acts as an antiseptic.-Rosemary Extract: Helps control oiliness and fights bacteria on the skin's surface.-Witch Hazel: A natural astringent and antioxidant that acts as a toner and anti-irritant.-Aloe Leaf Extract: Helps soothe calm and soften skin.-Lavender Extract: A natural botanical that encourages healing and soothes skin. \n\n\n\nWater (Aqua), Sodium C14-16 Olefin Sulfonate, Disodium Cocoamphodiacetate, Aloe Barbadensis Leaf Juice*, Cocamidopropyl Betaine, Sodium Lauroyl Oat Amino Acids, Glycol Distearate, PEG-150 Distearate, Hamamelis Virginiana (Witch Hazel) Extract, Glycerin, Lavandula Angustifolia (Lavender) Extract*, Salvia Officinalis (Sage) Leaf Extract*, Chamomile Recutita (Matricaria) Flower Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Salvia Officinalis (Sage) Leaf Oil, Backhousia Citriodora Oil, PEG 8-Dimethicone, Sodium Chloride, Sodium PCA, Cetyl Alcohol, Citric Acid, Benzyl Alcohol, Dehydroacetic Acid. * Certified Organic.\n",
        "n_loves": "10.6K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/all-over-wash-for-face-hair-body-P12568",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:03:33",
        "product_name": "All-Over Wash For Face, Hair & Body",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10 oz"
                ],
                "price": [
                    "$32.50"
                ],
                "sku": "Item 1714815"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 33 oz/ 976 mL"
                ],
                "price": [
                    "$70.00"
                ],
                "sku": "Item 1176197"
            }
        ],
        "rating": "width:93.376%",
        "product_reviews": "154",
        "ingredients": "Water, Lauryl Glucoside, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Hydrolyzed Wheat Protein, Helianthus Annuus (Sunflower) Seed Oil*. Linum Usitatissimum (Linseed) Seed Extract*, Punica Granatum (Pomegranate) Extract*, Olea Europaea (Olive) Fruit Extract*, Macrocystis Pyrifera Extract*, Morinda Citrifolia Extract*, Camellia Sinensis Leaf Extract*, Butyrospermum Parkii (Shea Butter), Aloe Barbadensis Leaf Juice, Ascorbic Acid (vitamin C), Phospholipids, Tocopheryl Acetate (vitamin E), Retinyl Palmitate (vitamin A), Ascorbyl Palmitate, Citrus Grandis (Grapefuit) Seed Extract, Glycerin, PEG-20 Methyl Glucose Sesquistearate, Peg-150 Distearate, Tetrasodium EDTA, Citric Acid, Polyquaternium-7, Sodium Hydroxymethylglycinate, Phenoxyethanol, Sodium Chloride, Fragrance, Glycol Stearate. *Certified Organic.",
        "n_loves": "6.7K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/beard-grooming-kit-tm-P425428",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:03:45",
        "product_name": "Beard Grooming Kit™",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:76%",
        "product_reviews": "5",
        "ingredients": "All-Over Wash For Face, Hair & Body:\nWater, PPG-15 Stearyl Ether, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, PEG-120 Methyl Glucose Dioleate, Sodium Lauroyl Sarcosinate, Panthenol, Aloe Barbadensis Leaf Juice Powder, Helianthus Annuus (Sunflower) Extract, Ascorbic Acid, Ascorbyl Palmitate, Butyrospermum Parkii (Shea) Butter, Hydrolyzed Jojoba Protein, Tocopheryl Acetate, Camellia Sinensis Leaf Extract, Macrocystis Pyrifera (Kelp) Extract, Ocimum Basilicum (Basil) Leaf Extract, Punica Granatum Extract, Citrus Grandis (Grapefruit) Fruit Extract, Hydrolyzed Linseed Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Helianthus Annuus (Sunflower) Seed Oil, Oryza Sativa (Rice) Bran Extract, Glycine Soja (Soybean) Sterols, Glycol Stearate, PEG-20 Methyl Glucose Sesquistearate, Sodium Benzoate, Behenyl Alcohol, Glycerin, Sodium Phytate, Polyquaternium-7, Tocopherol, Lecithin, Glyceryl Stearate, Retinyl Palmitate, Sorbic Acid, Fragrance (Parfum), Ethylhexylglycerin, Chlorphenesin, Citric Acid, Phenoxyethanol.\nBeard Lube® Conditioning Shave:\nWater, Cetearyl Alcohol, Macadamia Ternifolia Seed Oil, Behentrimonium Methosulfate, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Lecithin, Glycerin*, Mentha Piperita (Peppermint) Oil, Menthol, Eucalyptus Globulus Leaf Oil, Dimethicone, Phenyl Trimethicone, Calluna Vulgaris (Heather) Extract, Lecithin, Dimethiconol, Cyclopentasiloxane, Phenoxyethanol, Caprylyl Glycol, Caprylhydroxamic Acid.\nBeard Oil:\nCyclopentasiloxane, Dimethiconol, Hydrogenated Ethylhexyl Olivate, Jojoba Esters, C12-15 Alkyl Benzoate, Vitis Vinifera (Grape) Seed Oil, Caprylic/Capric Triglyceride, Argania Spinosa Kernel Oil, Olea Europaea (Olive) Fruit Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Olive Oil Unsaponifiables, Oryza Sativa (Rice) Bran Oil, Butyrospermum Parkii (Shea) Butter, Citrullus Lanatus (Watermelon) Seed Oil, Tocopherol, Daucus Carota Sativa (Carrot) Root Extract, Rosmarinus Officinalis (Rosemary) Leaf Oil, Moringa Oleifera Seed Oil, Sclerocarya Birrea Seed Oil, Adansonia Digitata Seed Oil, Schinziophyton Rautanenii Kernel Oil, Helianthus Annuus (Sunflower) Seed Oil, Geranium Maculatum Oil, Prunus Insititia Seed Oil, Anthemis Nobilis Flower Oil, Fucus Vesiculosus Extract, Glycine Soja (Soybean) Oil, Beta-Carotene.\n",
        "n_loves": "6.3K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-black-reserve-body-lotion-P465765",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:03:55",
        "product_name": "Black Reserve Body Lotion",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:80%",
        "product_reviews": "2",
        "ingredients": " -Shea Butter: Provides essential fatty acids to moisturize dry skin.-Olive Oil: Helps keep skin smooth and supple with nourishing vitamins and antioxidants.-Baobab Oil: Visibly rejuvenates skin with superior moisture.Water/Eau, Caprylic/Capric Triglyceride, Dimethicone, Glyceryl Stearate, PEG-100 Stearate, Glycerin, Butyrospermum Parkii (Shea) Butter, Olea Europaea (Olive) Fruit Oil, Adansonia Digitata Seed Oil, Moringa Oleifera Seed Oil, Sclerocarya Birrea Seed Oil, Xanthan Gum,Citric Acid, Cetearyl Alcohol, Caprylyl Glycol, Ceteth-10 Phosphate, Dicetyl Phosphate, Dimethicone Crosspolymer, Dimethiconol, Ammonium Acryloyldimethyltaurate/VP Copolymer, BHT, Fragrance (Parfum), Phenoxyethanol, Sodium Hydroxide, Tetrasodium EDTA. ",
        "n_loves": "258",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-pit-ctrl-aluminium-free-deodorant-P453685",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:04:06",
        "product_name": "Pit CTRL Aluminium-Free Deodorant",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2.75 oz/ 78 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2278604"
            }
        ],
        "rating": "width:76%",
        "product_reviews": "5",
        "ingredients": "-Baking Soda: Known for being highly effective in neutralizing odors.-Cornstarch: Known for odor and wetness absorption.-Enzymes: Neutralize and convert malodors. Propanediol, Aqua (Water/Eau), Glycerin, Sodium Stearate, Silica, Zinc Ricinoleate, Sodium Bicarbonate, Polyglyceryl-3 Caprate, Zea Mays (Corn/Blé) Starch, Sucrose Cocoate, Saccharomyces Ferment Filtrate, Citrus Grandis (Grapefruit/Pamplemousse) Seed Extract, Aloe Barbadensis (Aloe Vera) Leaf Juice Powder, Helianthus Annuus (Sunflower/Tournesol) Seed Oil*, Simmondsia Chinensis (Jojoba) Seed Oil*, Fragrance (Parfum), Tris-Bht-Mesitylene, Potassium Sorbate, Sodium Benzoate, Citric Acid, Benzyl Benzoate, Limonene, Linalool *Certified Organic/Certifiés Biologiques. ",
        "n_loves": "259",
        "categories": [
            "Bath & Body",
            "Body Care",
            "Deodorant & Antiperspirant"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-deep-dive-P454119",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:04:18",
        "product_name": "Deep Dive",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10 oz"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2224798"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "2",
        "ingredients": "Water (Aqua), Kaolin, Glycerin, Sodium Methyl Cocoyl Taurate, Magnesium Aluminum Siclicate, Volcanic Ash, Aveena Sativa (Oat) Kernel Meal, Sodium Chloride, Acrylates Copolymer, Glycolic Acid, Disodium Cocoamphodiacetate, Coconut Acid, Phenoxyethanol, Aloe Barbadensis (Aloe Vera) Leaf Juice, Caprylyl Glycol, Sodium Hydroxide, Ethylhexylglycerin, Hexylene Glycol, Panthenol, Epilobium Angustifolium Flower/Leaf/Stem Extract, Arnica Montana (Wolf’s Bane) Flower Extract, Allantoin, Tetrahexyldecyl Ascorbate, Tocopheryl Acetate, Helianthus Annuus (Sunflower) Seed Oil*, Calendula Officinalis (Pot Marigold) Flower Extract*, Chlorphenesin, Chamomilla Recutitia (Matricaria) Flower Extract*, Sodium Metabisulfite, Benzoic Acid, Sorbic Acid, Rosmarinus Officinalis (Rosemary) Leaf Extract*, Camellia Sinensis (Green Tea) Leaf Extract*, Olea Europaea (Olive) Leaf Extract*, Tocopherol.",
        "n_loves": "258",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/protein-booster-skin-serum-P236605",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:04:29",
        "product_name": "Protein Booster Skin Serum",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$84.00"
                ],
                "sku": "Item 1176163"
            }
        ],
        "rating": "width:93.636%",
        "product_reviews": "66",
        "ingredients": " -MATRIXYL® 3000:  Highly effective peptide that helps reduce the appearance of wrinkles by up to 45 percent.*-SYN®-AKE: Advanced myo-relaxing peptide smooths skin yielding up to a 52 percent reduction in the appearance of wrinkles*; mimics the activity of walgerin 1, a peptide found in the snake venom of the Temple Viper.-RENOVAGE®:  Patented anti-aging ingredient that reduces the appearance of pigmented spots by up to 56 percent and increases moisturization up to 58 percent.*-DYNALIFT®: Natural sorghum stalk juice tightens and smooths skin. *Based on supplier data. \nWater, Glycerin, Caprylic/Capric Triglyceride,\nAloe Barbadensis Leaf Juice*, Linum Usitatissimum (Linseed/Graine de\nlin) Seed Oil*, Camellia Sinensis Leaf Extract*, Cocos Nucifera (Coconut/\nNoix de coco) Oil*, Dipeptide Diaminobutyroyl Benzylamide Diacetate,\nSimmondsia Chinensis (Jojoba) Seed Oil, Sorghum Bicolor Stalk Juice,\nOrmenis Multicaulis Oil, Glycine Soja (Soybean/Graine de soja) Oil, Retinyl\nPalmitate, Zea Mays (Corn/Blé) Oil, Hamamelis Virginiana (Witch Hazel/\nHamamélis) Water, Lonicera Caprifolium (Honeysuckle/Chèvrefeuille)\nFlower Extract, Pelargonium Graveolens Flower Oil, Lonicera Japonica\n(Honeysuckle/Chèvrefeuille) Flower Extract, Rosmarinus Officinalis (Rosemary/\nRomarin) Leaf Oil, Plantago Lanceolata Leaf Extract, Butylene\nGlycol, Caprylyl Glycol, Xanthan Gum, Polysorbate 20, Tocopherol, Ascorbyl\nPalmitate, Taurine, Sodium Hyaluronate, Teprenone, Citric Acid, Potassium\nSorbate, Carbomer, Palmitoyl Oligopeptide, Sodium Polystyrene\nSulfonate, Phenoxyethanol, Palmitoyl Tetrapeptide-7, Alcohol, Citronellol,\nTocopheryl Acetate, Geraniol, Linalool, Sodium Sulfite. *Certified Organic. \n",
        "n_loves": "6.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/clay-pomade-P395717",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:04:48",
        "product_name": "Clay Pomade",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.75 oz"
                ],
                "price": [
                    "$32.50"
                ],
                "sku": "Item 1692110"
            }
        ],
        "rating": "width:65.99999999999999%",
        "product_reviews": "10",
        "ingredients": "Water, Euphorbia Cerifera (Candelilla) Wax, Behenyl Alcohol, Tribehenin, Glycerin, PVP, Tridecyl Stearate, Propanediol, Steareth-21, Tridecyl Trimellitate, C32-36 Isoalkyl Stearate, Polyhydroxystearic Acid, Sorbitan Stearate, Steareth-2, Cetearyl Alcohol, Stearyl Behenate, Melaleuca Alternifolia (TEA Tree) Leaf Oil, Salvia Lavandulaefolia (Sage) Leaf Oil, Moringa Oleifera Seed Oil*, Sclerocarya Birrea Seed Oil*, Adansonia Digitata Seed Oil*, Schinziophyton Rautanenii Kernel Oil*, Citrus Grandis (Grapefruit) Peel Oil*, Lavandula Angustifolia (Lavender) Oil, Polysorbate 60, Camellia Sinensis Leaf Extract*, Macrocystis Pyrifera (Kelp) Extract*, Ocimum Basilicum (Basil) Leaf Extract*, Dipentaerythrityl Hexacaprylate/Hexacaprate, Polyglyceryl-3 Stearate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Caprylyl Glycol,  Aminomethyl Propanol, Disodium EDTA , Phenoxyethanol, Benzoic Acid, Sorbic Acid, Chlorphenesin,  Benzyl Alcohol, Limonene, Linalool. *Certified Organic.",
        "n_loves": "1.3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moisture-therapy-lip-balm-spf-25-P393297",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:05:01",
        "product_name": "Moisture Therapy Lip Balm SPF 25",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Matte finish - Standard size",
                "flag_label": null,
                "size": "Size 0.25 oz/ 7 g",
                "name": [
                    "Scent: Mint"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1524594"
            },
            {
                "swatch_group": "Matte finish - Standard size",
                "flag_label": null,
                "size": "Size 0.25 oz/ 7 g",
                "name": [
                    "Scent: Black Tea & Blackberry"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1524610"
            },
            {
                "swatch_group": "Matte finish - Standard size",
                "flag_label": null,
                "size": "Size 0.25 oz/ 7 g",
                "name": [
                    "Scent: Shea Butter & Vitamin E"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1524628"
            },
            {
                "swatch_group": "Matte finish - Standard size",
                "flag_label": null,
                "size": "Size 0.25 oz/ 7 g",
                "name": [
                    "Scent: Grapefruit"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1503689"
            },
            {
                "swatch_group": "Matte finish - Standard size",
                "flag_label": null,
                "size": "Size 0.25 oz/ 7g",
                "name": [
                    "Scent: Lemon"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1883461"
            }
        ],
        "rating": "width:93.18799999999999%",
        "product_reviews": "4.2K",
        "ingredients": " -Avobenzone 3.0% and Octinoxate 7.5%: Sunscreens.-Petrolatum 40.2%: Skin protectant.\nTheobroma Cacao (Cocoa) Seed Butter, Lanolin Oil, Beeswax, Ozokerite, Polyglyceryl-3 Beeswax, Flavor, Butyrospermum Parkii (Shea) Butter, C18-38 Alkyl Hydroxystearoyl Stearate, Persea Gratissima (Avocado) Oil, Tocopheryl Acetate, Cyclopentasiloxane, Microcrystalline Wax, Camellia Sinensis (Green Tea) Leaf Extract, Cyclohexasiloxane. *Certified Organic",
        "n_loves": "29K",
        "categories": [
            "Skincare",
            "Lip Balms & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-brightening-booster-vitamin-c-serum-P505253",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:05:15",
        "product_name": "Brightening Booster Vitamin C Serum",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$61.00"
                ],
                "sku": "Item 2676864"
            }
        ],
        "rating": "width:40%",
        "product_reviews": "1",
        "ingredients": "-Tetrahexyldecyl Ascorbate (10% THD-Ascorbate): Visibly improves skin brightness and pigmentation with continued use.-Black Myrobalan: Protects against free radical damage and has been shown to improve skin’s brightness with continued use.-Green Microalgae: Sustainably farmed; helps protect against the damaging effects of blue light.Aqua/Water/Eau, Tetrahexyldecyl Ascorbate, Propanediol, Glycerin, Caprylic/Capric Triglyceride, Dimethicone, Helianthus Annuus (Sunflower) Seed Oil, Arachidyl Alcohol, Terminalia Chebula Fruit Extract, Cetearyl Alcohol, Bis-PEG-18 Methyl Ether Dimethyl Silane, Phenoxyethanol, Behenyl Alcohol, Acetyl Zingerone, Arachidyl Glucoside, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Caprylyl Glycol, Dipropylene Glycol, Polyethylene Glycol Monomethyl Ether, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sodium Hydroxide, Tocopherol, Scenedesmus Rubescens Extract, Dimethiconol, Panthenol, Ethylhexylglycerin, Hydrogenated Lecithin, Sorbitan Olivate, Cetearyl Olivate, Disodium EDTA, Camellia Sinensis Leaf Extract, Olea Europaea (Olive) Fruit Oil, Linum Usitatissimum (Linseed) Seed Extract, Laminaria Digitata Extract, Punica Granatum Fruit Extract, Polysorbate 60, Sorbitan Isostearate.",
        "n_loves": "61",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/epic-moisture-mp10-nourishing-oil-P379573",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:05:28",
        "product_name": "Epic Moisture™ MP10™ Nourishing Oil",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz"
                ],
                "price": [
                    "$47.50"
                ],
                "sku": "Item 1531086"
            }
        ],
        "rating": "width:94.142%",
        "product_reviews": "140",
        "ingredients": " -Argan Oil: Intensely moisturizing and high in antioxidants, with skin-soothing, natural anti-inflammatory benefits.\n-Olive Fruit Oil: Emollient that softens the skin; penetrates the skin without clogging pores and provides relief for dry and sensitive skin.\n-Jojoba Oil: Smooths and softens skin; moisturizes and protects with a lubricating, protective cushion.\n-Grape Seed Oil: Smooths flyaways and frizz.\n Cyclopentasiloxane, Dimethiconol, Hydrogenated Ethylhexyl Olivate, Jojoba Esters, C12-15 Alkyl Benzoate, Vitis Vinifera (Grape) Seed Oil, Argania Spinosa (Argan) Kernel Oil, Olea Europaea (Olive) Fruit Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Olive Oil Unsaponifiables, Oryza Sativa (Rice) Bran Oil, Butyrospermum Parkii (Shea) Butter, Citrillus Ianatus (Watemelon) Seed Oil, Zingiber Officinale (Ginger) Root Extract, Prunus Insititia Seed Oil, Tocopheryl Acetate, Tocopherol, Moringa Oleifera Seed Oil*, Sclerocarya Birrea (Marula) Seed Oil*, Adansonia Digitata (Baobab) Seed Oil*, Fragrance (Parfum), Ascorbyl Palmitate, Retinyl Palmitate, Schinziophyton Rautanenii (Manketti) Kernel Oil*, Carthamus Tinctorius (Safflower) Seed Oil, Citral, Hexyl Cinnamal, Limonene, Linalool.\n*Certified organic \n",
        "n_loves": "7.7K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/sleek-finish-texture-cream-P78300",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:05:39",
        "product_name": "Sleek Finish Texture Cream",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:84.286%",
        "product_reviews": "14",
        "ingredients": "Water (Aqua), Cetyl Acetate, Propylene Glycol, Castor Isostearate Beeswax Succinate, Glyceryl Stearate, PEG-100 Stearate, Myristyl Alcohol, Cetyl Alcohol, VP/VA Copolymer, Phenyl Trimethicone, Lavandula Angustifolia (Lavender) Flower Water, Lanolin Oil, Rosmarinus Officinalis (Rosemary) Leaf Extract, Olea Europaea (Olive) Fruit Oil, Silk Amino Acids, Hydrolyzed Wheat Protein, Panthenol, Simmondsia Chinensis (Jojoba) Seed Oil, Geranium Maculatum (Geranium) Oil, Lecithin, Glycine Soja (Soybean) Oil, Acetylated Lanolin Alcohol, Isopropyl Lanolate, Diazolidinyl Urea, Triethanolamine, Carbomer, Methylparaben, Propylparaben.",
        "n_loves": "1.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/charcoal-body-bar-massaging-soap-P431732",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:05:50",
        "product_name": "Charcoal Body Bar Massaging Soap",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.75 oz/ 135 g"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2083814"
            }
        ],
        "rating": "width:94.39999999999999%",
        "product_reviews": "25",
        "ingredients": " -Charcoal: Deodorizes skin and removes buildup by drawing it to the surface of the skin.-Glycerin: Draws moisture from the air and helps keep that moisture in skin.-Jojoba Beads: Exfoliate skin to remove dead skin cells and smooth skin.-Seaweed Extract: Features anti-inflammatory properties to soothe skin and reduce irritation. Sodium Palmate*, Sodium Cocoate, Water, Glycerin, Fragrance, Jojoba Esters, Saccharomyces Ferment, Carbon, Hypnea Musciformis Extract, Gelidiella Acerosa Extract, Sargassum Filipendula Extract, Sodium Chloride, Sodium Gluconate, Sorbitol, Iron Oxides (CI 77499), Pentasodium Pentetate, Tetrasodium Etidronate, Phenoxyethanol, Ethylhexylglycerin, Benzyl Benzoate, Benzyl, Salicylate, Citral, Citronellal, Coumarin, Eugenol, Hexyl Cinnamal, Limonene, Linalool.*From Rainforest Alliance Certified™ farms.",
        "n_loves": "3.6K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-turbo-body-spray-P454117",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:06:02",
        "product_name": "Turbo Body Spray",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 3.4 oz",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$48.50"
                ],
                "sku": "Item 2224780"
            }
        ],
        "rating": "",
        "product_reviews": "",
        "ingredients": "Alcohol Denat., Aqua, Parfum.",
        "n_loves": "133",
        "categories": [
            "Men",
            "Other Needs",
            "Body Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/head-to-toe-jack-P506112",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:06:13",
        "product_name": "Head-To-Toe Jack",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "Turbo Wash Energizing Cleanser: Aqua (Water/Eau), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, PEG-120 Methyl Glucose Dioleate, Fragrance (Parfum), Lauryl Glucoside, Ethylhexylglycerin, Rosmarinus Officinalis (Rosemary/Romarin) Leaf Extract, Eucalyptus Globulus Leaf Extract, Juniperus Communis Fruit Extract, Ocimum Basilicum (Basil/Basilic) Leaf Extract*, Camellia Sinensis (Green Tea/Thé vert) Extract*, Laminaria Digitata Extract*, Aloe Barbadensis Leaf Juice Powder, Helianthus Annuus (Sunflower/Tournesol) Seed Oil, Helianthus Annuus (Sunflower/Tournesol) Extract, Butyrospermum Parkii (Shea/Karité) Butter, Arnica Montana Flower Extract, Citrus Grandis (Grapefruit/Pamplemousse) Fruit Extract, Oryza Sativa (Rice/Riz) Bran Extract, Thymus Vulgaris (Thyme/Thym) Leaf Extract, Ascorbic Acid, Ascorbyl Palmitate, Hydrolyzed Jojoba Protein, Panthenol, Retinyl Palmitate, Tocopheryl Acetate, Tocopherol, Glycerin, Glycol Stearate, Glycol Distearate, C18-26 Olefin, Citric Acid, PEG-20 Methyl Glucose Sesquistearate, Polyquaternium-7, Sodium Benzoate, Sorbic Acid, Sodium Phytate, Sodium Chloride, Chlorphenesin, Phenoxyethanol, Limonene, Linalool*Certified OrganicTurbo Body Lotion™ Energizing Gel Moisturizer: Aqua/Water/Eau, Dimethicone, Propanediol, Helianthus Annuus (Sunflower) Seed Oil*, Glycerin, Lauryl Laurate, Eucalyptus Globulus Leaf Oil, Opuntia Ficus-Indica Seed Oil*, Aloe Barbadensis Leaf Juice Powder*, Arnica Montana Flower Extract, Fragrance (Parfum), Carbomer, Sodium Gluconate, Dimethicone Crosspolymer, Xanthan Gum, Sodium Hydroxide, Phenoxyethanol, Ethylhexylglycerin, Limonene, Benzyl Benzoate, Linalool*Certified OrganicPit Boss® Antiperspirant & Deodorant: Aluminum Zirconium Tetrachlorohydrex Gly 20% (anhydrous) Antiperspirant, Cyclopentasiloxane, PPG-14 Butyl Ether, Stearyl Alcohol, Dimethicone, C12-15 Alkyl Benzoate, Hydrogenated Castor Oil, Fragrance, Aloe Barbadensis Leaf Juice, Behenyl Alcohol, Glycerin, Helianthus Annuus (Sunflower) Seed Oil, Silica, Steareth-100, Tocopheryl Acetate",
        "n_loves": "78",
        "categories": [
            "Bath & Body",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/double-duty-tm-face-moisturizer-spf-20-duo-P506486",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:06:24",
        "product_name": "Double Duty™ Face Moisturizer SPF 20 Duo",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "",
        "product_reviews": "",
        "ingredients": "Aqua (Water), Cyclopentasiloxane, Octyldodecyl Neopentanoate, Phenethyl Benzoate, Dimethicone, Glycereth-26, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Phenoxyethanol, Hydroxypropyl Starch Phosphate, Cetearyl Glucoside, Carbomer, Pyrus Malus (Apple) Fruit Extract, Butylene Glycol, Sodium Hydroxide, Disodium EDTA, Sodium Hyaluronate, Lavandula Angustifolia (Lavender) Oil, Iodopropynyl Butylcarbamate, Pelargonium Graveolens Flower Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Lecithin, Melissa Officinalis Extract, Haslea Ostrearia Extract, Palmaria Palmata Extract, Calendula Officinalis Flower Extract,* Glycerin, Leontopodium Alpinum (Edelweiss) Extract,* Retinyl Palmitate, Tocopheryl Acetate, Anthemis Nobilis Flower Oil, Peucedanum Ostruthium Leaf Extract,* Buddleja Davidii Leaf Extract,* Artemisia Umbelliformis Extract.**Certified Organic.",
        "n_loves": "65",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/beard-oil-P399986",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:06:34",
        "product_name": "Beard Oil",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 1742659"
            }
        ],
        "rating": "width:91.20799999999998%",
        "product_reviews": "91",
        "ingredients": "Cyclopentasiloxane, Dimethiconol, Hydrogenated Ethylhexyl Olivate, Jojoba Esters, C12-15 Alkyl Benzoate, Vitis Vinifera (Grape) Seed Oil, Caprylic/Capric Triglyceride, Argania Spinosa Kernel Oil, Olea Europaea (Olive) Fruit Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Olive Oil Unsaponifiables,  Oryza Sativa (Rice) Bran Oil, Butyrospermum Parkii (Shea) Butter, Citrullus Lanatus (Watermelon) Seed Oil, Tocopherol, Daucus Carota Sativa (Carrot) Root Extract, Rosmarinus Officinalis (Rosemary) Leaf Oil, Moringa Oleifera Seed Oil*, Sclerocarya Birrea Seed Oil*, Adansonia Digitata Seed Oil*, Schinziophyton Rautanenii Kernel Oil*, Helianthus Annuus (Sunflower) Seed Oil, Geranium Maculatum Oil, Prunus Insititia Seed Oil, Anthemis Nobilis Flower Oil, Fucus Vesiculosus Extract, Glycine Soja (Soybean) Oil, Beta-Carotene. *Certified Organic. ",
        "n_loves": "6.9K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Face Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-nightmode-tm-lip-treatment-P504700",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:06:46",
        "product_name": "NightMode™ Lip Treatment",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.25 oz / 7 mL"
                ],
                "price": [
                    "$16.50"
                ],
                "sku": "Item 2563468"
            }
        ],
        "rating": "width:72.72800000000001%",
        "product_reviews": "11",
        "ingredients": "-Hyaluronic Acid: Enhanced hydration for the lips-Tripeptide-1: Improves lip appearance by keeping lips looking healthy, soft, hydrated, and full.-Manuka Honey: Soothes and helps repair the skin.Petrolatum, Lanolin, Theobroma Cacao (Cocoa) Seed Butter, Cera Alba/Beeswax/Cire d’abeille, Ozokerite, Polyglyceryl-3 Beeswax, Butyrospermum Parkii (Shea) Butter, Mel/Honey/Miel, Isohexadecane, Hydrogenated Vegetable Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, C18-38 Alkyl Hydroxystearoyl Stearate, Persea Gratissima (Avocado) Oil, Sodium Hyaluronate, Chamomilla Recutita (Matricaria) Flower Extract, Tripeptide-1, Tocopheryl Acetate, Ethylene/Propylene/Styrene Copolymer, Cera Microcristallina/Microcrystalline Wax/Cire microcristalline, Butylene/Ethylene/Styrene Copolymer, Potassium Carbonate, Xanthan Gum.",
        "n_loves": "803",
        "categories": [
            "Makeup",
            "Lip",
            "Lip Balms & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/clean-break-oil-free-moisturizer-P409928",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:06:58",
        "product_name": "Clean Break™ Oil-Free Moisturizer",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.3 oz/ 98 mL"
                ],
                "price": [
                    "$40.50"
                ],
                "sku": "Item 1692144"
            }
        ],
        "rating": "width:88.602%",
        "product_reviews": "93",
        "ingredients": "Water, Cyclopentasiloxane, Octyldodecyl Neopentanoate, Niacinamide, Sodium Hyaluronate, Camellia Sinensis (White Tea) Extract*, Macrocystis Pyrifera (Sea Kelp) Extract*, Ocimum Basilicum (Basil) Extract*, Tocopheryl Acetate, Glycerin, Dimethicone, Glycereth-26, Cetearyl Glucoside, Carbomer, Hydroxypropyl Starch Phosphate, Hydroxyethyl Acrylate/Sodium Acryloyl Dimethyl Taurate Copolymer, Undecylenoyl Glycine, Disodium EDTA, Butylene Glycol, Capryloyl Glycine, Sodium Hydroxide, Phenoxyethanol. *Certified Organic.",
        "n_loves": "6.9K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/performance-remedy-turbo-wash-energizing-cleanser-for-hair-body-P259950",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:07:10",
        "product_name": "Performance Remedy™ Turbo Wash™  Energizing Cleanser for Hair & Body",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 33 oz/ 976 mL"
                ],
                "price": [
                    "$70.00"
                ],
                "sku": "Item 1475805"
            }
        ],
        "rating": "width:92.58800000000001%",
        "product_reviews": "143",
        "ingredients": "Water, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Lauryl Glucoside, Dimethyl Sulfone, Thymus Vulgaris (Thyme) Flower/Leaf Extract, Helianthus Annuus (Sunflower) Seed Oil*, Linum Usitatissimum (Linseed) Seed Extract*, Punica Granatum Extract*, Olea Europaea (Olive) Fruit Extract*, Rosemarinus Officinalis (Rosemary) Leaf Oil, Eucalyptus Globulus Lead Oil, I-Menthol, Abies Balsamea (Fir Balsam) L. Mill, Lavandula Angustifola (Lavender) Oil, Juniperus Communis (Juniper Berry) Fruit Oil, Laminaria Digitata Extract*, Morinda Citrifolia Extract*, Camellia Sinensis Leaf Extract*, Arnica Montana Flower Extract, Panthenol, Hydrolyzed Wheat Protein, Butyrospermum Parkii (Shea Butter), Aloe Barbadensis Leaf Juice*, Ascorbic Acid, Phospholipids, Tocopheryl Acetate, Retinyl Palmitate, Ascorbyl Palmitate, Citrus Grandis (Grapefruit) Seed Extract, PEG-20 Methyl Glucose Sesquistearate, Glycerin, PEG-150 DistearateTetrasodium EDTA, Citric Acid, Polyquaternium-7, Sodium Hydroxymethylglycinate, Phenoxyethanol, Methyldihydrojasmonate, Dihydro Pentamethylindanone, Sodium Chloride, Glycol Stearate. \n\n*Certified Organic",
        "n_loves": "9K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/big-sir-body-hair-cleanser-P503351",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:07:21",
        "product_name": "Big Sir Body & Hair Cleanser",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "",
        "product_reviews": "",
        "ingredients": "-Aloe Vera: Soothes, calms, and softens the skin.-Glycerin: Helps maintain the skin's moisture balance.-Panthenol (Pro-Vitamin B5): Provides lightweight moisturization.Aqua/Water/Eau, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Fragrance (Parfum), Lauryl Glucoside, Acrylates Crosspolymer-4, Ethylhexylglycerin, Glycerin, Aloe Barbadensis Leaf Juice, Helianthus Annuus (Sunflower) Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Hydrolyzed Jojoba Protein, Citrus Grandis (Grapefruit) Fruit Extract, Juniperus Communis Fruit Extract, Arnica Montana Flower Extract, Thymus Vulgaris (Thyme) Leaf Extract, Eucalyptus Globulus Leaf Extract, Tocopherol, Helianthus Annuus (Sunflower) Seed Oil, Panthenol, Oryza Sativa (Rice) Bran Extract, Butyrospermum Parkii (Shea) Butter, Camellia Sinensis Leaf Extract*, Ocimum Basilicum (Basil) Leaf Extract*, Laminaria Digitata Extract*, Phenoxyethanol, Alcohol, Glycol Distearate, Chlorphenesin, PEG-20 Methyl Glucose Sesquistearate, Glycol Stearate, Sorbic Acid, Sodium Benzoate, Sodium Phytate, Polyquaternium-7, Citric Acid, Alpha-Isomethyl Ionone, Tocopheryl Acetate, Ascorbic Acid, Ascorbyl Palmitate, Retinyl Palmitate, Sodium Chloride, PEG-120 Methyl Glucose Dioleate, Limonene, Linalool, Citronellol, Benzyl Salicylate *Certified Organic.",
        "n_loves": "170",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/the-acne-remedy-collection-set-P502159",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:07:39",
        "product_name": "The Acne Remedy Collection Set",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$88.00"
                ],
                "sku": "Item 2628477"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "2",
        "ingredients": "-Salicylic Acid: Improves the look of acne blemishes and blackheads and cares for skin.-Sulfur 10%: A blemish-fighting mineral.Balancing Foam Cleanser:Salicylic Acid 0.5%, Water, Disodium Cocoamphodiacetate, Cocamidopropyl Betaine, Butylene Glycol, Glycerin, Propanediol, Lactic Acid, Sodium Chloride, Phenoxyethanol, Cocamidopropyl PG-Dimonium Chloride Phosphate, Ethylhexylglycerin, Bisabolol, Curcuma Longa (Turmeric) Root Extract, Aloe Barbadensis Leaf Juice, Camellia Sinensis Leaf Extract.Overnight Repair Moisturizer:Salicylic Acid 1.0%, Water, Dimethicone, Butylene Glycol, Pentylene Glycol, Glycerin, Cetearyl Alcohol, Polyacrylate Crosspolymer-6, Lactic Acid, Tribehenin PEG-20 Esters, Glycolic Acid, Propanediol, Sodium Hydroxide, Caprylic/Capric Triglyceride, Malic Acid, Mandelic Acid, Phenoxyethanol, Citric Acid, Tartaric Acid, Polysilicone-11, Carbomer, Phytic Acid, Dipropylene Glycol, Astragalus Membranaceus Root Extract, Bisabolol, Ethylhexylglycerin, Lecithin, Curcuma Longa (Turmeric) Root Extract, Hydroxycinnamic Acid, Rutin, Decyl Glucoside, Sodium Hyaluronate, Aloe Barbadensis Leaf Juice, Camellia Sinensis Leaf Extract.Clearing Spot Treatment:Sulfur 10.0%, Water, C12-15 Alkyl Benzoate, Glycerin, Caprylic/Capric Triglyceride, Acacia Senegal Gum, Glyceryl Stearate, PEG-100 Stearate, Magnesium Aluminum Silicate, Pentylene Glycol, Phenoxyethanol, Sodium/Zinc Acryloyldimethyltaurate/Itaconate Copolymer, Butylene Glycol, Decylene Glycol, Sodium Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Xanthan Gum, Sodium PCA, Isohexadecane, Ganoderma Lucidum (Mushroom) Extract, Sodium Hydroxide, Bisabolol, Ethylhexylglycerin, Polysorbate 80, Lysine, Propanediol, Aloe Barbadensis Leaf Juice, Tetrasodium Glutamate Diacetate, Curcuma Longa (Turmeric) Root Extract, 10-Hydroxydecanoic Acid, Sebacic Acid, 1,10-Decanediol, Magnesium Chloride, Sodium Chloride, Potassium Chloride, Zinc Chloride, Camellia Sinensis Leaf Extract.",
        "n_loves": "148",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/back-to-school-bundle-P502206",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:07:56",
        "product_name": "Back To School Bundle",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:80%",
        "product_reviews": "2",
        "ingredients": "Beard Lube® Conditioning Shave:Aqua (Water/Eau), Cetearyl Alcohol, Macadamia Ternifolia Seed Oil, Behentrimonium Methosulfate, Glycerin, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Lecithin, Mentha Piperita (Peppermint/Menthe poivrée) Oil, Menthol, Eucalyptus Globulus Leaf/Twig Oil, Dimethicone, Phenyl Trimethicone, Calluna Vulgaris (Heather/Bruyère) Extract, Lecithin, Dimethiconol, Cyclopentasiloxane, Caprylyl Glycol, Hexylene Glycol, Ethylhexylglycerin, Tocopherol, Phenoxyethanol, Limonene.Beard Oil:Cyclopentasiloxane, Dimethiconol, Hydrogenated Ethylhexyl Olivate, Jojoba Esters, C12-15 Alkyl Benzoate, Vitis Vinifera (Grape) Seed Oil, Caprylic/Capric Triglyceride, Argania Spinosa Kernel Oil, Olea Europaea (Olive) Fruit Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Olive Oil Unsaponifiables, Oryza Sativa (Rice) Bran Oil, Butyrospermum Parkii (Shea) Butter, Citrullus Lanatus (Watermelon) Seed Oil, Tocopherol, Daucus Carota Sativa (Carrot) Root Extract, Rosmarinus Officinalis (Rosemary) Leaf Oil, Moringa Oleifera Seed Oil, Sclerocarya Birrea Seed Oil, Adansonia Digitata Seed Oil, Schinziophyton Rautanenii Kernel Oil, Helianthus Annuus (Sunflower) Seed Oil, Geranium Maculatum Oil, Prunus Insititia Seed Oil, Anthemis Nobilis Flower Oil, Fucus Vesiculosus Extract, Glycine Soja (Soybean) Oil, Beta-Carotene.Pure Clean Daily Facial Cleanser:Aqua (Water/Eau), Sodium C14-16 Olefin Sulfonate, Disodium Cocoamphodiacetate, Glycol Distearate, Glycerin, Sodium Chloride, Cocamidopropyl Betaine, Sodium Lauroyl Oat Amino Acids, Aloe Barbadensis Leaf Juice Powder, Aloe Barbadensis Leaf Powder, Lavandula Angustifolia (Lavender/Lavande) Flower Extract, Salvia Officinalis (Sage/Sauge) Leaf Extract, Rosmarinus Officinalis (Rosemary/Romarin) Leaf Oil, Salvia Officinalis (Sage/Sauge) Oil, Backhousia Citriodora Leaf Oil, Hamamelis Virginiana (Witch Hazel/Hamamélis) Leaf Extract, Chamomilla Recutita Flower Extract, Benzyl Alcohol, Cetyl Alcohol, PEG-150 Distearate, Sodium PCA, Citric Acid, PEG-8 Dimethicone, Dehydroacetic Acid, Tocopherol, Phenoxyethanol.",
        "n_loves": "337",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/face-buff-energizing-scrub-P12571",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:08:06",
        "product_name": "Face Buff Energizing Scrub",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6 oz/ 177 mL"
                ],
                "price": [
                    "$40.50"
                ],
                "sku": "Item 1176205"
            }
        ],
        "rating": "width:95.246%",
        "product_reviews": "265",
        "ingredients": "Aqua (Water/Eau), Glyceryl Stearate, Hexylene Glycol, Polylactic Acid, Cetyl Alcohol, Ceteth-2, Disodium Cocoamphodiacetate, Sodium C14-16 Olefin Sulfonate, Menthyl Lactate, Caprylic/Capric Triglyceride, Allantoin, Mentha Piperita (Peppermint/Menthe poivrée) Oil, Glycerin*, Aloe Barbadensis (Aloe Vera) Leaf Juice*, Cucumis Sativus (Cucumber/Concombre) Fruit Extract*, Glycyrrhiza Glabra (Licorice/Réglisse) Root Extract*, Calendula Officinalis Flower Extract*, Squalane, Bambusa Arundinacea Stem Powder, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Magnesium Aluminum Silicate, Ascorbic Acid, Fragrance (Parfum), Polysorbate 60, Ethylhexylglycerin, Phenoxyethanol, Sodium Glycolate, Coconut Acid, Sodium Diglycolate, Hexadecene, Tetradecene, Myristyl Alcohol, Stearyl Alcohol, Sorbitan Isostearate, Titanium Dioxide, Sodium Sulfate, Quartz, Sodium Benzoate, Butylphenyl Methylpropional, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Benzyl Salicylate, Citronellol, Coumarin, Limonene, Geraniol, Hydroxycitronellal, Linalool.",
        "n_loves": "10.9K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/bump-fix-razor-bump-ingrown-hair-solution-P378718",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:08:20",
        "product_name": "Bump Fix™ Razor Bump & Ingrown Hair Solution",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6 oz/ 177 mL"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 1514017"
            }
        ],
        "rating": "width:77.606%",
        "product_reviews": "117",
        "ingredients": " -Salicylic Acid: Dissolves the top layer of dead skin cells and the facial oils that block pores.\n-Aloe Leaf: Calms, soothes, and softens the skin; acts as an anti-irritant on skin.\n-Certified Organic Chamomile Extract: Soothes and calms skin, reduces redness, and acts as an antiseptic. \n-Allantoin: Helps heal damaged skin.  \nWater, Alcohol Denat., Propylene Glycol, Salicylic Acid, Lactic Acid,  Sodium Bicarbonate, Methyl Gluceth-20, Sodium Hyaluronate, Allantoin, Aloe Barbadensis (Aloe Vera) Leaf Juice, Hamamelis Virginiana (Witch Hazel) Extract, Anthemis Nobilis (Chamomile) Extract*, Camellia Sinensis (Green Tea) Extract*, Epilobium Angustifolium (Willowherb) Extract, Galactoarabinan, Sodium Bisulfite, Sorbic Acid, Disodium EDTA.\n*Certified organic.\n",
        "n_loves": "16.5K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Scrub & Exfoliants"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pure-clean-daily-facial-cleanser-P381570",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:08:32",
        "product_name": "Pure Clean Daily Facial Cleanser",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6 oz/ 177 mL"
                ],
                "price": [
                    "$27.00"
                ],
                "sku": "Item 1387612"
            }
        ],
        "rating": "width:91.428%",
        "product_reviews": "266",
        "ingredients": " -Oat and Coconut derived surfactants: Work into a thick rich lather to gently cleanse skin and break down pore clogging residue.-Certified Organic Sage Leaf Extract: Provides antibacterial and anti-inflammatory benefits.-Certified Organic Chamomile Extract: Soothes calms and helps reduce redness and acts as an antiseptic.-Rosemary Extract: Helps control oiliness and fights bacteria on the skin's surface.-Witch Hazel: A natural astringent and antioxidant that acts as a toner and anti-irritant.-Aloe Leaf Extract: Helps soothe calm and soften skin.-Lavender Extract: A natural botanical that encourages healing and soothes skin. \n\n\n\nWater (Aqua), Sodium C14-16 Olefin Sulfonate, Disodium Cocoamphodiacetate, Aloe Barbadensis Leaf Juice*, Cocamidopropyl Betaine, Sodium Lauroyl Oat Amino Acids, Glycol Distearate, PEG-150 Distearate, Hamamelis Virginiana (Witch Hazel) Extract, Glycerin, Lavandula Angustifolia (Lavender) Extract*, Salvia Officinalis (Sage) Leaf Extract*, Chamomile Recutita (Matricaria) Flower Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Salvia Officinalis (Sage) Leaf Oil, Backhousia Citriodora Oil, PEG 8-Dimethicone, Sodium Chloride, Sodium PCA, Cetyl Alcohol, Citric Acid, Benzyl Alcohol, Dehydroacetic Acid. * Certified Organic.\n",
        "n_loves": "1.7K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-turbo-body-lotion-energizing-gel-moisturizer-with-eucalyptus-aloe-P476571",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:08:44",
        "product_name": "Turbo Body Lotion Energizing Gel Moisturizer with Eucalyptus & Aloe",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 16 oz/ 473 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$51.50"
                ],
                "sku": "Item 2483600"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "2",
        "ingredients": "Aqua/Water/Eau, Dimethicone, Propanediol, Helianthus Annuus (Sunflower) Seed Oil, Glycerin, Lauryl Laurate, Eucalyptus Globulus Leaf Oil, Opuntia Ficus-Indica Seed Oil, Aloe Barbadensis Leaf Juice Powder, Arnica Montana Flower Extract, Fragrance (Parfum), Carbomer, Sodium Gluconate, Dimethicone Crosspolymer, Xanthan Gum, Sodium Hydroxide, Phenoxyethanol, Ethylhexylglycerin, Limonene, Benzyl Benzoate, Linalool. ",
        "n_loves": "438",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/post-shave-cooling-gel-P381568",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:08:56",
        "product_name": "Post Shave Cooling Gel",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.3 oz/ 100 mL"
                ],
                "price": [
                    "$31.00"
                ],
                "sku": "Item 1387562"
            }
        ],
        "rating": "width:92.85799999999999%",
        "product_reviews": "70",
        "ingredients": "Purified Water, Glyceryl Polymethacrylate, Propylene Glycol, Glycerin, Polysorbate 20, Lavender (Lavandula Angustifolia) Oil, Witch Hazel (Hamamelis Virginiana) Extract, Camelia Oleifera Extract, Calendula Officinalis Extract, Willowherb (Epilobium Angustifolium) Extract, Comfrey (Symphytum Officinale) Extract, Fennel (Foeniculum Vlugare) Extract, Coltsfoot (Tussilago Farfara) Extract, Horsetail (Equisetum Arvense) Extract, Chamomile (Anthemis Nobilis) Extract, Sage (Salvia Officinalis) Extract, Rosemary (Rosmarinus Officinalis) Extract, Balm Mint (Melissa Officinalis) Extract, Aloe Barbadensis Gel, DMDM Hydantoin, Allantoin, Sodium Benzoate, Methylparaben, Propylparaben.",
        "n_loves": "1.2K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/double-header-shampoo-conditioner-P395117",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:09:07",
        "product_name": "Double Header™ Shampoo + Conditioner",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16 oz"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 1692094"
            }
        ],
        "rating": "width:83.75%",
        "product_reviews": "16",
        "ingredients": " -Creatine: Fortifies hair to increase strength and shine.-Coconut Oil: Deeply conditions and detangles.-Peppermint Oil: Stimulates and nourishes the scalp.-Organic Kelp: Packed with minerals to nourish and thicken.Water, Disodium Laureth Sulfosuccinate, Sodium Methyl Cocoyl Taurate, Cocamide MEA, Cocamidopropyl Hydroxysultaine, PEG-7 Glyceryl Cocoate, Amodimethicone, Sodium Lauryl Sulfoacetate,  Sodium Lauroyl Sarcosinate, Decyl Glucoside, Lauryl Glucoside, Glycerin,  Coconut Oil Glycereth-8 Esters, Dimethicone, Shea Butter Glycereth-8 Esters, Cocos Nucifera (Coconut) Water, Citrus Grandis (Grapefruit) Peel Oil*, Camellia Sinensis Leaf Extract*, Macrocystis Pyrifera (Kelp) Extract*, Ocimum Basilicum (Basil) Leaf Extract*, Cocos Nucifera (Coconut) Oil, Oryza Sativa (Rice) Extract, Hydrolyzed Lupine Protein, Oryza Sativa (Rice) Seed Protein, Salvia Lavandulaefolia (Sage) Leaf Oil, Phytic Acid, Creatine, Mentha Piperita (Peppermint) Oil, Panthenol, Citric Acid, Ethylhexylglycerin, Glycol Distearate, Acrylates Copolymer, Cetrimonium Chloride, Polyquaternium-10, Trideceth-12, Polyquaternium-7, C11-15 Pareth-7, Laureth-23, PEG-150 Distearate,  Laureth-4, Sodium Phytate, Laureth-9, Dipropylene Glycol, Cystine Bis-PG-Propyl Silanetriol, Sodium Hydroxide, BHT, Phenoxyethanol, Chlorphenesin, Potassium Sorbate, Sodium Benzoate, Benzyl Alcohol, Limonene, Linalool. *Certified Organic.",
        "n_loves": "2.2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-black-reserve-body-spray-P465764",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:09:19",
        "product_name": "Black Reserve Body Spray",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "Alcohol Denat., Water/Aqua, Fragrance (Parfum).",
        "n_loves": "213",
        "categories": [
            "Bath & Body",
            "Body Care",
            "Deodorant & Antiperspirant"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pit-boss-antiperspirant-deodorant-P381665",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:09:29",
        "product_name": "Pit Boss Antiperspirant & Deodorant",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.75 oz/ 78 g"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 1387687"
            }
        ],
        "rating": "width:88.12599999999999%",
        "product_reviews": "32",
        "ingredients": "Aluminum Zirconium Trichlorohydrex Gly 20% (anhydrous). Other Ingredients: Cyclopentasiloxane, Hydrogenated Polydecene, Stearyl Alcohol, Phenyl Trimethicone, Hydrogenated Castor Oil, Cetyl Alcohol, Silica, Fragrance, Panthenyl Triacetate, Bisabolol, Tocopheryl Acetate (Vitamin E).",
        "n_loves": "1.3K",
        "categories": [
            "Bath & Body",
            "Body Care",
            "Deodorant & Antiperspirant"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-overnight-repair-moisturizer-P477993",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:09:41",
        "product_name": "Overnight Repair Moisturizer",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 59 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 2500171"
            }
        ],
        "rating": "",
        "product_reviews": "",
        "ingredients": "-1% Salicylic Acid: Addresses acne blemishes and blackheads and allows skin to heal.-Hyaluronic Acid: Offers fast-absorbing hydration without clogging pores.Water, Dimethicone, Butylene Glycol, Pentylene Glycol, Glycerin, Cetearyl Alcohol, Polyacrylate Crosspolymer-6, Lactic Acid, Tribehenin PEG-20 Esters, Glycolic Acid, Propanediol, Sodium Hydroxide, Caprylic/Capric Triglyceride, Malic Acid, Mandelic Acid, Tartaric Acid, Phytic Acid, Astragalus Membranaceus Root Extract, Bisabolol, Curcuma Longa (Turmeric) Root Extract, Hydroxycinnamic Acid, Rutin, Sodium Hyaluronate, Aloe Barbadensis Leaf Juice, Camellia Sinensis Leaf Extract, Citric Acid, Decyl Glucoside, Lecithin, Phenoxyethanol, Polysilicone-11, Carbomer, Dipropylene Glycol, Ethylhexylglycerin.",
        "n_loves": "169",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/beard-lube-conditioning-shave-P12569",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:09:53",
        "product_name": "Beard Lube® Conditioning Shave",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16 oz/ 473 mL"
                ],
                "price": [
                    "$47.50"
                ],
                "sku": "Item 1222371"
            }
        ],
        "rating": "width:95.59200000000001%",
        "product_reviews": "481",
        "ingredients": "Water, Cetearyl Alcohol, Macadamia Ternifolia Seed Oil, Behentrimonium Methosulfate, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Lecithin, Glycerin*, Mentha Piperita (Peppermint) Oil*, Menthol, Eucalyptus Globulus Leaf Oil*, Dimethicone, Phenyl Trimethicone, Calluna Vulgaris (Heather) Extract, Lecithin, Dimethiconol, Cyclopentasiloxane, Caprylyl Glycol, Caprylhydroxamic Acid. *Certified Organic.",
        "n_loves": "8.9K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/beard-wash-P427514",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:10:05",
        "product_name": "Beard Wash",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6 oz/ 177 mL"
                ],
                "price": [
                    "$26.00"
                ],
                "sku": "Item 1966795"
            }
        ],
        "rating": "width:97.142%",
        "product_reviews": "28",
        "ingredients": " -Jojoba Protein: Provides water-binding properties that help maintain moisture in skin and hair.  -Panthenol: Helps strengthen and moisturize hair.   \n-Aloe: Soothes dryness and irritation of the skin beneath the beard.   \nWater, Lauryl Glucoside, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, PEG-120 Methyl Glucose Dioleate, Sodium Lauroyl Sarcosinate, Panthenol, Aloe Barbadensis Leaf Juice Powder, Glycerin, Butyrospermum Parkii (Shea) Butter, Helianthus Annuus (Sunflower) Seed Oil, Geranium Maculatum Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Anthemis Nobilis Flower Oil, Hydrolyzed Jojoba Protein, Macrocystis Pyrifera (Kelp) Extract*, Camellia Sinensis Leaf Extract*, Ocimum Basilicum (Basil) Leaf Extract*, Punica Granatum Extract, Oryza Sativa (Rice) Bran Extract, Helianthus Annuus (Sunflower) Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Citrus Grandis (Grapefruit) Fruit Extract, Hydrolyzed Linseed Extract, PEG-20 Methyl Glucose Sesquistearate, Glycol Stearate, Caprylic/Capric Triglyceride, Ethylhexylglycerin, Sodium Phytate, Polyquaternium-7, Tocopherol, Ascorbyl Palmitate, Retinyl Palmitate, Tocopheryl Acetate, Ascorbic Acid, Citric Acid, Phenoxyethanol, Chlorphenesin, Sodium Benzoate, Sorbic Acid, Citronellol, Geraniol.\n",
        "n_loves": "2.9K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/jack-black-skin-saviors-tm-set-P505337",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:10:16",
        "product_name": "Skin Saviors™ Set",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "-2.2% Avobenzone and 7.5% Octinoxate: Provide sun protection.Pure Clean Daily Facial Cleanser:Aqua (Water/Eau), Sodium C14-16 Olefin Sulfonate, Disodium Cocoamphodiacetate, Glycol Distearate, Glycerin, Sodium Chloride, Cocamidopropyl Betaine, Sodium Lauroyl Oat Amino Acids, Aloe Barbadensis Leaf Juice Powder*, Aloe Barbadensis Leaf Powder *, Lavandula Angustifolia (Lavender/Lavande) Flower Extract*, Salvia Officinalis (Sage/Sauge) Leaf Extract*, Rosmarinus Officinalis (Rosemary/Romarin) Leaf Oil, Salvia Officinalis (Sage/Sauge) Oil, Backhousia Citriodora Leaf Oil, Hamamelis Virginiana (Witch Hazel/Hamamélis) Leaf Extract, Chamomilla Recutita Flower Extract, Benzyl Alcohol, Cetyl Alcohol, PEG-150 Distearate, Sodium PCA, Citric Acid, PEG-8 Dimethicone, Dehydroacetic Acid, Tocopherol, Phenoxyethanol *Certified Organic.Face Buff Energizing Scrub:Aqua/Water/Eau, Glyceryl Stearate, Bambusa Arundinacea Stem Powder, Hexylene Glycol, Cetyl Alcohol, Disodium Cocoamphodiacetate, Sodium C14-16 Olefin Sulfonate, Menthyl Lactate, C15-19 Alkane, Aloe Barbadensis Leaf Juice*, Cucumis Sativus (Cucumber/Concombre) Fruit Extract*, Glycyrrhiza Glabra (Licorice/Réglisse) Root Extract*, Calendula Officinalis Flower Extract*, Glycerin*, Mentha Arvensis Leaf Oil, Allantoin, Squalane, Citric Acid, Sodium Chloride, Magnesium Aluminum Silicate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Fragrance (Parfum), Phenoxyethanol, Ethylhexylglycerin, Stearyl Alcohol, Myristyl Alcohol, Polysorbate 60, Ascorbic Acid, Linalool, Benzyl Salicylate, Citronellol, Coumarin. 22008 *Certified Organic.Double-Duty Face Moisturizer SPF 20:Avobenzone 2.2%, Octinoxate 7.5%, Inactive Ingredients: Aqua (Water/Eau), Cyclopentasiloxane, Octyldodecyl Neopentanoate, Phenethyl Benzoate, Dimethicone, Glycereth-26, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Phenoxyethanol, Hydroxypropyl Starch Phosphate, Cetearyl Glucoside, Carbomer, Pyrus Malus (Apple/Pomme) Fruit Extract, Butylene Glycol, Sodium Hydroxide, Disodium EDTA, Sodium Hyaluronate, Lavandula Angustifolia (Lavender/Lavande) Oil, Iodopropynyl Butylcarbamate, Pelargonium Graveolens Flower Oil, Rosmarinus Officinalis (Rosemary/Romarin) Leaf Oil, Lecithin, Melissa Officinalis Extract, Haslea Ostrearia Extract, Palmaria Palmata Extract, Calendula Officinalis Flower Extract*, Glycerin, Leontopodium Alpinum (Edelweiss) Extract*, Retinyl Palmitate, Tocopheryl Acetate, Anthemis Nobilis Flower Oil, Peucedanum Ostruthium Leaf Extract*, Buddleja Davidii Leaf Extract*, Artemisia Umbelliformis Extract* *Certified Organic/Certifiés Organiques.Moisture Therapy Lip Balm SPF 25, Natural Mint:Avobenzone 3.0%, Octinoxate 7.5%, Petrolatum 40.2%, Inactive Ingredients: Theobroma Cacao (Cocoa/Cacao) Seed Butter, Lanolin Oil, Beeswax, Ozokerite, Polyglyceryl-3 Beeswax, Flavor, Butyrospermum Parkii (Shea/Karité) Butter, C18-38 Alkyl Hydroxystearoyl Stearate, Persea Gratissima (Avocado/Avocat) Oil, Tocopheryl Acetate, Cyclopentasiloxane, Microcrystalline Wax, Camellia Sinensis (Green Tea/Thé Vert) Leaf Extract *Certified Organic/Certifiés Organiques.As part of Jack Black’s commitment to always offer the highest quality products, some of the ingredients in these formulations may be updated from time to time. The ingredient list shown here may vary from product packaging, depending on the location and timing of purchase. In addition, packaging may have also been updated from what appears on the Jack Black website.",
        "n_loves": "425",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cool-moisture-body-lotion-P96809",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:10:26",
        "product_name": "Cool Moisture Body Lotion",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16 oz/ 473 mL"
                ],
                "price": [
                    "$43.50"
                ],
                "sku": "Item 826867"
            }
        ],
        "rating": "width:91.464%",
        "product_reviews": "82",
        "ingredients": "Water, Glycine Soja (Soybean) Oil, Cyclopentasiloxane, Ethylhexyl Palmitate, Glycerin, Propylene Glycol, Stearic Acid, Stearate 2, Searate 21, Tocopheryl Acetate (Vitamin E Acetate), Simmondsia Chinensis (Jojoba) Oil, Hydrolyzed Soy Protein, Cetyl Alcohol, Biosaccharide Gum-1, Carbomer, Dimethicone, Menthyl Lactate, Tetrasodium EDTA, Triethanolamine, Phenoxyethanol, Methylparaben, Propylparaben, Fragrance.",
        "n_loves": "3.3K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/eye-balm-de-puffing-cooling-gel-P12570",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:10:39",
        "product_name": "Eye Balm De-Puffing & Cooling Gel",
        "brand_name": "Jack Black",
        "options": [],
        "rating": "width:84.314%",
        "product_reviews": "51",
        "ingredients": "Water, Glyceryl Polymethacrylate, Butylene Glycol, Glycerin, Panthenol, Sodium Hyaluronate, Retinyl Palmitate, Centaurea Cyanus Flower Extract, Chamomilla Recutita (Matricaria) Extract, L-Ascorbic Acid, Vitis Vinifera (Grape) Seed Extract, Calendula Officinalis Flower Extract, Leontopodium Alpinum (Edelweiss) Extract*, Peucedanum Ostruthium Leaf Extract*, Buddleja Davidii Leaf Extract*, Artemisia Umbelliformis Extract*, Tocopheryl Acetate, Guaiazulene, Phenoxyethanol, Iodopropynyl Butylcarbamate, Polysorbate 20.\n\n*Certified Organic Ingredient\n",
        "n_loves": "5.1K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/clearing-spot-fix-P502174",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:10:49",
        "product_name": "Clearing Spot Fix",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz / 150 mL"
                ],
                "price": [
                    "$27.00"
                ],
                "sku": "Item 2629731"
            }
        ],
        "rating": "",
        "product_reviews": "",
        "ingredients": "-Sulfur 10%: A blemish-fighting mineral.Sulfur 10.0%, Water, C12-15 Alkyl Benzoate, Glycerin, Caprylic/Capric Triglyceride, Acacia Senegal Gum, Glyceryl Stearate, PEG-100 Stearate, Magnesium Aluminum Silicate, Pentylene Glycol, Ganoderma Lucidum (Mushroom) Extract, Curcuma Longa (Turmeric) Root Extract, Bisabolol, Aloe Barbadensis Leaf Juice, Sodium PCA, Magnesium Chloride, Sodium Chloride, Potassium Chloride, Zinc Chloride, Lysine, Camellia Sinensis Leaf Extract, Sebacic Acid, Isohexadecane, Tetrasodium Glutamate Diacetate, 10-Hydroxydecanoic Acid, 1,10-Decanediol, Sodium/Zinc Acryloyldimethyltaurate/Itaconate Copolymer, Butylene Glycol, Decylene Glycol, Sodium Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Xanthan Gum, Polysorbate 80, Propanediol, Sodium Hydroxide, Phenoxyethanol, Ethylhexylglycerin.",
        "n_loves": "404",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/nourishing-hair-scalp-conditioner-P397025",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:11:00",
        "product_name": "Nourishing Hair & Scalp Conditioner",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10 oz"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 1692086"
            }
        ],
        "rating": "width:95.17200000000001%",
        "product_reviews": "29",
        "ingredients": " -Pro-Vitamin B5: Adds volume and shine. \n- Biotin: Helps strengthen and reduce frizz.\n-Tea Tree Leaf Oil: Reduces itching and dryness.  \n-Organic Basil Leaf: Soothes.\n\n Water, Cetearyl Alcohol, Behentrimonium Chloride, Cetrimonium Chloride, Panthenol, Ocimum Basilicum (Basil ) Extract*, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Mentha Piperita (Peppermint) Oil, Macrocystis Pyrifera (Kelp) Extract*, Helianthus Annuus (Sunflower) Seed Oil*, Salvia Officinalis (Sage) Oil, Panax Ginseng Root Extract, Citrus Grandis (Grapefruit) Peel Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Mentha Arvensis Oil, Daucus Carota Sativa (Carrot) Root Extract, Oryza Sativa (Rice) Extract, Hydrolyzed Rice Protein, Hydrolyzed Lupine Protein, Hydrolyzed Silk, Biotin, (Organic) Glycerin*, Spirulina Maxima Extract, Symphytum Officinale Leaf Extract, Aloe Barbadensis Leaf Extract, Camellia Sinensis Leaf Extract, Macrocystis Pyrifera Extract, Euterpe Oleracea Fruit Extract, Cysteine, Dimethicone, Citric Acid, Glycerin, Hyaluronic Acid, Sodium Hyaluronate, Menthoxypropanediol, Ethylhexylglycerin, Guar Hydroxypropyltrimonium Chloride, Propylene Glycol, Polyquaternium-24, Phenoxyethanol.*Certified Organic       \n",
        "n_loves": "3.5K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dry-erase-ultra-calming-face-cream-P397665",
        "error": "",
        "scrape_timestamp": "08/21/2023, 22:11:11",
        "product_name": "Dry Erase® Ultra-Calming Face Cream",
        "brand_name": "Jack Black",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.5 oz/ 74 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 1371533"
            }
        ],
        "rating": "width:90%",
        "product_reviews": "14",
        "ingredients": " -Hydromanil™ 10%: Deeply moisturizes.-SymRelief™ .2%: Naturally combats irritation and redness caused by environmental and chemical damage.-Vitamins C and E: Potent antioxidants that help repair environmental damage and discourage collagen degradation.-Aloe Vera Leaf Juice 10%: A natural emollient with hydrating, softening, and anti-inflammatory properties.Water, Aloe Barbadensis Leaf Juice, Caprylic/Capric Triglyceride, Oryza Sativa (Rice) Bran Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Glycerin, Glycereth-26, Persea Gratissima (Avocado) Oil, Butyrospermum Parkii (Shea) Butter, Cetearyl Olivate, Cetearyl Alcohol, Sorbitan Olivate, Dimethicone, Ammonium Acryloydimethyltaurate/VP Copolymer, Hydrolyzed Caesalpinia Spinosa Gum, Cetyl Palmitate, Ceteth-10 Phosphate, Dicetyl Phosphate, Sorbitan Palmitate, Cucumis Sativus (Cucumber) Fruit Extract, Caesalpinia Spinosa Gum, Arginine, Panthenol, Tetrahexyldecyl Ascorbate, Tocopheryl Acetate, Bisabolol, Zingiber Officinale (Ginger) Root Extract, Camellia Sinensis Leaf Extract*, Spirulina Maxima Extract*, Tetrapeptide-21, Ethylhexylglycerin, Hexylene Glycol, Caprylyl Glycol, Phenoxyethanol *Certified Organic.",
        "n_loves": "3K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    }
]