[
    {
        "url": "https://www.sephora.com/ca/en/product/rose-quartz-luminizer-P427727",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:08:11",
        "product_name": "Crystal Luminizer",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Radiant finish - Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 0.21 oz/6 g",
                "name": [
                    "Color: Rose Quartz - soft shimmering pink",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$37.00"
                ],
                "sku": "Item 2120483"
            }
        ],
        "rating": "width:77.352%",
        "product_reviews": "68",
        "ingredients": "\nClean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category – this is not an exhaustive list): \nAcrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytulolene (BHT) under 0.1% , Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Parrafin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos) , Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1, 4, Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1’4 Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%)",
        "n_loves": "13.8K",
        "categories": [
            "Makeup",
            "Face",
            "Highlighter"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/kora-organics-renewing-hand-body-wash-P502837",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:08:24",
        "product_name": "Renewing Hand & Body Wash",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10 oz / 300 mL"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2600302"
            }
        ],
        "rating": "width:50%",
        "product_reviews": "2",
        "ingredients": "-Cauliflower Mushroom: Rich in veratric acid for skin protection and hydration.-Aloe: Promotes hydration and includes calming and antioxidant soothing benefits. -Murumuru: Helps support natural skin barrier to prevent moisture loss.Aloe Barbadensis Leaf Juice*, Water/Aqua/Eau, Decyl Glucoside, Glycerin^, Coco-Glucoside, Xanthan Gum, Sodium Cocoyl Glutamate, Glyceryl Oleate, Saccharide Isomerate, Potassium Sorbate, Sodium Levulinate, Helianthus Annuus (Sunflower) Seed Oil*, Sodium Astrocaryum Murumuruate, Carrageenan, Citric Acid, Pelargonium Graveolens Flower Oil, Morinda Citrifolia Fruit Extract*, Glucose, Sodium Phytate, Sparassis Crispa Extract, Ocimum Basillicum (Basil) Oil, Rosa Centifolia Flower Oil, Sodium Citrate, Alcohol, Sodium Gluconate, Tocopherol, Hydrogenated Palm Glycerides Citrate, Citronellol**, Geraniol**. *Ingredients from Organic Farming. **From Essential Oils. ^Made with organic ingredients.99.6% natural origin of total. 71.2% of the total ingredients are from organic farming. 81.5% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com. WARNING: Product intended for cosmetic use only. If irritation occurs discontinue use. Store below 30°C / 86°F. Keep out of reach of children. Avoid contact with eyes.***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.***Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "1.6K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/kora-organics-noni-night-aha-resurfacing-serum-P455241",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:08:37",
        "product_name": "Noni Night AHA Pore & Resurfacing Serum",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1.01 oz/ 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$96.00"
                ],
                "sku": "Item 2332724"
            }
        ],
        "rating": "width:87.892%",
        "product_reviews": "555",
        "ingredients": "-Lemon Peel Ferment: Provides a natural source of AHA, visibly refining and balancing the complexion.-Tonka Bean Bio-Ferment: Contains high levels of polyphenols with antioxidant benefits that defy visible signs of aging.-Willow Bark Extract: Gently exfoliates to reveal fresh, visibly glowing skin.Aloe Barbadensis Leaf Juice*, Lactic Acid, Persea Gratissima (Avocado) Oil*, Water/Aqua/Eau, Lactobacillus Ferment, Vitis Vinifera (Grape) Juice Extract, Glycerin, Glyceryl Stearate Citrate, Potassium Hydroxide, Sodium Stearoyl Glutamate, Helianthus Annuus (Sunflower) Seed Oil*, Brassica Alcohol, Lactobacillus/Dipteryx Odorata Seed Ferment Filtrate, Polyglyceryl-3 Stearate, Lactobacillus, Lysolecithin, Sclerotium Gum, Xylityl Sesquicaprylate, Jojoba Esters, Hydrogenated Lecithin, Pullulan, Xanthan Gum, Cocos Nucifera (Coconut) Fruit Extract, Potassium Sorbate, Citrus Aurantium (Neroli) Flower Oil*, Willow Bark Extract, Anhydroxylitol, Microcitrus Australasica Fruit Extract, Tocopherol, Lactobacillus/Lemon Peel Ferment Extract, Morinda Citrifolia Fruit Extract*, Silica, Hydrolyzed Sodium Hyaluronate, Pelargonium Graveolens (Chinese Geranium) Flower Oil, Leuconostoc/Radish Root Ferment Filtrate, Amethyst Powder, Citronellol**, Farnesol**, Geraniol**, Linalool**, Limonene**. *Ingredients from Organic Farming **From essential oils. 99.8% natural origin of total. 70.9% of the total ingredients are from Organic Farming. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com\n\n***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.***Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list):Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "9.2K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/kora-organics-milky-mushroom-gentle-cleansing-oil-P468684",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:08:49",
        "product_name": "Milky Mushroom Gentle Cleansing Oil Makeup Remover",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.0 oz/ 150 mL"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2441277"
            }
        ],
        "rating": "width:89.19399999999999%",
        "product_reviews": "459",
        "ingredients": "-Silver Ear Mushroom: Is a natural alternative to hyaluronic acid with better moisture retention.-Babassu Oil: Nourishes, softens, and smooths skin with a rich supply of fatty acids and antioxidants. -Sunflower Seed Oil: Visibly removes excess oil and dirt.Aloe Barbadensis (Aloe Vera) Leaf Juice, Helianthus Annuus (Sunflower) Seed Oil, Water/Aqua/Eau, Sorbitan Oleate Decylglucoside Crosspolymer, Olive Oil Polyglyceryl-6 Esters, Orbignya Oleifera Seed Oil, Polyglyceryl-6 Pentaoleate, Glycerin, Pyrus Malus (Apple) Seed Oil, Potassium Sorbate, Sodium Levulinate, Lactic Acid, Sodium Chloride, Saccharide Isomerate, Pelargonium Graveolens (Geranium) Flower Oil, Tremella Fuciformis Sporocarp (Silver Ear/Snow Mushroom) Extract, Sodium Phytate, Rosa Centifolia (Rose Moroccan) Flower Oil, Macadamia Ternifolia (Macadamia Nut) Seed Oil, Olea Europaea (Olive) Fruit Oil, Rosa Canina (Rosehip) Fruit Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Ocimum Basilicum (Basil) Oil, Citric Acid, Sodium Citrate, Calendula Officinalis Flower Extract, Alcohol, Morinda Citrifolia Fruit Extract, Citronellol, Geraniol.Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "8.9K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/turmeric-brightening-exfoliating-mask-P433627",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:09:01",
        "product_name": "Turmeric BHA Pore & Brightening Treatment Mask",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.38 oz / 100 mL"
                ],
                "price": [
                    "$66.00"
                ],
                "sku": "Item 2087237"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.0 oz/ 30 mL"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2384642"
            }
        ],
        "rating": "width:82.558%",
        "product_reviews": "516",
        "ingredients": "-Turmeric: Visibly brightens and evens skin tone, reduces the look of pigmentation, calms redness, and diminishes the visible signs of aging while protecting against environmental stressors. -Papaya Enzymes: Gently exfoliate dead skin cells and diminish the appearance of scars and blemishes.-Aspen Bark: Natural source of BHA that helps clear clogged pores.Aloe Barbadensis (Aloe Vera) Leaf Juice*, Pumice, Glycerin, Rosa Canina (Rose Hip) Seed Powder*, Lactobacillus Ferment, Water/Aqua/Eau, Camellia Sinensis Leaf Powder*, Bambusa Arundinacea Stem Extract, Oryza Sativa (Rice) Extract*, Morinda Citrifolia Fruit Powder*, Lactobacillus, Rosa Canina (Rosehip) Fruit Oil*, Sodium Levulinate, Sclerotium Gum, Populus Tremuloides Bark Extract, Carica Papaya (Papaya) Fruit Extract*, Cetearyl Alcohol , Sodium Anisate, Potassium Sorbate, Curcuma Longa (Turmeric) Root Extract*, Cocos Nucifera (Coconut) Fruit Extract, Sodium Stearoyl Glutamate, Helianthus Annuus (Sunflower) Seed Wax/Helianthus Annuus Seed Cera, Mentha Piperita (Peppermint) Flower/Leaf/Stem Oil*, Lactic Acid, Lavandula Angustifolia (Lavender) Oil, Citrus Limon (Lemon) Peel Oil, (Tapioca) Maltodextrin^, Cetearyl Glucoside, Carrageenan, Sodium Phytate , Cananga Odorata Flower Oil, Juniperus Virginiana (Cedarwood) Oil, Glucose, Leuconostoc Ferment Filtrate, Tocopherol, Soybean Peroxidase, Superoxide Dismutase, Ascorbyl Palmitate, Alcohol, Limonene**, Linalool**.  *Ingredients from Organic Farming.  **From Essential Oils.  ^Made using organic ingredients. 99.7% natural origin of total. 75.1% of the total ingredients are from organic farming. 83.6% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com WARNING: Product intended for cosmetic use only. If irritation occurs discontinue use. Store below 30°C/86°F. Keep out of reach of children. Avoid contact with eyes. Sunburn Alert: This product contains an alpha hydroxy acid (AHA) that may increase your skin's sensitivity to the sun and particularly the possibility of sunburn. Use a sunscreen, wear protective clothing, and limit sun exposure while using this product and for a week afterwards.\n99.7% du total est d’origine naturelle. 75.1% du total des ingrédients sont issus de l’agriculture biologique. 83.6% du produit total moins l’eau et les minéraux est d’origine biologique. COSMOS Organic certifié par ECOCERT Greenlife selon le référentiel COSMOS disponible sur http://COSMOS.ecocert.comClean at Sephora products are formulated without:Sulfates—SLS + SLES, Parabens, Formaldehydes, Formaldehyde-releasing agents, Phthalates, Mineral Oil, Retinyl Palmitate, Oxybenzone, Coal Tar, Hydroquinone, Triclosan, Triclocarban, Undisclosed synthetic fragrances (Products can be formulated with disclosed synthetic fragrances that meet the following two criteria: (1) the synthetic fragrances do not include any of the ingredients listed in numbers 1 through 12 above and (2) the synthetic fragrances are at a concentration below 1% of the total formula) The following type of acrylates: (ethyl acrylate, ethyl methacrylate, methyl methacrylate, butyl methacrylate, hydroxypropyl methacrylate, tetrahydrofurfuryl methacrylate, trimethylolpropane trimethacrylate , aluminum salts), Animal Oils/Musks/Fats, Benzophenone + Related Compounds, Butoxyethanol, Carbon Black, Lead/Lead Acetate, Methyl Cellosolve + Methoxyethanol, Methylchloroisothiazolinone & Methylisothiazolinone, Mercury + Mercury Compounds (Thimerisol), Insoluble Plastic Microbeads (This prohibited ingredient applies to products that are meant to be rinsed off ), Resorcinol, Talc (Talc that is free of any asbestos can be used in the formulation provided that Brand conducts testing to ensure that talc is free of any asbestos.), Toluene, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) that is 0.1% or more of total formula, Ethanolamines DEA/TEA/MEA/ETA, Nanoparticles as defined by the European Commission, Petrolatum and Parrafin that is not USP grade, Phenoxyethanol that is 1% or more of total formulation, Polyacrylamide & Acrylamide, The following types of Styrene (Bromostyrene, Deastyrene/acrylates/dvbcopolymer, sodium styrene/divinylbenzene copolymer , styrene oxide, styrene), 1,4 Dioxane in final formulas must comply with the thresholds as follows: (10 or < ppm for products that are meant to be rinsed off, wiped off or removed, 3ppm or < for products that are meant to remain on the skin).",
        "n_loves": "41.9K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/plant-stem-cell-retinol-alternative-serum-P505482",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:09:14",
        "product_name": "Plant Stem Cell Retinol Alternative Serum",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$99.00"
                ],
                "sku": "Item 2646453"
            }
        ],
        "rating": "width:96.796%",
        "product_reviews": "181",
        "ingredients": "-Bakuchiol: Smooths appearance of fine lines and wrinkles and promotes firmer-looking skin.-Alfalfa Extract: Targets signs of aging and helps smooth rough, damaged skin.-Açai Stem Cell Extract: Defends skin from environmental stress and future signs of aging.Aloe Barbadensis Leaf Juice*, Water (Aqua, Eau), Glycerin^, Rosa Canina Seed Oil*, Isoamyl Laurate, Helianthus Annuus (Sunflower) Seed Oil*, Betaine, Euterpe Oleracea Fruit Extract, Cetearyl Olivate, Sorbitan Olivate, Lactobacillus Ferment, Bakuchiol, Xylityl Sesquicaprylate, Lysolecithin, Sclerotium Gum, Lactobacillus, Citric Acid, Potassium Sorbate, Medicago Sativa (Alfalfa) Extract, Pullulan, Xanthan Gum, Anhydroxylitol, Morinda Citrifolia Fruit Extract*, Citrus Aurantium Amara (Bitter Orange) Flower Oil*, Cocos Nucifera (Coconut) Fruit Extract, Pelargonium Graveolens Flower Oil, Silica, Tocopherol, Sodium Benzoate, Beta-Sitosterol, Squalene, Sodium Hydroxide, Geraniol**, Limonene**, Linalool**, Farnesol**, Citronellol**.*Ingredients from Organic Farming **From essential oils^Made using organic ingredients99.6% natural origin of total. 83.3% of the total ingredients are from organic farming. 87.7% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard. This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "5.5K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/turmeric-glow-foaming-cleanser-P500618",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:09:26",
        "product_name": "Turmeric Glow Foaming Cleanser",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz / 150 mL"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2581601"
            }
        ],
        "rating": "width:91.41%",
        "product_reviews": "305",
        "ingredients": "-Turmeric: Refreshes the overall complexion with phytonutrients and potent antioxidants.-Aloe Vera Juice: Provides hydration, essential amino acids, and minerals to soothe skin.-Saccharide Isomerate: Binds to skin’s natural moisture to provide hydration after rinsing.Aloe Barbadensis Leaf Juice*, Water/Aqua/Eau, Glycerin^, Sodium Cocoyl Glutamate, Coco-Glucoside, Decyl Glucoside, Capryloyl/Caproyl Methyl Glucamide, Sclerotium Gum, Lactobacillus Ferment, Glyceryl Oleate, Lauroyl/Myristoyl Methyl Glucamide, Xylityl Sesquicaprylate, Oryza Sativa (Rice) Extract*, Mentha Piperita (Peppermint) Oil*, Citric Acid, Saccharide Isomerate, Lactobacillus, Citrus Aurantium Dulcis (Orange) Peel Oil*, Helianthus Annuus (Sunflower)Seed Oil, Anhydroxylitol, Bursera Graveolens Wood Oil, Curcuma Longa (Turmeric) Root Extract*, Morinda Citrifolia Fruit Extract*, Potassium Sorbate, Cocos Nucifera (Coconut) Fruit Extract, Pelargonium Graveolens Flower Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil*, Leuconostoc Ferment Filtrate, Ocimum Basillicum (Basil) Oil, Rosa Centifolia Flower Oil, Sodium Citrate, Tocopherol, Soybean Peroxidase, Superoxide Dismutase, Hydrogenated Palm Glycerides Citrate, Limonene**, Citronellol**, Geraniol**. *Ingredients from Organic Farming. **From Essential Oils. ^Made using organic ingredients.99.7% natural origin of total. 72.7% of the total ingredients are from organic farming. 80.3% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.comWARNING: Product intended for cosmetic use only. If irritation occurs discontinue use. Store below 30°C / 86°F. Keep out of reach of children. Avoid contact with eyes.Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category – this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytulolene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Parrafin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos) , Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1, 4, Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1’4 Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "13K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/kora-organics-mini-turmeric-bha-brightening-treatment-mask-P461177",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:09:38",
        "product_name": "Mini Turmeric BHA Pore & Brightening Treatment Mask",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.0 oz/ 30 mL"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2384642"
            }
        ],
        "rating": "width:82.558%",
        "product_reviews": "516",
        "ingredients": "-Turmeric: Visibly brightens and evens skin tone, reduces the look of pigmentation, calms redness, and diminishes the visible signs of aging while protecting against environmental stressors. -Papaya Enzymes: Gently exfoliate dead skin cells and diminish the appearance of scars and blemishes.-Aspen Bark: Natural source of BHA that helps clear clogged pores.Aloe Barbadensis (Aloe Vera) Leaf Juice*, Pumice, Glycerin, Rosa Canina (Rose Hip) Seed Powder*, Lactobacillus Ferment, Water/Aqua/Eau, Camellia Sinensis Leaf Powder*, Bambusa Arundinacea Stem Extract, Oryza Sativa (Rice) Extract*, Morinda Citrifolia Fruit Powder*, Lactobacillus, Rosa Canina (Rosehip) Fruit Oil*, Sodium Levulinate, Sclerotium Gum, Populus Tremuloides Bark Extract, Carica Papaya (Papaya) Fruit Extract*, Cetearyl Alcohol , Sodium Anisate, Potassium Sorbate, Curcuma Longa (Turmeric) Root Extract*, Cocos Nucifera (Coconut) Fruit Extract, Sodium Stearoyl Glutamate, Helianthus Annuus (Sunflower) Seed Wax/Helianthus Annuus Seed Cera, Mentha Piperita (Peppermint) Flower/Leaf/Stem Oil*, Lactic Acid, Lavandula Angustifolia (Lavender) Oil, Citrus Limon (Lemon) Peel Oil, (Tapioca) Maltodextrin^, Cetearyl Glucoside, Carrageenan, Sodium Phytate , Cananga Odorata Flower Oil, Juniperus Virginiana (Cedarwood) Oil, Glucose, Leuconostoc Ferment Filtrate, Tocopherol, Soybean Peroxidase, Superoxide Dismutase, Ascorbyl Palmitate, Alcohol, Limonene**, Linalool**.  *Ingredients from Organic Farming.  **From Essential Oils.  ^Made using organic ingredients. 99.7% natural origin of total. 75.1% of the total ingredients are from organic farming. 83.6% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com WARNING: Product intended for cosmetic use only. If irritation occurs discontinue use. Store below 30°C/86°F. Keep out of reach of children. Avoid contact with eyes. Sunburn Alert: This product contains an alpha hydroxy acid (AHA) that may increase your skin's sensitivity to the sun and particularly the possibility of sunburn. Use a sunscreen, wear protective clothing, and limit sun exposure while using this product and for a week afterwards.\n99.7% du total est d’origine naturelle. 75.1% du total des ingrédients sont issus de l’agriculture biologique. 83.6% du produit total moins l’eau et les minéraux est d’origine biologique. COSMOS Organic certifié par ECOCERT Greenlife selon le référentiel COSMOS disponible sur http://COSMOS.ecocert.comClean at Sephora products are formulated without:Sulfates—SLS + SLES, Parabens, Formaldehydes, Formaldehyde-releasing agents, Phthalates, Mineral Oil, Retinyl Palmitate, Oxybenzone, Coal Tar, Hydroquinone, Triclosan, Triclocarban, Undisclosed synthetic fragrances (Products can be formulated with disclosed synthetic fragrances that meet the following two criteria: (1) the synthetic fragrances do not include any of the ingredients listed in numbers 1 through 12 above and (2) the synthetic fragrances are at a concentration below 1% of the total formula) The following type of acrylates: (ethyl acrylate, ethyl methacrylate, methyl methacrylate, butyl methacrylate, hydroxypropyl methacrylate, tetrahydrofurfuryl methacrylate, trimethylolpropane trimethacrylate , aluminum salts), Animal Oils/Musks/Fats, Benzophenone + Related Compounds, Butoxyethanol, Carbon Black, Lead/Lead Acetate, Methyl Cellosolve + Methoxyethanol, Methylchloroisothiazolinone & Methylisothiazolinone, Mercury + Mercury Compounds (Thimerisol), Insoluble Plastic Microbeads (This prohibited ingredient applies to products that are meant to be rinsed off ), Resorcinol, Talc (Talc that is free of any asbestos can be used in the formulation provided that Brand conducts testing to ensure that talc is free of any asbestos.), Toluene, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) that is 0.1% or more of total formula, Ethanolamines DEA/TEA/MEA/ETA, Nanoparticles as defined by the European Commission, Petrolatum and Parrafin that is not USP grade, Phenoxyethanol that is 1% or more of total formulation, Polyacrylamide & Acrylamide, The following types of Styrene (Bromostyrene, Deastyrene/acrylates/dvbcopolymer, sodium styrene/divinylbenzene copolymer , styrene oxide, styrene), 1,4 Dioxane in final formulas must comply with the thresholds as follows: (10 or < ppm for products that are meant to be rinsed off, wiped off or removed, 3ppm or < for products that are meant to remain on the skin).",
        "n_loves": "15.4K",
        "categories": [
            "Skincare",
            "Mini Size"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/kora-organics-berry-bright-vitamin-c-eye-cream-P476876",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:09:50",
        "product_name": "Berry Bright Firming Vitamin C Refillable Eye Cream",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: .5 oz / 15 mL"
                ],
                "price": [
                    "$74.00"
                ],
                "sku": "Item 2480218"
            },
            {
                "swatch_group": "Refill size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL (refill)"
                ],
                "price": [
                    "$59.00"
                ],
                "sku": "Item 2480226"
            }
        ],
        "rating": "width:91.552%",
        "product_reviews": "419",
        "ingredients": "-Kangaroo Paw Flower: Visibly minimizes fine lines and wrinkles around eyes.-Kakadu Plum: Is known to be the world’s richest natural source of vitamin C. -Cloudberry: Visibly brightens and energizes dull skin with high levels of vitamins C and E.Aloe Barbadensis (Aloe Vera) Leaf Juice*, Rosa Canina (Rosehip) Seed Oil*, Glycerin, Balanites Roxburghii Seed Oil*, Cetearyl Alcohol, Water/Aqua/Eau, Coconut Alkanes, Lactobacillus Ferment, Oleic/Linoleic/Linolenic Polyglycerides, Cetearyl Olivate, Sorbitan Olivate, Propanediol, Ascorbyl Glucoside, Persea Gratissima (Avocado) Oil*, Helianthus Annuus (Sunflower) Seed Oil*, Lactobacillus, Butyrospermum Parkii (Shea) Butter*, Coco-Caprylate/Caprate, Potassium Sorbate, Eclipta Prostrata Extract, Cocos Nucifera (Coconut) Fruit Extract, Chenopodium Quinoa Seed Extract, Panax Ginseng Root Extract, Sclerotium Gum, Rubus Chamaemorus Fruit Extract, Morinda Citrifolia Fruit Extract*, Sodium Phytate, Anigozanthos Flavidus Extract*, Melia Azadirachta Leaf Extract, Terminalia Ferdinandiana Fruit Extract, Sodium Benzoate, Potassium Hydroxide, Hippophae Rhamnoides (Seabuckthorn) Fruit Oil*, Tocopherol , Moringa Oleifera Seed Oil, Alcohol.*Ingredients from Organic Farming99.7% natural origin of total. 70.0% of the total ingredients are from organic farming. 70.0% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.comClean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "18.3K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/kora-organics-nourishing-hand-body-lotion-P502854",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:10:03",
        "product_name": "Nourishing Hand & Body Lotion",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10.14 oz / 300 mL"
                ],
                "price": [
                    "$69.00"
                ],
                "sku": "Item 2600294"
            }
        ],
        "rating": "width:60%",
        "product_reviews": "2",
        "ingredients": "-Microalgae: Rich in antioxidants and promotes smoother, stronger, and more hydrated skin. -Ceramides: Help maintain moisture levels and support skin’s natural barrier. -Noni: Rich in vitamins and antioxidants to replenish and promote visible radiance.AAloe Barbadensis Leaf Juice*, Helianthus Annuus (Sunflower) Seed Oil*, Glycerin^, Cetearyl Alcohol, Caprylic/Capric Triglyceride, Cetearyl Olivate, Water/Aqua/Eau, Butyrospermum Parkii (Shea) Butter*, Sorbitan Olivate, Potassium Sorbate, Sodium Levulinate, Hippophae Rhamnoides Fruit Oil*, Citric Acid, Sclerotium Gum, Pelargonium Graveolens Flower Oil, Morinda Citrifolia Fruit Extract*, Sodium Phytate, Ceramide NP, Tocopherol, Plankton Extract, Rosa Canina Fruit Oil*, Ocimum Basillicum (Basil) Oil, Rosa Centifolia Flower Oil, Alcohol, Citronellol**, Geraniol**. *Ingredients from Organic Farming. **From Essential Oils. ^Made using organic ingredients.99.5% natural origin of total. 85.9% of the total ingredients are from organic farming. 87.5% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.comWARNING: Product intended for cosmetic use only. If irritation occurs discontinue use. Store below 30°C / 86°F. Keep out of reach of children. Avoid contact with eyes.***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.*** Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "2.1K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/noni-glow-sleeping-mask-P440072",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:10:15",
        "product_name": "Noni Glow Overnight Plumping Hydration Mask",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 3.38 oz/ 100 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$66.00"
                ],
                "sku": "Item 2183531"
            }
        ],
        "rating": "width:74.316%",
        "product_reviews": "95",
        "ingredients": "-Silver Ear Mushroom: Binds hyaluronic acid to skin, boosting moisture retention and visible plumpness. -Coconut Milk: Is naturally rich in vitamins and minerals that nourish and comfort skin.-Caviar Lime Extract: Contains gentle fruit acids that promote cellular renewal, visibly tone skin, and reduce the appearance of dullness.Aloe Barbadensis (Aloe Vera) Leaf Juice*, Glycerin, Crambe Abyssinica Seed Oil Phytosterol Esters, Cocos Nucifera (Coconut) Extract*, Water/Aqua/Eau, Diglycerin, Morinda Citrifolia (Noni) Fruit Extract*, Terminalia Ferdinandiana Fruit Extract, Tremella Fuciformis Sporocarp Extract, Microcitrus Australasica Fruit Extract, Carrageenan, Cyamposis Tetragonoloba (Guar) Gum, Xanthan Gum, Populus Tremuloides Bark Extract, Helianthus Annuus (Sunflower) Seed Oil*, Ocimum Basilicum (Basil) Oil, Pelargonium Graveolens Flower Oil, Rosa Centifolia Flower Oil, Hydrolyzed Sodium Hyaluronate, Sodium Polyglutamate, Salicylic Acid, Acacia Senegal Gum, Glyceryl Caprylate, Glyceryl Undecylenate, Sodium Benzoate, Glucose, Sorbic Acid, Sodium Phytate, Maltodextrin (Tapioca Starch), Benzyl Alcohol, Betaine, Alcohol, Quartz, Citronellol**, Geraniol**. *Ingredient from Organic Farming. ** From essential oils. 98.78% natural origin of total. 84% of the total ingredients are from Organic Farming. COSMOS ORGANIC certiﬁed by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.***Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "13.2K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/kora-organics-turmeric-invigorating-body-scrub-P502630",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:10:27",
        "product_name": "Turmeric Invigorating Body Scrub",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.9 oz / 175 mL"
                ],
                "price": [
                    "$75.00"
                ],
                "sku": "Item 2600286"
            }
        ],
        "rating": "width:93.294%",
        "product_reviews": "343",
        "ingredients": "-Turmeric: Visibly brightens, evens the look of skin tone, and helps soothe redness.-Rosehip Seeds: Contain retinoic acid, a form of vitamin A, which gently polishes.-Saccharide Isomerate: Helps bind to skin's natural moisture and create a moisture barrier.Aloe Barbadensis Leaf Juice*, Pumice, Glycerin^, Rosa Canina (Rose Hip) Seed Powder*, Lactobacillus Ferment, Water/Aqua/Eau, Camellia Sinensis Leaf Powder*, Rosa Canina Fruit Oil*, Bambusa Arundinacea Stem Extract, Morinda Citrifolia Fruit Powder*, Oryza Sativa (Rice) Extract*, Cetearyl Alcohol, Lactobacillus, Sodium Levulinate, Saccharide Isomerate, Sclerotium Gum, Populus Tremuloides Bark Extract, Carica Papaya (Papaya) Fruit Extract*, Sodium Stearoyl Glutamate, Potassium Sorbate, Sodium Anisate, Curcuma Longa (Turmeric) Root Extract*, Cetearyl Glucoside, Cocos Nucifera (Coconut) Fruit Extract, Helianthus Annuus (Sunflower) Seed Wax/Helianthus Annuus Seed Cera, Mentha Piperita (Peppermint) Oil*, Lavandula Angustifolia (Lavender) Oil, Citrus Limon (Lemon) Peel Oil, Maltodextrin, Carrageenan, Sodium Phytate, Lactic Acid, Cananga Odorata Flower Oil, Juniperus Virginiana Oil, Glucose, Leuconostoc Ferment Filtrate, Tocopherol, Citric Acid, Sodium Citrate, Soybean Peroxidase, Superoxide Dismutase, Alcohol, Limonene**, Linalool**. *Ingredients from Organic Farming. **From Essential Oils. ^Made using organic ingredients.99.7% natural origin of total. 72.5% of the total ingredients are from organic farming. 83.8% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.comWARNING: Product intended for cosmetic use only. If irritation occurs discontinue use. Store below 30°C / 86°F. Keep out of reach of children. Avoid contact with eyes. SUNBURN ALERT: This product contains an alpha hydroxy acid (AHA) that may increase your skin's sensitivity to the sun and particularly the possibility of sunburn. Use a sunscreen, wear protective clothing, and limit sun exposure while using this product and for a week afterwards.***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.*** Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "6.8K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Scrub & Exfoliants"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/noni-glow-face-oil-mini-P434336",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:10:39",
        "product_name": "Mini Noni Glow Face Oil",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.34 oz/ 10 mL"
                ],
                "price": [
                    "$35.00"
                ],
                "sku": "Item 2120491"
            }
        ],
        "rating": "width:87.63%",
        "product_reviews": "1.2K",
        "ingredients": "Rosa Canina (Rosehip) Fruit Oil*, Simmondsia Chinensis (Jojoba) Seed Oil*, Caprylic/capric Triglyceride, Helianthus Annuus (Sunflower) Seed Oil *, Tocopherol, Hippophae Rhamnoides (Seabuckthorn) Seed Oil*, Punica Granatum (Pomegranate) Seed Oil*, Rosa Damascena Flower Oil, Jasminum Officinale (Jasmine) Flower/Leaf Extract, Lavandula Angustifolia (Lavender) Flower/leaf/stem Extract, Eugenia Caryophyllus (Clove) Flower Extract, Vitis Vinifera (Grape) Fruit Extract, Pelargonium Graveolens Flower Oil, Morinda Citrifolia (Noni) Fruit Extract *, Citronellol**, Geraniol**, Linalool**, Benzyl Benzoate**.*Organic\n**From essential oils.100% natural origin of total. 99.28% organic of total. COSMOS ORGANIC certiﬁed by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.***\nClean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category – this is not an exhaustive list): \nAcrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytulolene (BHT) under 0.1% , Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Parrafin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos) , Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1, 4, Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1’4 Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%)",
        "n_loves": "30.2K",
        "categories": [
            "Skincare",
            "Mini Size"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/noni-radiant-eye-oil-P428816",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:10:52",
        "product_name": "Noni Radiant Brightening Eye Oil",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: .34 oz / 10 mL",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$53.00"
                ],
                "sku": "Item 2051134"
            }
        ],
        "rating": "width:75.314%",
        "product_reviews": "414",
        "ingredients": "-Kahai Oil: Hydrates and supports aging skin.-Rosehip Oil: Soothes skin with a rich supply of antioxidants and essential fatty acids. -Tomato Fruit: Provides potent carotenoids that improve the look of skin tone, wrinkles, and firmness.Rosa Canina (Rosehip) Fruit Oil*, Helianthus Annuus (Sunflower) Seed Oil*, Macadamia Ternifolia (Macadamia Nut) Oil*, Persea Gratissima (Avocado) Oil*, Simmondsia Chinensis (Jojoba) Seed Oil, Caryodendron Orinocense Seed Oil, Hippophae Rhamnoides (Sea Buckthorn) Oil*, Caprylic/Capric Triglyceride, Morinda Citrifolia Fruit Extract*, Solanum Lycopersicum (Tomato) Fruit Extract, Himanthalia Elongata Extract, Calendula Officinalis Flower Extract*, Coffee Arabica Seed Extract, Squalane, Dicaprylyl Carbonate, Tocopherol, Squalene, Beta-Sitosterol, Quartz. *Ingredient from Organic Farming. 99% natural origin of total. 95% organic of total. COSMOS ORGANIC certiﬁed by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.***Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "29.1K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/noni-glow-face-oil-P418624",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:11:04",
        "product_name": "Noni Glow Plumping Face Oil",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$92.00"
                ],
                "sku": "Item 1947878"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.34 oz/ 10 mL"
                ],
                "price": [
                    "$35.00"
                ],
                "sku": "Item 2120491"
            }
        ],
        "rating": "width:88.092%",
        "product_reviews": "1.1K",
        "ingredients": "-Noni Fruit: Is packed with antioxidants and more than 100 vitamins and minerals.-Rosehip Oil: Soothes skin with an abundance of antioxidants and essential fatty acids.-Sea Buckthorn: Contains vitamins C and E, omega-7 fatty acids, and carotenoids.Rosa Canina (Rosehip) Fruit Oil*, Simmondsia Chinensis (Jojoba) Seed Oil*, Caprylic/capric Triglyceride, Helianthus Annuus (Sunflower) Seed Oil *, Tocopherol, Hippophae Rhamnoides (Seabuckthorn) Seed Oil*, Punica Granatum (Pomegranate) Seed Oil*, Rosa Damascena Flower Oil, Jasminum Officinale (Jasmine) Flower/Leaf Extract, Lavandula Angustifolia (Lavender) Flower/leaf/stem Extract, Eugenia Caryophyllus (Clove) Flower Extract, Vitis Vinifera (Grape) Fruit Extract, Pelargonium Graveolens Flower Oil, Morinda Citrifolia (Noni) Fruit Extract *, Citronellol**, Geraniol**, Linalool**, Benzyl Benzoate**.*Organic**From essential oils.100% natural origin of total. 99.28% organic of total. COSMOS ORGANIC certiﬁed by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.***Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list):Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "39.8K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Face Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/noni-bright-vitamin-c-serum-P446419",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:11:17",
        "product_name": "Noni Bright 12% Vitamin C Serum",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$93.00"
                ],
                "sku": "Item 2229839"
            }
        ],
        "rating": "width:84.398%",
        "product_reviews": "391",
        "ingredients": "-Vitamin C Superfruit Complex: Contains Kakadu plum, acerola cherry, orange peel, lemon peel, and noni.-Sodium Hyaluronate: Attracts moisture and supports nutrient absorption.-Olive Leaf Extract: Supports skin-cell renewal and visibly firms skin.Aloe Barbadensis (Aloe Vera) Leaf Juice*, Ascorbyl Glucoside, Glycerin^, Water/Aqua/Eau, Lactobacillus Ferment, Lactobacillus/Acerola Cherry Ferment, Potassium Hydroxide, Dicaprylyl Carbonate, Capsicum Annuum (Capsicum) Fruit Extract, Lactobacillus, Citrus Limon (Lemon) Peel Extract, Cocos Nucifera (Coconut) Fruit Extract, Terminalia Ferdinandiana Fruit Extract, Morinda Citrifolia (Noni) Fruit Extract*, Hydrolyzed Sodium Hyaluronate, Olea Europaea (Olive) Leaf Extract, Zinc PCA, Lysolecithin, Sclerotium Gum, Xanthan Gum, Pullulan, Caprylic/Capric Triglyceride, Ascorbic Acid, Leuconostoc/Radish Root Ferment Filtrate, Salvia Sclarea (Clary Sage) Extract, Citrus Aurantium Dulcis (Orange) Peel Extract, Potassium Sorbate, Sodium Phytate, Sodium Benzoate, Citric Acid, Sodium Salicylate, Euterpe Oleracea (Acai) Juice*, Tocopherol, Silica, Maltodextrin, Alcohol, Glycine Soja (Soybean) Oil, Quartz, Citral**, Limonene**, Linalool**. *Ingredient from organic farming. **From essential oils. ^Made using organic ingredients. 99% natural origin of total. 68.8% of the total ingredients are from Organic Farming. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com.P79Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list):Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "21.2K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/kora-organics-turmeric-glow-moisturizer-P471046",
        "error": "",
        "scrape_timestamp": "08/22/2023, 00:11:29",
        "product_name": "Turmeric Glow Brightening Refillable Moisturizer",
        "brand_name": "KORA Organics",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.69 oz/ 50 mL"
                ],
                "price": [
                    "$80.00"
                ],
                "sku": "Item 2356160"
            },
            {
                "swatch_group": "Refill size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.69 oz/ 50 mL refill"
                ],
                "price": [
                    "$63.00"
                ],
                "sku": "Item 2356178"
            }
        ],
        "rating": "width:89.89399999999999%",
        "product_reviews": "1K",
        "ingredients": "-Liposome Blend of Turmeric, Licorice, and Noni Fruit: Nourishes and conditions skin.-Marine Microalgae: Is a powerful source of essential fatty acids and carotenoids.-Desert Date Oil: Boosts moisture to smooth and visibly plump skin.Aloe Barbadensis (Aloe Vera) Leaf Juice*, Glycerin^, Coconut Alkanes, Cetearyl Alcohol, Persea Gratissima (Avocado) Oil*, Rosa Canina (Rosehip) Seed Oil*, Balanites Roxburghii Seed Oil*, Water/Aqua/Eau, Lactobacillus Ferment, Cetearyl Olivate, Helianthus Annuus (Sunflower) Seed Oil*, Sorbitan Olivate, Butyrospermum Parkii (Shea) Butter*, Hippophae Rhamnoides (Seabuckthorn) Fruit Oil*, Passiflora Edulis (Maracuja) Seed Oil*, Caprylic/Capric Triglyceride, Oryza Sativa (Rice) Extract*, Lactobacillus, Ascorbyl Glucoside, Coco-Caprylate/Caprate, Lactobacillus/Arundinaria Gigantea Leaf Ferment Filtrate, Astrocaryum Murumuru Seed Butter, Gossypium Herbaceum (Cotton) Seed Oil, Saccharomyces Lysate Extract, Bidens Pilosa Extract, Calendula Officinalis Flower Extract*, Cocos Nucifera (Coconut) Fruit Extract, Potassium Sorbate, Lavandula Angustifolia (Lavender) Oil, Linum Usitatissimum (Linseed) Seed Oil, Lactic Acid, Phospholipids, Citrus Limon (Lemon) Peel Oil, Hydrolyzed Sodium Hyaluronate, Mentha Piperita (Peppermint Indian) Leaf Oil*, Sclerotium Gum, Potassium Hydroxide, Curcuma Longa (Turmeric) Root Extract*, Glycyrrhiza Glabra (Licorice) Root Extract*, Morinda Citrifolia Fruit Extract*, Yeast (Faex) Powder, Sodium Phytate, Cylindrotheca Fusiformis Extract, Leuconostoc/Radish Root Ferment Filtrate, Cananga Odorata Flower Oil, Juniperus Virginiana (Cedarwood) Oil, Leuconostoc Ferment Filtrate, Tocopherol , Bisabolol, Soybean Peroxidase, Superoxide Dismutase, Alcohol, Citral**, Geraniol**, Limonene**, Linalool**.*Ingredients from Organic Farming**From essential oils^Made using organic ingredients99.8% natural origin of total. 70.0% of the total ingredients are from organic farming. 70.0% organic of total minus water and minerals. COSMOS ORGANIC certified by ECOCERT Greenlife according to COSMOS Standard available at http://COSMOS.ecocert.com***This ingredient list is subject to change. Customers should refer to product packaging for the most up-to-date ingredient list.***Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "19.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    }
]