[
    {
        "url": "https://www.sephora.com/ca/en/product/mario-badescu-facial-spray-with-aloe-adaptogens-coconut-water-P475965",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:21:26",
        "product_name": "Facial Spray with Aloe Adaptogens, and Coconut Water",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz / 236 ml"
                ],
                "price": [
                    "$19.00"
                ],
                "sku": "Item 2522951"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz / 118 mL"
                ],
                "price": [
                    "$13.00"
                ],
                "sku": "Item 2522944"
            }
        ],
        "rating": "width:69.33399999999999%",
        "product_reviews": "15",
        "ingredients": "-Coconut Water: Vitamin-rich, hydrating and refreshing.-Niacinamide: Restorative; reduces the appearance of pores.-Aloe Vera: Soothing and rich in amino acids, active enzymes, vitamins, and minerals.Aqua (Water, Eau), Aloe Barbadensis Leaf Juice, Niacinamide, Sodium Hyaluronate, Cocos Nucifera (Coconut) Water, Acanthopanax Senticosus (Eleuthero) Root Extract, Inonotus Obliquus (Mushroom) Extract, Rhaponticum Carthamoides Root Extract, Rhodiola Rosea Extract, Selaginella Lepidophylla Extract, Sodium Benzoate, Sodium Sulfite, Trehalose, Potassium Sorbate, Ppg-5-Ceteth-20, 1,2-Hexanediol, Maltodextrin, Caprylyl Glycol, Phenoxyethanol, Chlorophenesin, Citric Acid.",
        "n_loves": "2.6K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Mists & Essences"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/mario-badescu-rose-body-wash-P479334",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:21:38",
        "product_name": "Rose Body Wash",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$11.00"
                ],
                "sku": "Item 2447407"
            }
        ],
        "rating": "width:86.95600000000002%",
        "product_reviews": "23",
        "ingredients": "-Rose: Visibly rejuvenates skin.Aqua (Water, Eau), Sodium Lauroyl Methyl Isethionate, Cocamidopropyl Betaine, Glycerin, Rosa Damascena Flower Water, Sodium Methyl Oleoyl Taurate, Sodium Cocoyl Isethionate, Rosa Hybrid Flower Extract, Rosa Damascena Flower Oil, Phenoxyethanol, Sodium Chloride, Parfum (Fragrance), Chlorphenesin, Trisodium Ethylenediamine Disuccinate, Sodium Benzoate, Caprylyl Glycol, Propylene Glycol, Cocamidopropyl Dimethylamine, Potassium Sorbate, Citric Acid, Polysorbate 20, Sodium Sulfate, CI 14700 (Red 4).",
        "n_loves": "3.5K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/facial-spray-with-aloe-chamomile-lavender-P441077",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:21:50",
        "product_name": "Facial Spray with Aloe, Chamomile and Lavender",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$16.00"
                ],
                "sku": "Item 2192037"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 118 mL"
                ],
                "price": [
                    "$11.00"
                ],
                "sku": "Item 2192029"
            }
        ],
        "rating": "width:81.02000000000001%",
        "product_reviews": "98",
        "ingredients": "-Lavender Oil: Calming.-Lavender Essential Water: Soothing and hydrating.-Antioxidant Vitamin C (Ascorbic Acid): Brightening.Aqua (Water, Eau), Lavandula Angustifolia (Lavender) Flower Water, Propylene Glycol, Polysorbate 20, Aloe Barbadensis Leaf Juice, Lavandula Angustifolia (Lavender) Oil, Chamomilla Recutita (Matricaria) Flower Extract, Fucus Vesiculosus Extract, Ethyl Ascorbic Acid, Thymus Vulgaris (Thyme) Leaf Extract, Silver Citrate, Potassium Sorbate, Sodium Benzoate, Benzophenone-4, Triethanolamine, Zeolite, Sodium Sulfate, Citric Acid, Sodium Chloride, Ci 60730 (Violet 2).",
        "n_loves": "8.8K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Mists & Essences"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/witch-hazel-rosewater-toner-P444979",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:22:03",
        "product_name": "Witch Hazel & Rosewater Toner",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$18.00"
                ],
                "sku": "Item 2239887"
            }
        ],
        "rating": "width:79.048%",
        "product_reviews": "21",
        "ingredients": "-Witch Hazel: Cleanses and visibly clarifies skin. -Rose Oil: Visibly rejuvenates, moisturizes, and replenishes skin with antioxidants.-Rose Water: Hydrates, soothes, and visibly rejuvenates skin. Aqua (Water, Eau), Glycerin, Hamamelis Virginiana (Witch Hazel) Leaf Extract, Rosa Damascena (Rose) Flower Water, Aloe Barbadensis Leaf Juice, Rosa Hybrid Flower Extract, Rosa Damascena Flower Oil, Pentylene Glycol, Ethylhexylglycerin, Propanediol, Polysorbate 20, Potassium Sorbate, Parfum (Fragrance), Sodium Benzoate, Sodium Chloride, Citric Acid, Phenoxyethanol, Propylene Glycol, Benzoic Acid, CI 17200 (Red 33), CI 42090 (Blue 1).",
        "n_loves": "5.9K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/glycolic-acid-toner-P441075",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:22:15",
        "product_name": "Glycolic Acid Toner",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$24.00"
                ],
                "sku": "Item 2192086"
            }
        ],
        "rating": "width:84.528%",
        "product_reviews": "53",
        "ingredients": "-Glycolic Acid: Is an exfoliating ingredient that leaves skin looking brighter and smoother.-Grapefruit Extract: Visibly rejuvenates and refreshes skin.-Aloe Vera: Soothes and hydrates, visibly restoring skin’s brightness.Aqua (Water, Eau), Aloe Barbadensis Leaf Juice, Propylene Glycol, Glycolic Acid, Triethanolamine, Polysorbate 20, Citrus Grandis (Grapefruit) Fruit Extract, Diazolidinyl Urea, Benzophenone-4, Methylparaben, Parfum (Fragrance), PEG-8, Trimethoxybenzylidene Pentanedione, Hydroxyacetophenone, Propylparaben, Sodium Benzoate, Citric Acid, Potassium Sorbate, Sodium Chloride, Linalool, Hexyl Cinnamal, Benzyl Alcohol, Limonene, Citronellol, Geraniol, CI 42090 (Blue 1), CI 45410 (Red 28), CI 19140 (Yellow 5).",
        "n_loves": "4.7K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/seaweed-night-cream-P441313",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:22:28",
        "product_name": "Seaweed Night Cream",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 28 g"
                ],
                "price": [
                    "$29.00"
                ],
                "sku": "Item 2192128"
            }
        ],
        "rating": "width:79.048%",
        "product_reviews": "42",
        "ingredients": "-Bladderwrack Extract: Soothes irritated skin and softens the look of fine lines and wrinkles.-Collagen: Smooths the appearance of fine lines and wrinkles while visibly firming skin.-Sodium Hyaluronate: Addresses dry, flaky skin by attracting moisture to skin cells.Aqua (Water, Eau), Glycerin, Isopropyl Myristate, Stearic Acid, Propylene Glycol, Cetyl Alcohol, Fucus Vesiculosus (Bladderwrack) Extract, Hydrolyzed Elastin, Collagen, Sodium Hyaluronate, Glyceryl Acrylate/Acrylic Acid Copolymer, Carbomer, Parfum (Fragrance), Sodium Chloride, Phenoxyethanol, Potassium Sorbate, Methylparaben, Propylparaben, Sodium Benzoate, Triethanolamine, Diazolidinyl Urea, Benzyl Salicylate, Linalool, Citronellol, Amyl Cinnamal, Hexyl Cinnamal, Geraniol, Limonene, Mica, CI 77891 (Titanium Dioxide), CI 19140 (Yellow 5), CI 42090 (Blue 1), CI 77288 (Chromium Oxide Green).",
        "n_loves": "3.1K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/mario-badescu-the-glow-up-P468196",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:22:39",
        "product_name": "The Glow Up",
        "brand_name": "Mario Badescu",
        "options": [],
        "rating": "width:50%",
        "product_reviews": "4",
        "ingredients": "-Glycolic Acid: Exfoliates, resurfaces, and refines skin’s appearance. -Vitamin C: Visibly brightens uneven skin tone and texture. -Rose: Nourishes.Brightening Mask with Vitamin C: Aqua (Water, Eau), Kaolin, Triticum Vulgare (Wheat) Starch, Glycerin, Polysorbate 80, Zinc Oxide, Sorbitol, Avena Sativa (Oat) Kernel Flour, Propylene Glycol, Tetrahexyldecyl Ascorbate, Cellulose Gum, 1,2-Hexanediol, Caprylyl Glycol, Polyacrylate-13, Parfum (Fragrance), Polyisobutene, Polysorbate 20, Sorbitan Isostearate, Tropolone, Benzyl Benzoate, CI 77891 (Titanium Dioxide).Facial Spray with Aloe, Herbs and Rosewater: Aqua (Water, Eau), Propylene Glycol, Aloe Barbaden-sis Leaf Juice, Rosa Canina Extract, Thymus Vulgaris (Thyme) Leaf Extract, Fucus Vesiculosus (Bladderwrack) Extract, Gardenia Flori-da Fruit Extract, Caprylyl Glycol, Hexylene Glycol, Polysorbate 20, Parfum (Fragrance), Phenoxyethanol, Sodium Chloride, Citronel-lol, Geraniol, CI 17200 (Red 33), CI 42090 (Blue 1).  Glycolic Acid Toner: Aqua (Water, Eau), Aloe Barbadensis Leaf Juice, Propylene Glycol, Glycolic Acid, Triethanolamine, Polysorbate 20, Citrus Grandis (Grapefruit) Fruit Extract, Diazolidinyl Urea, Benzophenone-4, Methylparaben, Parfum (Fragrance), PEG-8, Trimethoxybenzylidene Pentanedione, Hydroxyacetophenone, Propylparaben, Sodium Benzoate, Citric Acid, Potassium Sorbate, Sodium Chloride, Linalool, Hexyl Cinnamal, Benzyl Alcohol, Limonene, Citronellol, Geraniol, CI 42090 (Blue 1), CI 45410 (Red 28), CI 19140 (Yellow 5).Vitamin C Serum: Propylene Glycol, Aqua (Water, Eau), Aloe Barbadensis Leaf Juice, Hexylene Glycol, Pentylene Glycol, Tetrahexyldecyl Ascorbate, 3-O-Ethyl Ascorbic Acid, PEG-25 Hydrogenated Castor Oil, PEG-40 Hydrogenated Castor Oil, Cucumis Sativus (Cucumber) Extract, Panax Ginseng Root Extract, Sodium Hyaluronate, Soluble Collagen, Lavandula Angustifolia (Lavender) Oil, Hydroxyacetophenone, Triethanolamine, Citric Acid, Potassium Sorbate, Caprylyl Glycol, Phenoxyethanol, Silver Citrate, Zeolite, Sodium Benzoate.",
        "n_loves": "3.2K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/drying-lotion-P441064",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:22:49",
        "product_name": "Drying Lotion",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 29 mL"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2192003"
            }
        ],
        "rating": "width:75.168%",
        "product_reviews": "298",
        "ingredients": "-Salicylic Acid: Reduce the redness of blemishes.-Sulfur: Unclogs pores.-Zinc Oxide: Absorbs excess oil.Isopropyl Alcohol, Aqua (Water, Eau), Calamine, Camphor, Sulfur, Zinc Oxide, Talc, Glycerin, Salicylic Acid, Ci 77891 (Titanium Dioxide).",
        "n_loves": "26.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/glycolic-foaming-cleanser-P441076",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:23:01",
        "product_name": "Glycolic Foaming Cleanser",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6 oz/ 117 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2192094"
            }
        ],
        "rating": "width:91.892%",
        "product_reviews": "37",
        "ingredients": "-Glycolic Acid: Visibly retexturizes and refines skin.-Marshmallow Extract: Hydrates, softens, and leaves skin feeling balanced.-Chamomile: Calms.Sodium Lauryl Sulfate, Aqua (Water, Eau), Cocamidopropyl Betaine, Cocamide Mea, Glycolic Acid, Salvia Officinalis (Sage) Leaf Extract, Hypericum Perforatum Extract, Chamomilla Recutita (Matricaria) Flower Extract, Althaea Officinalis Leaf/Root Extract, Achillea Millefolium Extract, Sodium Chloride, Parfum (Fragrance), Propylene Glycol, Methylparaben, Propylparaben, Diazolidinyl Urea.",
        "n_loves": "4K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/facial-spray-with-aloe-cucumber-green-tea-P441070",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:23:13",
        "product_name": "Facial Spray with Aloe, Cucumber and Green Tea",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$16.00"
                ],
                "sku": "Item 2192052"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 118 mL"
                ],
                "price": [
                    "$11.00"
                ],
                "sku": "Item 2192045"
            }
        ],
        "rating": "width:82.42399999999999%",
        "product_reviews": "165",
        "ingredients": "-Peppermint Essential Water: Is an antioxidant-rich ingredient with a visibly invigorating kick.  -Cucumber Essential Water and Cucumber Extract: Hydrate and provide a rich supply of amino acids.-Bladderwrack (Seaweed) Extract: Softens skin and has high mineral levels.Aqua (Water, Eau), Propylene Glycol, Mentha Piperita (Peppermint) Leaf Water, Cucumis Sativus (Cucumber) Fruit Water, Aloe Barbadensis Leaf Juice, Camellia Sinensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Fucus Vesiculosus Extract, Propanediol, Polysorbate 20, Ethylhexylglycerin, Benzophenone-4, Parfum (Fragrance), Sodium Chloride, Citric Acid, Potassium Sorbate, Sodium Benzoate, CI 19140 (Yellow 5), CI 42090 (Blue 1), Hexyl Cinnamal, Limonene, Linalool.",
        "n_loves": "12K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Mists & Essences"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/drying-patch-P506011",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:23:26",
        "product_name": "Drying Patch",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 60 / patches",
                    "NEW"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2689560"
            }
        ],
        "rating": "width:60%",
        "product_reviews": "6",
        "ingredients": "-Niacinamide: Visibly balances and regulates oily skin.-Salicylic Acid: BHA exfoliant that reduces blemishes.-Vitamin C (BV-OSC): Supports collagen.Acrylates Copolymer, 1,2-Hexanediol, Sodium Polyacrylate, Butylene Glycol, Pvp, C13-14 Isoparaffin, Niacinamide, Water/Aqua, Salicylic Acid, Centella Asiatica Extract, Phenoxyethanol, Caprylyl/Capryl Glucoside, Sodium Hyaluronate, Tetrahexyldecyl Ascorbate, Laureth-7, Melaleuca Alternifolia (Tea Tree) Extract, Phytosphingosine, Madecassoside.",
        "n_loves": "1.2K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/buttermilk-moisturizer-P441066",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:23:38",
        "product_name": "Buttermilk Moisturizer",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 59 mL"
                ],
                "price": [
                    "$24.00"
                ],
                "sku": "Item 2191989"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "16",
        "ingredients": "-Lactic Acid: Exfoliates and rejuvenates.-Chamomile: Soothing moisture to calm.-Vitamin E: Softens skin and helps defend against skin-aging free radicals.Aqua (Water, Eau), Isopropyl Myristate, Propylene Glycol, Paraffinum Liquidum (Mineral Oil, Huile Minérale), Glyceryl Stearate, Cetyl Alcohol, Allantoin, Chamomilla Recutita (Matricaria) Flower Extract, Thymus Vulgaris (Thyme) Leaf Extract, Tocopherol, Lactic Acid, Cetrimonium Bromide, Parfum (Fragrance), Triethanolamine, Methylparaben, Propylparaben, Sodium Chloride, Citronellol, Ci 42090 (Blue 1), Ci 19140 (Yellow 5).",
        "n_loves": "2.2K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/buffering-lotion-P441067",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:23:49",
        "product_name": "Buffering Lotion",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 29 mL"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2191971"
            }
        ],
        "rating": "width:86.36399999999999%",
        "product_reviews": "44",
        "ingredients": "-Niacinamide (Vitamin B3): Helps rebalance and improve the appearance of troubled skin.-B-Vitamins: Help improve the appearance of skin pigmentation.-Zinc Oxide: Barrier for excess oil production.Isopropyl Alcohol, Propylene Glycol, Zinc Oxide, Hydrolyzed Yeast Protein, Glycerin, Niacinamide, Panthenol, Allantoin, Biotin, Isopropyl Myristate, Stearalkonium Hectorite, Pyridoxine Hcl, Propylene Carbonate+A79:I80.",
        "n_loves": "3.5K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Toners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/super-collagen-mask-P441078",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:24:01",
        "product_name": "Super Collagen Mask",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 56 g"
                ],
                "price": [
                    "$24.00"
                ],
                "sku": "Item 2192151"
            }
        ],
        "rating": "width:82.66600000000001%",
        "product_reviews": "30",
        "ingredients": "-Collagen: Visibly plumps and firms for smooth-looking skin.-Red Algae Extract: Visibly clarifies and cleanses with a rich nutrient supply. -Kaolin Clay: Absorbs oil to visibly purify skin.Aqua (Water, Eau), Kaolin, Talc, Propylene Glycol, Avena Sativa (Oat) Kernel Flour, Sorbitol, Zinc Oxide, Triticum Vulgare (Wheat) Starch, Collagen, Cellulose Gum, Carrageenan, Sodium Chloride, Parfum (Fragrance), Methylparaben, Phenoxyethanol, CI 42090 (Blue 1), CI 19140 (Yellow 5).",
        "n_loves": "4.9K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/facial-spray-with-aloe-herbs-rosewater-P441071",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:24:12",
        "product_name": "Facial Spray with Aloe, Herbs and Rosewater",
        "brand_name": "Mario Badescu",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$16.00"
                ],
                "sku": "Item 2192078"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 118 mL"
                ],
                "price": [
                    "$11.00"
                ],
                "sku": "Item 2192060"
            }
        ],
        "rating": "width:74.53999999999999%",
        "product_reviews": "304",
        "ingredients": "-Rose: Rejuvenating.-Gardenia Extract: Antioxidants.-Thyme Extract: Clarifying. Aqua (Water, Eau), Propylene Glycol, Aloe Barbadensis Leaf Juice, Rosa Canina Extract, Thymus Vulgaris (Thyme) Leaf Extract, Fucus Vesiculosus Extract, Gardenia Florida Fruit Extract, Caprylyl Glycol, Hexylene Glycol, Polysorbate 20, Parfum (Fragrance), Phenoxyethanol, Sodium Chloride, Citronellol, Geraniol, Ci 17200 (Red 33), Ci 42090 (Blue 1).",
        "n_loves": "26.9K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Mists & Essences"
        ]
    }
]