[
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-body-polishing-scrub-P502662",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:56:00",
        "product_name": "Body Polishing Scrub",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 6.7 oz / 200 mL",
                "name": [],
                "price": [
                    "$36.00"
                ],
                "sku": "Item 2612836"
            }
        ],
        "rating": "width:73.126%",
        "product_reviews": "32",
        "ingredients": "-Argan Oil: Hydrates and nourishes skin.-Argan Shell Powder and Lava Stone Pumice: Gently polish away dead skin cells.-Avocado, Rice Bran, Sweet Almond, Safflower, and Grapeseed Oils: Nourish and moisturize while supporting skin's natural defenses.Oryza Sativa (Rice) Bran Oil, Glycerin, Carthamus Tinctorius (Safflower) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Vitis Vinifera (Grape) Seed Oil, Ethylhexyl Palmitate, Isopropyl Palmitate, Polyglyceryl-10 Myristate, Persea Gratissima (Avocado) Oil, Argania Spinosa (Argan) Shell Powder, Pumice, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Helianthus Annuus (Sunflower) Seed Oil, Caprylic/Capric Triglyceride, Styrene/Butadiene Copolymer, Tocopherol.",
        "n_loves": "3.6K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Scrub & Exfoliants"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-treatment-light-P412091",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:56:13",
        "product_name": "Moroccanoil Treatment Light Hair Oil",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$39.00"
                ],
                "sku": "Item 1869486"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.85 oz/ 25 mL"
                ],
                "price": [
                    "$20.00"
                ],
                "sku": "Item 1869502"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2030278"
            }
        ],
        "rating": "width:94.142%",
        "product_reviews": "1.4K",
        "ingredients": " -Argan Oil: Extremely rich in tocopherols (vitamin E), essential fatty acids, and antioxidants that hydrate and nourish the hair. \t\t\n-Linseed Extract: Derived from flaxseed, a good source of alpha linolenic acid; an essential fatty acid that helps improve the health of hair. Cyclomethicone, Dimethicone, Argania Spinosa (Argan) Kernel Oil, Fragrance, Linum Usitatissimum (Linseed) Seed Extract, CI 26100 (Red 17), CI 47000 (Yellow 11).\n",
        "n_loves": "47.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Oil"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-color-care-shampoo-P504835",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:56:27",
        "product_name": "Color Care Shampoo",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz / 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2654515"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.4 oz / 70 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 2654267"
            }
        ],
        "rating": "width:94.06000000000002%",
        "product_reviews": "303",
        "ingredients": "-ArganID™: Infuses argan oil into hair's cortex, helping to seal and repair the hair.-Sun Protection Quat: Color defense shield that helps protect hair from color loss and damage.-Pomegranate Extract: Helps to protect keratin from environmental aggressors.Aqua/Water/Eau, Sodium Cocoyl Isethionate, Sodium Lauroyl Methyl Isethionate, Decyl Glucoside, Acrylates Crosspolymer-4, PEG-120 Methyl Glucose Dioleate, Coconut Acid, Ethylhexylglycerin, Parfum/Fragrance, Lauryl Glucoside, Argania Spinosa (Argan) Kernel Oil, Pyrus Malus (Apple) Fruit Extract, Punica Granatum (Pomegranate) Fruit Extract, Algin, Chitosan, Panthenol, Tocopherol, Quaternium-95, Glyceryl Caprylate/Caprate, Glycerin, Citric Acid, Amodimethicone/Morpholinomethyl Silsesquioxane Copolymer, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Guar Hydroxypropyltrimonium Chloride, C12-13 Pareth-9, Polyquaternium-7, Sorbeth-230 Tetraoleate, Trideceth-5, Caprylic/Capric Triglyceride, Sodium Methyl Isethionate, Lauric Acid, Sorbic Acid, Fumaric Acid, Glycol Stearate, Sodium Laurate, Sorbitan Laurate, Propanediol, Sodium Isethionate, EDTA, Potassium Hydroxide, Chlorphenesin, Potassium Sorbate, Phenoxyethanol, Sodium Benzoate, Alpha-Isomethyl Ionone, Linalool.",
        "n_loves": "4.5K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/intense-hydrating-mask-packette-P425007",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:56:40",
        "product_name": "Intense Hydrating Mask Packette",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$8.50"
                ],
                "sku": "Item 1958610"
            }
        ],
        "rating": "width:87.5%",
        "product_reviews": "152",
        "ingredients": " -Argan Oil: Restores elasticity, smoothness, and manageability to hair.-Glycerin: Natural humectant that provides moisturizing benefits.-Linseed Extract: Derived from flaxseed, a good source of alpha linolenic acid, an essential fatty acid that helps improve the health of hair. Water, Cetearyl Alcohol, Argania Spinosa (Argan) Kernel Oil, Glycerin, Dimethicone, Cetrimonium Chloride, Cetyl Alcohol, Behentrimonium Chloride, Isopropyl Alcohol, Fragrance, DMDM Hydantoin, Citric Acid, CI 19140 (Yellow 5), Linum Usitatissimum (Linseed) Seed Extract, CI 15985 (Yellow 6), Butylphenyl Methylpropional, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Linalool, Alpha-Isomethylionone.Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "21.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-leave-in-conditioner-P462387",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:56:52",
        "product_name": "All in One Leave-In Conditioner",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.4 oz/ 160 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2395069"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$16.00"
                ],
                "sku": "Item 2395051"
            }
        ],
        "rating": "width:91.78%",
        "product_reviews": "2K",
        "ingredients": "-Argan Oil: Contains tocopherols (vitamin E), essential fatty acids, and antioxidants that nourish hair. -Superfood Blend: Helps to moisturize, condition, and provide antioxidant activity. -Pure Amino Acids: Support hair and enhance elasticity. Aqua/Water/Eau, Cetearyl Alcohol, Propanediol, Cetyl Alcohol, Argania Spinosa (Argan) Kernel Oil, Helianthus Annuus (Sunflower) Seed Oil, Hordeum Vulgare Seed Extract, Parfum/Fragrance, Hydrolyzed Rice Protein, Hydrolyzed Quinoa, Wheat Amino Acids, Soy Amino Acids, Citric Acid, Glucose, Glycerin, Dimethicone, Caprylic/Capric Triglyceride, Behentrimonium Methosulfate, Stearamine Oxide, Olealkonium Chloride, Behentrimonium Chloride, Amodimethicone, Isopropyl Alcohol, Caprylic/Capric Glycerides Polyglyceryl-10 Esters, Xylitylglucoside, Guar Hydroxypropyltrimonium Chloride, Anhydroxylitol, Glyceryl Stearate SE, Cinnamidopropyltrimonium Chloride, Xylitol, Trideceth-12, Polyquaternium-7, Polyquaternium-11, C12-13 Pareth-9, Cetrimonium Chloride, Arginine HCL, Serine, Threonine, Algin, Chitosan, Potassium Sorbate, Sodium Benzoate, Benzyl Alcohol, Phenoxyethanol.",
        "n_loves": "63.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Leave-In Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-mini-brumes-du-maroc-hair-body-fragrance-mist-P474354",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:57:05",
        "product_name": "Mini Hair & Body Fragrance Mist",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$20.00"
                ],
                "sku": "Item 2483121"
            }
        ],
        "rating": "width:73.334%",
        "product_reviews": "117",
        "ingredients": " -Argan Oil: Rich in fatty acids and antioxidants that hydrate and nourish skin and hair.-Vitamin E: Supports natural moisture balance in skin and hair.-Sun-Exposure Absorber: Protects hair from UV rays. SD Alcohol 40-B (Alcohol Denat.), Aqua/Water/Eau, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Tocopheryl Acetate, Dimethicone PEG-8 Meadowfoamate, Glycerin, Isopropyl Palmitate, Ethoxydiglycol, Polyquaternium-59, Butylene Glycol, Cetrimonium Chloride, Linalool, Alpha-Isomethyl Ionone, Benzyl Benzoate, Limonene.",
        "n_loves": "23.8K",
        "categories": [
            "Fragrance",
            "Women",
            "Body Mist & Hair Mist"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moisture-repair-conditioner-P412084",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:57:17",
        "product_name": "Moisture Repair Conditioner",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030369"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.4 oz/ 70 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1869700"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 16.9 oz / 500 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2433720"
            }
        ],
        "rating": "width:87.56600000000002%",
        "product_reviews": "859",
        "ingredients": " -Argan Oil: Restores elasticity, smoothness, and manageability to hair.\n-Lavender, Rosemary, Chamomile, and Jojoba Extracts: Natural plant extracts that provide nourishment to dry hair.\n-Cocamide Mea: Made from fatty acids that are derived from coconut oil.\n- Keratin: A structural protein that rebuilds and strengthens damaged or porous hair.\n\n AQUA/WATER/EAU, CETEARYL ALCOHOL, BEHENTRIMONIUM CHLORIDE, PPG-3 BENZYL ETHER MYRISTATE, STEARAMIDOPROPYL DIMETHYLAMINE, GLYCERIN, QUATERNIUM-98, ARGANIA SPINOSA (ARGAN) KERNEL OIL, PERSEA GRATISSIMA (AVOCADO) OIL, SIMMONDSIA CHINENSIS (JOJOBA) SEED OIL, CHAMOMILLA RECUTITA (MATRICARIA) FLOWER EXTRACT, LAVANDULA ANGUSTIFOLIA (LAVENDER) FLOWER EXTRACT, ROSMARINUS OFFICINALIS (ROSEMARY) LEAF EXTRACT, HYDROLYZED VEGETABLE PROTEIN PG-PROPYL SILANETRIOL, SILK AMINO ACIDS, HYDROLYZED KERATIN, KERATIN AMINO ACIDS, CELLULOSE, HYDROXYETHYLCELLULOSE, PANTHENOL, CITRIC ACID, DIMETHICONE, DIMETHICONOL, LINOLEAMIDOPROPYL PG-DIMONIUM CHLORIDE PHOSPHATE DIMETHICONE, POLYQUATERNIUM-37, PPG-1 TRIDECETH-6, QUATERNIUM-80, CAPRYLYL GLYCOL, PROPYLENE GLYCOL, PROPYLENE GLYCOL DICAPRYLATE/DICAPRATE, ACRYLATES COPOLYMER, DISODIUM EDTA, SODIUM PCA, PARFUM/FRAGRANCE, GUAR HYDROXYPROPYLTRIMONIUM CHLORIDE, CINNAMIDOPROPYLTRIMONIUM CHLORIDE, POLYACRYLAMIDOPROPYLTRIMONIUM CHLORIDE, CETRIMONIUM CHLORIDE, DEHYDROACETIC ACID, ISOPROPYL ALCOHOL, SORBITAN OLEATE, BENZYL ALCOHOL, CHLORPHENESIN, PHENOXYETHANOL, POTASSIUM SORBATE, SODIUM ACETATE, SODIUM BENZOATE, Cl 17200 (RED 33), Cl 19140 (YELLOW 5), ALPHA-ISOMETHYL IONONE, LINALOOL. MOMRC03",
        "n_loves": "32.5K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/curl-control-mousse-P427314",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:57:31",
        "product_name": "Curl Control Mousse",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.1 oz/ 150 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2030427"
            }
        ],
        "rating": "width:68.88799999999999%",
        "product_reviews": "45",
        "ingredients": " -Argan Oil: Rich in tocopherols (vitamin E), essential fatty acids, and antioxidants to nourish hair.-Cocamidopropyl Hydroxysultaine: A natural surfactant and anti-static agent derived from coconut.-Polyquaternium-11: An anti-static agent; forms lightweight fi lm around hair that holds curl.-Hydrolyzed Vegetable Protein: Absorbs into hair, building strength from within to reinforce and protect the surface of the hair.Water, Cocamidopropyl Hydroxysultaine, Polysorbate 20, Peg-40 Hydrogenated Castor Oil, Polyquaternium-72, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Polyquaternium-11, Dipropylene Glycol, Phenoxyethanol, Tetrasodium EDTA, Citric Acid, Chlorphenesin, Polyquaternium-70, Caprylyl Glycol. ",
        "n_loves": "11.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dry-shampoo-dark-tones-P412098",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:57:43",
        "product_name": "Dry Shampoo Dark Tones",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.4 oz/ 205 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 1873835"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 65 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1869312"
            }
        ],
        "rating": "width:85.95599999999999%",
        "product_reviews": "460",
        "ingredients": "-Argan Oil: Hydrates and nurtures the hair with tocopherols (vitamin E), essential fatty acids, and antioxidants.-Rice Starch: A natural absorbent that draws out excess oil.  Hydrofluorocarbon 152a, Butane, Oryza Sativa (Rice) Starch, SD Alcohol 40-B (Alcohol Denat.), Disiloxane, Argania Spinosa (Argan) Kernel Oil, PVP, Aqua/Water/Eau, Parfum/Fragrance, Magnesium Stearate, Diisopropyl Adipate, Cetrimonium Chloride, Methoxycinnamidopropyl Hydroxysultaine, CI 60725 (Violet 2), CI 17200 (Red 33). Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date ingredient information and any warnings or instructions.",
        "n_loves": "40.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-blonde-perfecting-purple-conditioner-P477204",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:57:56",
        "product_name": "Blonde Perfecting Purple Conditioner",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz./ 200 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2524205"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.4 oz/ 70 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 2524973"
            }
        ],
        "rating": "width:91.24000000000001%",
        "product_reviews": "911",
        "ingredients": "Aqua/Water/Eau,Cetyl Alcohol, Stearyl Alcohol, Behentrimonium Chloride, Hydroxypropyl Starch Phosphate, Prunus Armeniaca (Apricot) Kernel Oil, Polyquaternium-70, Behentrimonium Methosulfate, Bis-Hydroxy/Methoxy Amodimethicone, Parfum/Fragrance, PEG-12 Dimethicone, Argania Spinosa (Argan) Kernel Oil, Alanine, Algin, Arginine, Aspartic Acid, Glycine, Histidine, Isoleucine, Phenylalanine, Proline, Serine, Threonine, Valine, Chitosan, Panthenol, C11-15 Pareth-7, C12-13 Pareth-9, Quaternium-87, Trideceth-6, Caprylyl Glycol, Dipropylene Glycol, Guar Hydroxypropyltrimonium Chloride, Isopropyl Alcohol, Silica Dimethyl Silylate, Hydroxyacetophenone, Citric Acid, Acetic Acid, EDTA, Disodium EDTA, PCA, Sodium PCA, Sodium Acetate, Sodium Hydroxide, Sodium Lactate, CI 60730 (Ext. Violet No. 2), Propoxytetramethyl Piperidinyl Dimethicone, Caprylic/Capric Triglyceride, Phenoxyethanol, Chlorphenesin, Potassium Sorbate, Sodium Benzoate, Cetearyl Alcohol, Alpha-Isomethyl Ionone, Linalool. MOPC01",
        "n_loves": "6.8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/night-body-serum-P435939",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:58:08",
        "product_name": "Night Body Serum",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$68.00"
                ],
                "sku": "Item 2135598"
            }
        ],
        "rating": "width:93.558%",
        "product_reviews": "1.5K",
        "ingredients": "-Advanced Antioxidant-rich Blend of Argan and Tsubaki Oils: Helps to firm and nurture the skin.-Holy Basil Extract: Helps protect skin from environmental stress.-Vitamin C Ester: Helps smooth and strengthen skin for a more radiant, youthful-looking appearance. Dimethicone, Isononyl Isononanoate, C12-15 Alkyl Benzoate, Dimethiconol, Caprylyl Methicone, Isopropyl Palmitate, Dimethicone/Vinyl Dimethicone Crosspolymer, Argania Spinosa (Argan) Kernel Oil, Camellia Japonica Seed Oil, Tetrahexyldecyl Ascorbate, Propylene Glycol Caprylate, Ocimum Sanctum (Basil) Leaf Extract, Parfum/Fragrance, Palmitic Acid, Dimethylmethoxy Chromanol, Benzoic Acid.",
        "n_loves": "34.3K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/intense-curl-cream-P427316",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:58:19",
        "product_name": "Intense Curl Cream",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10.2 oz/ 300 mL"
                ],
                "price": [
                    "$40.00"
                ],
                "sku": "Item 2030435"
            }
        ],
        "rating": "width:71.326%",
        "product_reviews": "83",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.  -Polyquaternium-7: An antistatic agent. -Tocopheryl Acetate: A form of vitamin E. Aqua/Water/Eau, Paraffinum Liquidum (Mineral Oil), Cetyl Alcohol, Polyquaternium-7, Glyceryl Stearate, Dimethicone, Petrolatum, Argania Spinosa (Argan) Kernel Oil, Tocopheryl Acetate, Panthenol, Parfum/Fragrance, DMDM Hydantoin, Cetrimonium Chloride, Citric Acid, Hydroxycitronellal, Isoeugenol, Linalool, Benzyl Benzoate,  Citronellol, Hexyl Cinnamal, Alpha-Isomethyl Ionone. Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "19K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Leave-In Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dry-body-oil-P412115",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:58:31",
        "product_name": "Dry Body Oil",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 1872852"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 1906239"
            }
        ],
        "rating": "width:82.91600000000001%",
        "product_reviews": "192",
        "ingredients": "-Argan Oil: Helps to hydrate and nurture the skin to help improve its texture and tone.-Olive Oil: Moisturizes, protects, and nurtures skin. -Avocado Oil: Penetrates the skin with powerful antioxidants, vitamins and essential fatty acids that help build skin’s natural defenses and restore moisture.CAPRYLIC/CAPRIC TRIGLYCERIDE, CYCLOPENTASILOXANE, COCO-CAPRYLATE, OLEA EUROPAEA (OLIVE) FRUIT OIL, ARGANIA SPINOSA (ARGAN) KERNEL OIL, PERSEA GRATISSIMA (AVOCADO) OIL, PARFUM/FRAGRANCE, BHT, ALPHA-ISOMETHYL IONONE, LINALOOL, HYDROXYCITRONELLAL, BENZYL BENZOATE. MODBO03Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date ingredient information and any warnings or instructions.",
        "n_loves": "29.8K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-body-tm-soap-P438602",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:58:44",
        "product_name": "Moroccanoil Body™ Soap",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 7 oz/ 200 g",
                "name": [
                    "Scent: Fragrance Originale"
                ],
                "price": [
                    "$16.00"
                ],
                "sku": "Item 2135606"
            }
        ],
        "rating": "width:74.21%",
        "product_reviews": "76",
        "ingredients": "-Argan Oil: Helps hydrate and nourish the skin.-Shea Butter: Increases moisture and strengthens the skin barrier.-Aloe Leaf Extract: Nourishes with a natural cooling extract. Sodium Palmate, Sodium Cocoate, Water, Glycerin, Parfum/Fragrance, Coconut Acid, Argania Spinosa (Argan) Kernel Oil, Butyrospermum Parkii (Shea) Butter, Aloe Barbadensis (Aloe Vera) Leaf Juice, Sodium Chloride, Sodium Gluconate, Sorbitol, Tetrasodium Glutamate Diacetate, CI 77891 (Titanium Dioxide), CI 77007 (Ultramarines), CI 42090 (Blue 1). ",
        "n_loves": "10.8K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/extra-volume-shampoo-P412089",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:58:56",
        "product_name": "Extra Volume Shampoo",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030310"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16.9 oz / 500 mL"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2539674"
            }
        ],
        "rating": "width:67.038%",
        "product_reviews": "108",
        "ingredients": " -Argan Oil: Restores elasticity, smoothness, and manageability to hair.\n-Glycerin: Natural humectant; provides hair moisturizing benefits.\n-Cocamide Mea: Made from fatty acids derived from coconut oil.\n-Tilia Tomentosa Bud Extract (Linden Bud Extract): Naturally plumps up the hair as it conditions.\n\n Water, Dimethicone, Cetearyl Alcohol, Fragrance, Behentrimonium Chloride, Canola Oil, Argania Spinosa (Argan) Kernel Oil, Nasturtium Officinale Leaf Extract, Allium Sativum (Garlic) Bulb Extract, Lamium Album Flower Extract, Pinus Sylvestris Bud Extract, Arctium Lappa Root Extract, Anthemis Nobilis Flower Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Hedera Helix (Ivy) Extract, Arnica Montana Flower Extract, Tilia Tomentosa Bud Extract, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Glycerin, Propylene Glycol, Caprylyl Glycol, Isopropyl Alcohol, Citric Acid, Disodium Edta, Chlorphenesin, Phenoxyethanol, Sodium Benzoate, Potassium Sorbate, Butylphenyl Methylpropional, Hydroxyisohexyl 3- Cyclohexene Carboxaldehyde, Linalool, Alpha-Isomethyl Ionone.",
        "n_loves": "13.4K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hydrating-styling-cream-P412096",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:59:08",
        "product_name": "Hydrating Styling Cream",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10.2 oz/ 300 mL"
                ],
                "price": [
                    "$40.00"
                ],
                "sku": "Item 1999630"
            }
        ],
        "rating": "width:91.014%",
        "product_reviews": "1.5K",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.  -Behentrimonium Chloride: An anti-static and conditioning agent.Water, Dimethicone, Cetearyl Alcohol, Fragrance, Argania Spinosa (Argan) Kernel Oil, Behentrimonium Chloride, Phenoxyethanol, Glyceryl Stearate Se, Caprylyl Glycol, Isopropyl Alcohol, Chlorphenesin, Citric Acid, CI 15985 (Yellow 6), Eugenol, Butylphenyl Methylpropional, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Linalool, Alpha-Isomethyl Ionone.Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "61.9K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/smoothing-lotion-P425012",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:59:20",
        "product_name": "Smoothing Lotion",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10.2 oz/ 300 mL"
                ],
                "price": [
                    "$40.00"
                ],
                "sku": "Item 2030575"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.53 oz/ 75 mL"
                ],
                "price": [
                    "$18.00"
                ],
                "sku": "Item 1999648"
            }
        ],
        "rating": "width:85.96999999999998%",
        "product_reviews": "67",
        "ingredients": "-Argan Oil: Nurtures with tocopherols (vitamin E), essential fatty acids, and antioxidants.-Argan Butter: Nurtures.-Tilia Tomentosa Bud Extract: Forms a protective film as it moisturizes and reduces static. AQUA/WATER/EAU, CYCLOMETHICONE, DIMETHICONE, CETEARYL ALCOHOL, GLYCERIN, PARFUM/FRAGRANCE, BEHENTRIMONIUM CHLORIDE, POLYQUATERNIUM-70, POLYQUATERNIUM-11, STEARETH-2, ARGANIA SPINOSA (ARGAN) KERNEL OIL, HYDROGENATED VEGETABLE OIL, TILIA TOMENTOSA BUD EXTRACT, CAPRYLYL GLYCOL, DIPROPYLENE GLYCOL, ISOPROPYL ALCOHOL, GLYCERYL STEARATE, CITRIC ACID, OLETH-10, CHLORPHENESIN, PHENOXYETHANOL, POTASSIUM SORBATE, SODIUM BENZOATE, CI 26100 (RED 17), CI 47000 (YELLOW 11), ALPHA-ISOMETHYL IONONE, LINALOOL, HYDROXYCITRONELLAL, BENZYL BENZOATE. MOSL04",
        "n_loves": "14K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/color-depositing-mask-P447377",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:59:33",
        "product_name": "Color Depositing Mask",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 6.7 oz/ 200 mL",
                "name": [
                    "Color: Platinum"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2267409"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "OUT OF STOCK"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2577187"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 6.7 oz/ 200 mL",
                "name": [
                    "Color: Rose Gold"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2267458"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 6.7 oz/ 200 mL",
                "name": [
                    "Color: Bordeaux"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2267441"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": "Size 6.7 oz/ 200 mL",
                "name": [
                    "Color: Champagne",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2267466"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": "Size 6.7 oz / 200 ml",
                "name": [
                    "Color: Clear",
                    "NEW"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2668333"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": "Size 1 oz/ 30 mL",
                "name": [
                    "Color: Rose Gold"
                ],
                "price": [
                    "$8.50"
                ],
                "sku": "Item 2267524"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": "Size 1 oz/ 30 mL",
                "name": [
                    "Color: Platinum"
                ],
                "price": [
                    "$8.50"
                ],
                "sku": "Item 2267474"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": "NEW",
                "size": "Size 1 oz / 30 ml",
                "name": [
                    "Color: Clear",
                    "NEW"
                ],
                "price": [
                    "$8.50"
                ],
                "sku": "Item 2668325"
            }
        ],
        "rating": "width:72.99%",
        "product_reviews": "950",
        "ingredients": " -ArganID™: Provides antioxidant benefits while simultaneously helping to support natural hair repair processes.\n-Amino Acid Blend: Hydrates and nurtures, providing detangling and shine benefits for hair that looks and feels healthy.\n-Apricot Kernel Oil: Helps soften hydrate the hair and scalp.\nAqua/Water/Eau, Cetearyl Alcohol, Cetyl Alcohol, Behentrimonium Chloride, Propoxytetramethyl Piperdinyl Dimethicone, PEG-12 Dimethicone, Prunus Armeniaca (Apricot) Kernel Oil, Parfum/Fragrance, Bis-Hydroxy/Methoxy Amodimethicone, Argania Spinosa (Argan) Kernel Oil, Hydrolyzed Soy Protein, Algin, Arginine, Aspartic Acid, Glycine, Alanine, Serine, Valine, Isoleucine, Proline, Threonine, Histidine, Phenylalanine, Chitosan, Citric Acid, Acetic Acid, Guar Hydroxypropyltrimonium Chloride, Hydroxypropyl Starch Phosphate, Panthenol, Caprylic/Capric Triglyceride, Behentrimonium Methosulfate, C11-15 Pareth-7, C12-13 Pareth-9, Caprylyl Glycol, Polyquaternium-70, Dipropylene Glycol, Isopropyl Alcohol, Disodium EDTA, Quaternium-87, PCA, Sodium PCA, Hydroxyacetophenone, Trideceth-6, Silica Dimethyl Silylate, Chlorphenesin, Sodium Acetate, Sodium Benzoate, Sodium Lactate, Sodium Hydroxide, Phenoxyethanol, Potassium Sorbate, CI 56059 (Basic Blue 99), CI 12245 (Basic Red 76), Alpha-Isomethyl Ionone, Linalool. ",
        "n_loves": "32.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-dive-into-hydration-body-in-line-set-2023-P504816",
        "error": "",
        "scrape_timestamp": "08/22/2023, 03:59:50",
        "product_name": "Dive Into Hydration Head-to-Toe Set",
        "brand_name": "Moroccanoil",
        "options": [],
        "rating": "width:95.556%",
        "product_reviews": "9",
        "ingredients": "-Argan Oil: Hydrates and nurtures with a rich supply of fatty acids and antioxidants.Moroccanoil Treatment:Cyclomethicone, Dimethicone, Argania Spinosa (Argan) Kernel Oil, Fragrance, Linum Usitatissimum (Linseed) Seed Extract, CI 26100 (Red 17), CI 47000 (Yellow 11).Shower Gel:Aqua/Water/Eau, Sodium C14-16 Olefin Sulfonate, Disodium Lauroamphodiacetate, Cocamidopropyl Betaine, Parfum/Fragrance, Glycerin, Argania Spinosa (Argan) Kernel Oil, Tocopherol, Peg-7 Glyceryl Cocoate, Peg-40 Hydrogenated Castor Oil, Peg-120 Methyl Glucose Dioleate, Peg-120 Methyl Glucose Trioleate, Polyquaternium-10, Citric Acid, Caprylyl Glycol, Propanediol, Isopropyl Alcohol, Sodium Glycolate, Sodium Chloride, Sodium Acetate, Tetrasodium Edta, Chlorphenesin, Phenoxyethanol, Caramel.Dry Body Oil:Caprylic/Capric Triglyceride, Cyclopentasiloxane, Coco-Caprylate, Olea Europaea (Olive) Fruit Oil, Argania Spinosa (Argan) Kernel Oil, Persea Gratissima (Avocado) Oil, Parfum/Fragrance, Bht, Alpha-Isomethyl Ionone, Linalool, Hydroxycitronellal, Benzyl Benzoate. Hair & Body Fragrance Mist:Sd Alcohol 40-B (Alcohol Denat.), Aqua/Water/Eau, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Tocopheryl Acetate, Dimethicone Peg-8 Meadowfoamate, Glycerin, Isopropyl Palmitate, Ethoxydiglycol, Polyquaternium-59, Butylene Glycol, Cetrimonium Chloride, Linalool, Alpha-Isomethyl Ionone, Benzyl Benzoate, Limonene.",
        "n_loves": "8.5K",
        "categories": [
            "Hair",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-treatment-P412090",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:00:01",
        "product_name": "Moroccanoil Treatment Hair Oil",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$39.00"
                ],
                "sku": "Item 1869478"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2030286"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.85 oz/ 25 mL"
                ],
                "price": [
                    "$20.00"
                ],
                "sku": "Item 1869494"
            }
        ],
        "rating": "width:92.38%",
        "product_reviews": "2K",
        "ingredients": " -Argan Oil: Extremely rich in tocopherols (vitamin E), essential fatty acids, and antioxidants that hydrate and nourish the hair. \t\t\n-Linseed Extract: Derived from flaxseed, a good source of alpha linolenic acid; an essential fatty acid that helps improve the health of hair. Cyclomethicone, Dimethicone, Argania Spinosa (Argan) Kernel Oil, Fragrance, Linum Usitatissimum (Linseed) Seed Extract, CI 26100 (Red 17), CI 47000 (Yellow 11).\n",
        "n_loves": "226.3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Oil"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-blonde-perfecting-purple-shampoo-P458508",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:00:14",
        "product_name": "Blonde Perfecting Purple Shampoo",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2325850"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.4 oz/ 70 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 2325868"
            }
        ],
        "rating": "width:91.202%",
        "product_reviews": "3K",
        "ingredients": " -ArganID™ Technology: Infuses the antioxidant powers of argan oil into hair while simultaneously helping to repair and seal the cuticle.-Violet Pigments: Impart color and visual effect, enhancing depth, dimension, and provide a natural-looking sheen. Aqua/Water/Eau, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocamidopropylamine Oxide, Parfum/Fragrance, Guar Hydroxypropyltrimonium Chloride, Argania Spinosa (Argan) Kernel Oil, PEG-40 Hydrogenated Castor Oil, Acrylates Copolymer, PEG-150 Distearate, Glycol Stearate, Hydroxyacetophenone, Algin, Glycerin, Chitosan, Trideceth-9, C12-13 Pareth-9, C11-15 Pareth-7, C12-16 Pareth-9, Silica Dimethyl Silylate, Isopropyl Alcohol, Trideceth-12, Citric Acid, Coconut Acid, Cocamidopropyl Dimethylamine, Caprylyl Glycol, Cetrimonium Chloride, Sodium Glycolate, CI 60730 (Ext. Violet No. 2), Trimethylsiloxyamodimethicone, Caprylic/Capric Triglyceride, Phenoxyethanol, Chlorphenesin, Potassium Sorbate, Sodium Benzoate, Alpha-Isomethyl Ionone, Linalool.",
        "n_loves": "25.3K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/perfect-defense-P425242",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:00:27",
        "product_name": "Perfect Defense Heat Protectant",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6 oz/ 225 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2030559"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 75 mL"
                ],
                "price": [
                    "$16.00"
                ],
                "sku": "Item 1999663"
            }
        ],
        "rating": "width:91.862%",
        "product_reviews": "2.5K",
        "ingredients": "-Argan Oil: Hydrates and nurtures the hair with tocopherols (vitamin E), essential fatty acids, and antioxidants. -Panthenol: A form of vitamin B5 that hydrates and imparts a glossy finish. -Octylacrylamide/Acrylates/Butylaminoethyl Methacrylate Copolymer: Provides thermal protection.Dimethyl Ether, SD Alcohol 40-b (Alcohol Denat.), Aqua/Water/Eau, Butylene Glycol, Octylacrylamide/Acrylates/Butylaminoethyl Methacrylate Copolymer, Argania Spinosa (Argan) Kernel Oil, Achillea Millefolium (Common Yarrow) Extract, Geranium Maculatum (Spotted Cranesbill) Extract, Lentinus Edodes (Shiitake Mushroom) Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Salvia Officinalis (Sage) Leaf Extract, Parfum/Fragrance, Peg-40 Hydrogenated Castor Oil, Aminomethyl Propanol, Panthenol, Cetearamidoethyldiethonium Succinoyl Hydrolyzed Pea Protein, Glycerin, Tocopheryl Acetate, Ppg-12 Dimethicone, Hydroxypropyl Methacrylate, Benzoic Acid, Linalool, Alpha-Isomethyl Ionone.Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "54.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/glimmer-shine-P412107",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:00:39",
        "product_name": "Glimmer Shine",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2030526"
            }
        ],
        "rating": "width:80.666%",
        "product_reviews": "60",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair. -Wheat Germ Oil: Hair-conditioning agent rich in vitamin E with antioxidant benefits.   Cyclomethicone, Dimethicone, Argania Spinosa (Argan) Kernel Oil, Parfum/Fragrance, Triticum Vulgare (Wheat) Germ Oil, Panthenol, CI 26100 (Red 17), CI 47000 (Yellow 11). Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "19.9K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Oil"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-body-lotion-P481721",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:00:51",
        "product_name": "Body Lotion Moisturizer",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Spa du Maroc",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 2539955"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Fragrance Originale"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 2539690"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Oud Mineral",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 2539849"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Bergamote Fraiche"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 2539740"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Ambiance de Plage"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 2539898"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Ambre Noir",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 2539799"
            }
        ],
        "rating": "width:91.59%",
        "product_reviews": "2K",
        "ingredients": "-Argan Oil: Is rich in antioxidants to help hydrate and nourish skin.-Aloe Leaf Extract: A naturally cooling extract that nourishes.-Tsubaki Oil: Helps strengthen and tighten the look of skin.Aqua/Water/Eau, Aloe Barbadensis (Aloe Vera) Leaf Juice, Glycerin, DI-C12-15 Alkyl Fumarate, Argania Spinosa (Argan) Kernel Oil, Caprylic/Capric Triglyceride, Glyceryl Stearate, PEG-100 Stearate, Butylene Glycol, Oenothera Biennis (Evening Primrose) Oil, Parfum/Fragrance, Cetyl Alcohol, Plukenetia Volubilis Seed Oil, Camellia Japonica Seed Oil, Citric Acid, Tocopherol, Caprylyl Glycol, Sodium PCA, Ethylhexylglycerin, Sodium Hyaluronate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Xanthan Gum, Isohexadecane, Tocopheryl Acetate, Disodium EDTA, Polysorbate 60, Hydroxyacetophenone, Sodium Lactate, Aspartic Acid, Valine, Arginine, Glutamic Acid, Serine, Alanine, Phenylalanine, Threonine, Lysine HCL, Proline, Isoleucine, Histidine, Sorbitan Isostearate, Betaine, Glycine, PCA, Sodium Benzoate, Potassium Sorbate, Chlorphenesin, Phenoxyethanol. ",
        "n_loves": "25.6K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-hand-cream-P502746",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:01:07",
        "product_name": "Hand Cream",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 3.4 oz / 100 mL",
                "name": [
                    "Scent: Fragrance Originale - Amber, Magnolia, Woods"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2539716"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 3.4 oz / 100 mL",
                "name": [
                    "Scent: Ambre Noir - Coastal Amber, Egyptian Geranium, White Cardamom",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2539815"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 3.4 oz / 100 mL",
                "name": [
                    "Scent: Ambiance de Plage - Gardenia Petals, Shredded Coconut, Pineapple",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2539914"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 3.4 oz / 100 mL",
                "name": [
                    "Scent: Oud Mineral - Mediterranean Sea Salt, Charred Cedarwood, Petitgrain",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2539864"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 3.4 oz / 100 mL",
                "name": [
                    "Scent: Spa du Maroc - Zanzibar Clove, Black Currant Absolute, Wild Patchouli",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2539963"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 3.4 oz / 100 mL",
                "name": [
                    "Scent: Bergamote Fraiche - Italian Bergamot, Peppermint, Lemon Oil",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$25.00"
                ],
                "sku": "Item 2539765"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": "Size 1.35 oz / 40 mL",
                "name": [
                    "Scent: Fragrance Originale - Amber, Magnolia, Woods"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 2539724"
            }
        ],
        "rating": "width:87.896%",
        "product_reviews": "884",
        "ingredients": "Aqua/Water/Eau, Ethylhexyl Palmitate, Cetyl Alcohol, Glycerin, Ceteareth-20, Hydroxypropyl Starch Phosphate, Glyceryl Stearate, Propanediol, Cetearyl Alcohol, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Butyrospermum Parkii (Shea) Butter, Macadamia Ternifolia (Macadamia) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Hydroxyacetophenone, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Squalane, Tocopheryl Acetate, Caprylyl Glycol, Potassium Hydroxide, Disodium EDTA, Polysorbate 60, Sorbitan Isostearate, Citric Acid, Sodium Hyaluronate, Ethylhexylglycerin, Chlorphenesin, Phenoxyethanol, Caramel. MOHCRO05\nDisclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.\n",
        "n_loves": "10.4K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Hand Cream & Foot Cream"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dry-shampoo-light-tones-P412099",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:01:23",
        "product_name": "Dry Shampoo Light Tones",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.4 oz/ 205 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 1873827"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 65 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1869304"
            }
        ],
        "rating": "width:92.506%",
        "product_reviews": "379",
        "ingredients": "-Argan Oil: Hydrate and nurutre the hair with tocopherols (Vitamin E), essential fatty acids, and antioxidants. -Rice Starch: A natural absorbent that draws out excess oil.   Hydrofluorocarbon 152a, Butane, Oryza Sativa (Rice) Starch, SD Alcohol 40-B (Alcohol Denat.), Disiloxane, Argania Spinosa (Argan) Kernel Oil, PVP, Aqua/Water/Eau, Parfum/Fragrance, Magnesium Stearate, Diisopropyl Adipate, Cetrimonium Chloride, Methoxycinnamidopropyl Hydroxysultaine, CI 60725 (Violet 2), CI 17200 (Red 33). Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "31.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Dry Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-hand-wash-P481722",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:01:36",
        "product_name": "Hand Wash",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Bergamote Fraiche",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539757"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Oud Mineral",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539856"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Spa du Maroc"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539948"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Fragrance Originale"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539708"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Ambiance de Plage",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539906"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 12.2 oz/ 360 mL",
                "name": [
                    "Scent: Ambre Noir",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539807"
            }
        ],
        "rating": "width:96.62%",
        "product_reviews": "355",
        "ingredients": "-Argan Oil: Rich in antioxidants, it helps hydrate and nourish.-Hyaluronic Acid: Helps hydrate, visibly enhance suppleness, and reduce the appearance of fine, dry lines.-Glycerin: Helps tighten the look of skin and provide long-lasting moisture.Aqua/Water/Eau, Sodium C14-16 Olefin Sulfonate, Glycerin, Disodium Lauroamphodiacetate, Cocamidopropyl Betaine, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Citric Acid, PEG-40 Hydrogenated Castor Oil, Tocopherol, Tetrasodium EDTA, PEG-7 Glyceryl Cocoate, Sodium Glycolate, PEG-120 Methyl Glucose Dioleate, Caprylyl Glycol, Sodium Chloride, Polyquaternium-10, PEG-120 Methyl Glucose Trioleate, Sodium PCA, Sodium Acetate, Isopropyl Alcohol, Sodium Hyaluronate, Propanediol, Ethylhexylglycerin, Caramel, Chlorphenesin, Phenoxyethanol.",
        "n_loves": "8.2K",
        "categories": [
            "Bath & Body",
            "Body Care",
            "Hand Sanitizer & Hand Soap"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/curl-defining-cream-P412095",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:01:52",
        "product_name": "Curl Defining Cream",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$40.00"
                ],
                "sku": "Item 1926971"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.53 oz/ 75 mL"
                ],
                "price": [
                    "$18.00"
                ],
                "sku": "Item 1873140"
            }
        ],
        "rating": "width:81.192%",
        "product_reviews": "1.2K",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.-Polyquaternium-11: Forms a lightweight film around hair to hold curl. -Hydrolyzed Vegetable Protein: Coats porous strands and split ends.AQUA/WATER/EAU, CETEARYL ALCOHOL, GLYCOL STEARATE, CETYL ALCOHOL, BEHENTRIMONIUM METHOSULFATE, PARFUM/FRAGRANCE, DIMETHICONE, PHENYL TRIMETHICONE, POLYQUATERNIUM-11, STEARETH-2, ARGANIA SPINOSA (ARGAN) KERNEL OIL, HYDROLYZED VEGETABLE PROTEIN PG-PROPYL SILANETRIOL, CELLULOSE, HYDROXYETHYLCELLULOSE, PG-HYDROXYETHYLCELLULOSE COCODIMONIUM CHLORIDE, GLUCOSE, CETEARYL GLUCOSIDE, SORBITAN OLEATE, DIPHENYL DIMETHICONE, ACRYLATES COPOLYMER, POLYQUATERNIUM-10, POLYQUATERNIUM-37, POLYQUATERNIUM-55, PPG-1 TRIDECETH-6, BUTYLENE GLYCOL, CAPRYLYL GLYCOL, PROPYLENE GLYCOL DICAPRYLATE/DICAPRATE, CITRIC ACID, DISODIUM EDTA, C10-40 ISOALKYLAMIDOPROPYLETHYLDIMONIUM ETHOSULFATE, SODIUM ACETATE, POTASSIUM SORBATE, CHLORPHENESIN, PHENOXYETHANOL, ALPHA-ISOMETHYL IONONE, BENZYL BENZOATE, HYDROXYCITRONELLAL, LINALOOL. MOCDC04",
        "n_loves": "62K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-body-butter-P477717",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:02:04",
        "product_name": "Body Butter Moisturizer",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$42.00"
                ],
                "sku": "Item 2524007"
            }
        ],
        "rating": "width:90.8%",
        "product_reviews": "50",
        "ingredients": "-Argan Oil: Helps hydrate and nourish skin.-Shea Butter, Cocoa Butter, and Mango Butter: Help increase moisture and strengthen skin-barrier functions.-Hyaluronic Acid: Attracts and locks in moisture.Water/Aqua, C12-15 Alkyl Benzoate, Octyldodecanol, Glycerin, Glyceryl Stearate, Caprylic/Capric Triglyceride, Isocetyl Stearate, Isopropyl Palmitate, Mangifera Indica (Mango) Seed Butter, Myristyl Myristate, Cetearyl Alcohol, Argania Spinosa (Argan) Kernel Oil, Persea Gratissima (Avocado) Oil, Butyrospermum Parkii (Shea) Butter, Olea Europaea (Olive) Fruit Oil, Theobroma Cacao (Cocoa) Seed Butter, Caryocar Brasiliense Fruit Oil, Glycine Soja (Soybean) Oil, Squalane, Allantoin, Sodium Hyaluronate, Zea Mays (Corn) Starch, Hydroxypropyl Starch Phosphate, Xanthan Gum, Biosaccharide Gum-1, Xylitylglucoside, Anhydroxylitol, Ascorbyl Palmitate, Tocopheryl Acetate, Xylitol, Panthenol, Tocopherol, Myristic Acid, Arachidic Acid, Lauric Acid, Palmitic Acid, Stearic Acid, Benzoic Acid, Sodium Polyacrylate, PEG-40 Stearate, Sorbitan Tristearate, Glucose, Cetearyl Glucoside, Propylene Glycol, Ethylhexylglycerin, Didecyldimonium Chloride, Disodium EDTA, Fragrance, Phenoxyethanol, Alpha-Isomethyl Ionone, Linalool.",
        "n_loves": "12.2K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/intense-hydrating-mask-P412097",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:02:16",
        "product_name": "Intense Hydrating Mask",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.5 oz / 75 mL"
                ],
                "price": [
                    "$21.00"
                ],
                "sku": "Item 1873124"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$8.50"
                ],
                "sku": "Item 1958610"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$48.00"
                ],
                "sku": "Item 1999622"
            }
        ],
        "rating": "width:92.038%",
        "product_reviews": "2K",
        "ingredients": "  -Argan Oil: Restores elasticity, smoothness, and manageability to hair.\n-Behentrimonium Chloride: An anti-static and conditioning agent.\n-Glycerin: Natural humectant; provides hair moisturizing benefits.\n-Linseed Extract: Derived from flaxseed, a good source of alpha linolenic acid; an essential fatty acid that helps improve the health of hair.\n\n AQUA/WATER/EAU, STEARYL ALCOHOL, GLYCERIN, DIMETHICONE, CETYL ALCOHOL, ARGANIA SPINOSA (ARGAN) KERNEL OIL, PARFUM/FRAGRANCE, GUAR HYDROXYPROPYLTRIMONIUM CHLORIDE, HYDROXYPROPYL GUAR HYDROXYPROPYLTRIMONIUM CHLORIDE, PANTHENOL, GLUCOSE, GLYCERYL STEARATE, ACRYLATES COPOLYMER, CETEARYL ALCOHOL, CETEARYL GLUCOSIDE, PEG-100 STEARATE, POLYQUATERNIUM-37, PPG-1 TRIDECETH-6, STEARETH-2, CAPRYLYL GLYCOL, PROPYLENE GLYCOL, PROPYLENE GLYCOL DICAPRYLATE/DICAPRATE, CITRIC ACID, DISODIUM EDTA, ISOPROPYL ALCOHOL, SORBITAN OLEATE, STEARAMIDOPROPYL DIMETHYLAMINE, CHLORPHENESIN, BEHENTRIMONIUM CHLORIDE, CETRIMONIUM CHLORIDE, PHENOXYETHANOL, CI 15985 (YELLOW 6), CI 19140 (YELLOW 5), ALPHA-ISOMETHYL IONONE, LINALOOL, HYDROXYCITRONELLAL. MOIHM03",
        "n_loves": "78K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/texture-clay-P427322",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:02:30",
        "product_name": "Texture Clay",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.6 oz/ 75 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2030583"
            }
        ],
        "rating": "width:88.00000000000001%",
        "product_reviews": "15",
        "ingredients": "-Argan Oil: Provides vitamin E, essential fatty acids, and antioxidants.-Bentonite Clay: Provides a silky, tack-free feel with a matte finish.-Shea Butter: Soothing and moisturizing, provides nourishing benefits to hair and scalp. Water, VP/VA Copolymer, Bentonite, Hydrogenated Vegetable Oil, Lanolin Alcohol, Caprylic/Capric Triglyceride, Lanolin Cera, Propylene Glycol, Glycerin, Cera Alba/Beeswax/Cire D’abeille, C18-36 Acid Triglyceride, Tribehenin, Peg-40 Castor Oil, Fragrance, Glyceryl Stearate Se, Potassium Stearate, Cetearyl Alcohol, Titanium Dioxide (Ci 77891), Argania Spinosa (Argan) Kernel Oil, Butyrospermum Parkii (Shea) Butter, Aloe Barbadensis Leaf Juice, Hydrolyzed Soy Protein, Chamomilla Recutita (Matricaria) Flower Extract, Echinacea Purpurea Extract, Geranium Maculatum Extract, Tocopheryl Acetate, Hydrated Silica, PVP, Diheptyl Succinate, Benzophenone-4, Isopropyl Alcohol, Capryloyl Glycerin/Sebacic Acid Copolymer, Benzyl Alcohol, Behentrimonium Methosulfate, Nylon-10/10, Laurtrimonium Chloride, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol, Iron Oxides (Ci 77492, Ci 77499, Ci 77491).",
        "n_loves": "3.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-ceramic-brush-P473827",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:02:42",
        "product_name": "Ceramic Brush 35 mm",
        "brand_name": "Moroccanoil",
        "options": [],
        "rating": "",
        "product_reviews": "",
        "ingredients": "Unknown Ingredients",
        "n_loves": "1.7K",
        "categories": [
            "Hair",
            "Tools",
            "Brushes & Combs"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-body-souffle-P477718",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:02:52",
        "product_name": "Body Souffle Moisturizer",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 250 mL"
                ],
                "price": [
                    "$42.00"
                ],
                "sku": "Item 2523991"
            }
        ],
        "rating": "width:87.7%",
        "product_reviews": "722",
        "ingredients": "-Argan Oil: Helps hydrate and nourish skin.-Avocado Oil and Macadamia Seed Oil: Help build skin's natural defense and moisture repair.-Squalane: Absorbs quickly; hydrates and smooths skin.Aqua/Water/Eau, C12-15 Alkyl Benzoate, Glycerin, Octyldodecanol, Caprylic/Capric Triglyceride, Glyceryl Stearate, Isocetyl Stearate, Mangifera Indica (Mango) Seed Butter, Cetyl Alcohol, Myristyl Myristate, Argania Spinosa (Argan) Kernel Oil, Zea Mays (Corn) Starch, Persea Gratissima (Avocado) Oil, Butyrospermum Parkii (Shea) Butter, Macadamia Ternifolia (Macadamia) Seed Oil, Olea Europaea (Olive) Fruit Oil, Theobroma Cacao (Cocoa) Seed Butter, Glycine Soja (Soybean) Oil, Squalane, Citric Acid, Parfum/Fragrance, Isopropyl Palmitate, Cetearyl Alcohol, PEG-100 Stearate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sodium Polyacrylate, Hydroxypropyl Starch Phosphate, Sodium Stearoyl Glutamate, Cetearyl Glucoside, Allantoin, Ethylhexylglycerin, Panthenol, Disodium EDTA, Tocopheryl Acetate, Polysorbate 60, Didecyldimonium Chloride, Sodium PCA, Sorbitan Isostearate, Glucose, Myristyl Alcohol, Stearyl Alcohol, Palmitic Acid, Biosaccharide Gum-1, Sodium Hyaluronate, Phenoxyethanol, Benzoic Acid, Linalool, Alpha-Isomethyl Ionone.",
        "n_loves": "8.2K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hydrating-shampoo-P412087",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:03:03",
        "product_name": "Hydrating Shampoo",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030336"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.4 oz/ 70 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1873082"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 16.9 oz/ 500 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2449577"
            }
        ],
        "rating": "width:85.336%",
        "product_reviews": "1.8K",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.  -Algae: Protects cuticles against dryness.  -Vitamin A: Combats against free radicals to retain moisture and fight the effects of hair aging.AQUA/WATER/EAU, SODIUM LAUROYL SARCOSINATE, COCAMIDOPROPYL HYDROXYSULTAINE, COCAMIDOPROPYL BETAINE, PARFUM/FRAGRANCE, LACTAMIDE MEA, ACRYLATES/PALMETH-25 ACRYLATE COPOLYMER, GLYCERIN, ARGANIA SPINOSA (ARGAN) KERNEL OIL, RETINYL PALMITATE, TOCOPHEROL, CHONDRUS CRISPUS EXTRACT, ASCOPHYLLUM NODOSUM EXTRACT, PALMARIA PALMATA EXTRACT, LAMINARIA SACCHARINA EXTRACT, UNDARIA PINNATIFIDA EXTRACT, SODIUM SARCOSINATE, DIETHYLHEXYL SYRINGYLIDENEMALONATE, CAPRYLIC/CAPRIC TRIGLYCERIDE, XYLITOL, POLYQUATERNIUM-7, GLUCOSE, PROPYLENE GLYCOL, CAPRYLYL GLYCOL, STYRENE/ACRYLATES COPOLYMER, ANHYDROXYLITOL, PEG-150 PENTAERYTHRITYL TETRASTEARATE, XYLITYLGLUCOSIDE, PEG-6 CAPRYLIC/CAPRIC GLYCERIDES, SODIUM PCA, PEG-20 GLYCERYL LAURATE, LAURIC ACID, ETHANOLAMINE, POLYSORBATE 20, LINOLEIC ACID, LACTIC ACID, SODIUM BENZOATE, CHLORPHENESIN, PHENOXYETHANOL, ALPHA-ISOMETHYL IONONE, LINALOOL. MOHS02A",
        "n_loves": "53.6K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/weightless-hydrating-mask-P427313",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:03:16",
        "product_name": "Weightless Hydrating Mask",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$48.00"
                ],
                "sku": "Item 2030419"
            }
        ],
        "rating": "width:93.048%",
        "product_reviews": "1.4K",
        "ingredients": "-Argan Oil: Provides vitamin E, essential fatty acids, and antioxidants.-Behentrimonium Chloride: An anti-static and conditioning agent.-Shea Butter: Soothing and moisturizing, provides nourishing benefits to hair and scalp.-Hydrolyzed Vegetable Protein: Supports hair elasticity and strength. AQUA/WATER/EAU, DIMETHICONE, STEARYL ALCOHOL, CETYL ALCOHOL, CANOLA OIL, PARFUM/FRAGRANCE, BEHENTRIMONIUM CHLORIDE, ARGANIA SPINOSA (ARGAN) KERNEL OIL, BUTYROSPERMUM PARKII (SHEA) BUTTER, HYDROLYZED VEGETABLE PROTEIN PG-PROPYL SILANETRIOL, PEG-60 ALMOND GLYCERIDES, CETEARYL GLUCOSIDE, GLYCERYL STEARATE, PEG-100 STEARATE, STEARETH-2, POLYQUATERNIUM-37, PPG-1 TRIDECETH-6, GLUCOSE, SORBITAN OLEATE, CITRIC ACID, ACRYLATES COPOLYMER, PROPYLENE GLYCOL DICAPRYLATE/DICAPRATE, CAPRYLYL GLYCOL, CETEARYL ALCOHOL, ISOPROPYL ALCOHOL, STEARAMIDOPROPYL DIMETHYLAMINE, POLYACRYLAMIDOPROPYLTRIMONIUM CHLORIDE, DISODIUM EDTA, ACETAMIDE MEA, CHLORPHENESIN, POTASSIUM SORBATE, PHENOXYETHANOL, ALPHA-ISOMETHYL IONONE, LINALOOL, HYDROXYCITRONELLAL. MOWHM04",
        "n_loves": "17.2K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/clarifying-shampoo-P427307",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:03:28",
        "product_name": "Clarifying Shampoo",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030260"
            }
        ],
        "rating": "width:81.28999999999999%",
        "product_reviews": "62",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.-Lavender, Rosemary, Chamomile and Jojoba Extracts: Natural plant extracts that provide nourishment to hair.-Keratin: A structural protein that rebuilds and strengthens damaged or porous hair.   Aqua/Water/Eau, Cocamidopropyl Hydroxysultaine, Disodium Laureth Sulfosuccinate, Sodium Lauryl Sulfoacetate, Sodium Lauroyl Sarcosinate, Sodium Polystyrene Sulfonate, Sodium Chloride, Cocamidopropylamine Oxide, Argania Spinosa (Argan) Kernel Oil,  Persea Gratissima (Avocado) Oil, Rosmarinus Officinalis (Rosemary) Leaf Extract, Chamomilla Recutita (Matricaria) Flower Extract, Lavandula Angustifolia (Lavender) Flower Extract, Simmondsia Chinensis (Jojoba) Seed Extract, Keratin Amino Acids, Hydrolyzed Keratin, Silk Amino Acids, Panthenol, Sodium PCA, Cinnamidopropyltrimonium Chloride, Butylene Glycol, PEG-40 Hydrogenated Castor Oil, PEG-150 Pentaerythrityl Tetrastearate, PEG-6 Caprylic/Capric Glycerides, Caprylyl Glycol, Tetrasodium EDTA, Disodium EDTA, Chlorphenesin, Phenoxyethanol, Parfum/Fragrance, CI 17200 (Red 33), CI 19140 (Yellow 5), Sodium Hydroxide, Citric Acid, Alpha-Isomethyl Ionone, Butylphenyl Methylpropional, Linalool, Hydroxyisohexyl 3-Cyclohexene Carboxaldehydethylpropional.Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "15.5K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-color-care-conditioner-P504824",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:03:40",
        "product_name": "Color Care Conditioner",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz / 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2654523"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 2.4 oz / 70 mL",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 2654275"
            }
        ],
        "rating": "width:95.364%",
        "product_reviews": "302",
        "ingredients": "-ArganID™: Infuses argan oil into hair's cortex, helping to seal and repair the hair.-Sun Protection Quat: Color defense shield that helps protect hair from color loss and damage.-Pomegranate Extract: Helps to protect keratin from environmental aggressors.Aqua/Water/Eau, Cetearyl Alcohol, PEG/PPG-20/20 Phenylisopropyl Caprylyl Dimethicone, Cetyl Alcohol, Stearamidopropyl Dimethylamine, Behentrimonium Chloride, Quaternium-91, Argania Spinosa (Argan) Kernel Oil, Helianthus Annuus (Sunflower) Seed Oil, Parfum/Fragrance, Pyrus Malus (Apple) Fruit Extract, Punica Granatum (Pomegranate) Fruit Extract, Prunus Armeniaca (Apricot) Kernel Oil, Glycerin, PPG-3 Benzyl Ether Myristate, Isopropyl Alcohol, Panthenol, Quaternium-95, Caprylic/Capric Triglyceride, Hydroxyacetophenone, Caprylyl Glycol, Chitosan, Guar Hydroxypropyltrimonium Chloride, Citric Acid, EDTA, PEG-12 Allyl Ether, PEG-12 Dimethicone, Amodimethicone/Morpholinomethyl Silsesquioxane Copolymer, Trideceth-5, Silica Dimethyl Silylate, Algin, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Chlorphenesin, C12-13 Pareth-9, Propanediol, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Sorbic Acid.",
        "n_loves": "2.7K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/extra-volume-conditioner-P412088",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:03:54",
        "product_name": "Extra Volume Conditioner",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030328"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16.9 oz / 500 mL"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2539682"
            }
        ],
        "rating": "width:79.608%",
        "product_reviews": "51",
        "ingredients": " -Argan Oil: Restores elasticity, smoothness, and manageability to hair.\n-Glycerin: Natural humectant; provides hair moisturizing benefits.\n-Cocamide Mea: Made from fatty acids derived from coconut oil.\n-Tilia Tomentosa Bud Extract (Linden Bud Extract): Naturally plumps up the hair as it conditions.\n\n AQUA/WATER/EAU, DIMETHICONE, CETEARYL ALCOHOL, PARFUM/FRAGRANCE, BEHENTRIMONIUM CHLORIDE, CANOLA OIL, ARGANIA SPINOSA (ARGAN) KERNEL OIL, ALLIUM SATIVUM BULB EXTRACT, ANTHEMIS NOBILIS FLOWER EXTRACT, ARCTIUM LAPPA ROOT EXTRACT, ARNICA MONTANA FLOWER EXTRACT, HEDERA HELIX (IVY) EXTRACT, LAMIUM ALBUM FLOWER EXTRACT, NASTURTIUM OFFICINALE LEAF EXTRACT, PINUS SYLVESTRIS BUD EXTRACT, ROSMARINUS OFFICINALIS (ROSEMARY) LEAF EXTRACT, TILIA TOMENTOSA BUD EXTRACT, HYDROLYZED VEGETABLE PROTEIN PG-PROPYL SILANETRIOL, CITRIC ACID, GLYCERIN, ACRYLATES COPOLYMER, POLYQUATERNIUM-37, PPG-1 TRIDECETH-6, CAPRYLYL GLYCOL, PROPYLENE GLYCOL, SORBITAN OLEATE, PROPYLENE GLYCOL DICAPRYLATE/DICAPRATE, ISOPROPYL ALCOHOL, DISODIUM EDTA, CHLORPHENESIN, PHENOXYETHANOL, POTASSIUM SORBATE, SODIUM BENZOATE, ALPHA-ISOMETHYL IONONE, LINALOOL, HYDROXYCITRONELLAL. MOEVC03",
        "n_loves": "10.8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dry-scalp-treatment-P427317",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:04:07",
        "product_name": "Dry Scalp Treatment",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.5 oz/ 45 mL"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2030443"
            }
        ],
        "rating": "width:89.056%",
        "product_reviews": "254",
        "ingredients": "-Argan Oil: An antioxidant-rich natural oil that nourishes the hair and scalp.-Salicylic Acid: Gently exfoliates, prevents buildup, and fights flakes.-Geranium Oil: Soothes the scalp and addresses dryness.Caprylic/Capric Triglyceride, Argania Spinosa (Argan) Kernel Oil, Triethylhexanoin, Dicaprylyl Carbonate, Brassica Campestris Sterols, Cetearyl Alcohol, Lavandula Hybrida Oil, Pelargonium Graveolens Oil, Tocopheryl Acetate, Tocopherol, Salicylic Acid, Citral, Citronellol, Linalool, Geraniol, Limonene.",
        "n_loves": "27.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-shower-gel-P477823",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:04:19",
        "product_name": "Shower Gel Cleanser",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 8.4 oz/ 250 mL",
                "name": [
                    "Scent: Ambiance de Plage"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539880"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 8.4 oz/ 250 mL",
                "name": [
                    "Scent: Ambre Noir"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539781"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": "Size 8.4 oz/ 250 mL",
                "name": [
                    "Scent: Bergamote Fraiche",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539732"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 8.4 oz/ 250 mL",
                "name": [
                    "Scent: Oud Mineral"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539831"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 8.4 oz/ 250 mL",
                "name": [
                    "Scent: Spa du Maroc"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2539930"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": "Size 8.4 oz/ 250 mL",
                "name": [
                    "Scent: Fragrance Originale"
                ],
                "price": [
                    "$23.00"
                ],
                "sku": "Item 2524023"
            }
        ],
        "rating": "width:88.958%",
        "product_reviews": "317",
        "ingredients": "-Argan Oil: Contains rich antioxidants and helps hydrate and nourish skin.Aqua/Water/Eau, Sodium C14-16 Olefin Sulfonate, Disodium Lauroamphodiacetate, Cocamidopropyl Betaine, Parfum/Fragrance, Glycerin, Argania Spinosa (Argan) Kernel Oil, Tocopherol, Peg-7 Glyceryl Cocoate, Peg-40 Hydrogenated Castor Oil, Peg-120 Methyl Glucose Dioleate, Peg-120 Methyl Glucose Trioleate, Polyquaternium-10, Citric Acid, Caprylyl Glycol, Propanediol, Isopropyl Alcohol, Sodium Glycolate, Sodium Chloride, Sodium Acetate, Tetrasodium Edta, Chlorphenesin, Phenoxyethanol, Caramel.",
        "n_loves": "19.6K",
        "categories": [
            "Bath & Body",
            "Bath & Shower",
            "Body Wash & Shower Gel"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/shimmering-body-oil-P412108",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:04:35",
        "product_name": "Shimmering Body Oil",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 1872860"
            }
        ],
        "rating": "width:75.484%",
        "product_reviews": "31",
        "ingredients": "-Argan Oil: Helps to hydrate and nurture the skin to help improve its texture and tone.-Sesame Oil: Helps build skin’s natural defenses and restore moisture. Caprylic/ Capric Triglyceride, Sesamum Indicum (Sesame) Seed Oil, Argania Spinosa (Argan) Kernel Oil, Parfum/Fragrance, Trihydroxystearin, Mica, CI 77491 (Iron Oxides), Alpha-Isomethyl Ionone, Butylphenyl Methylpropional, Linalool, Eugenol, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde.Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date ingredient information and any warnings or instructions.",
        "n_loves": "14K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-ceramic-paddle-brush-P463075",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:04:46",
        "product_name": "Ceramic Paddle Brush",
        "brand_name": "Moroccanoil",
        "options": [],
        "rating": "width:85.91%",
        "product_reviews": "44",
        "ingredients": "Unknown Ingredients",
        "n_loves": "9.5K",
        "categories": [
            "Hair",
            "Tools",
            "Brushes & Combs"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-high-gloss-shine-color-depositing-mask-in-clear-P507371",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:04:57",
        "product_name": "High Gloss Shine Color Depositing Mask in Clear",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": "Size 6.7 oz / 200 ml",
                "name": [
                    "Color: Clear",
                    "NEW"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2668333"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": "NEW",
                "size": "Size 1 oz / 30 ml",
                "name": [
                    "Color: Clear",
                    "NEW"
                ],
                "price": [
                    "$8.50"
                ],
                "sku": "Item 2668325"
            }
        ],
        "rating": "width:93.656%",
        "product_reviews": "290",
        "ingredients": "-ArganID™: Infuses argan oil into hair's cortex to seal and repair the hair.-Crambe Abyssinica Seed Oil: Imparts a highly reflective veil that conditions and enhances vibrancy.-Amino Acid Blend: Offers color protection and strengthens the hair.Aqua/Water/Eau, Cetearyl Alcohol, Cetyl Alcohol, Behentrimonium Chloride, Glycerin, Crambe Abyssinica Seed Oil Phytosterol Esters, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Hydrolyzed Quinoa, Algin, Arginine, Aspartic Acid, Glycine, Alanine, Serine, Valine, Isoleucine, Proline, Threonine, Histidine, Phenylalanine, Chitosan, Citric Acid, Dehydroacetic Acid, Cetrimonium Chloride, Linoleamidopropyl PG-Dimonium Chloride Phosphate Dimethicone, Amodimethicone/Morpholinomethyl Silsesquioxane Copolymer, Hydroxypropylgluconamide, Hydroxypropylammonium Gluconate, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Dimethiconol Panthenol, Caprylic/Capric Triglyceride, C12-13 Pareth-9, Caprlyly Glycol, Isopropyl Alcohol, EDTA, PCA, Sodium PCA, Trideceth-5, Hexylene Glycol, Benzyl Alcohol, Tartaric Acid, Ethylhexylglycerin, Sodium Benzoate, Sodium Lactate, Phenoxyethanol, Clear Potassium Sorbate, Alpha-Isomethyl Ionone, Linalool.",
        "n_loves": "1.3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/smoothing-conditioner-P425011",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:05:10",
        "product_name": "Smoothing Conditioner",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030385"
            }
        ],
        "rating": "width:81.42799999999998%",
        "product_reviews": "14",
        "ingredients": " -AminoRenew™: An amino acid delivery system that bridges keratin disulfide bonds, repairing and restoring lost structure to hair.-Argan Oil: Nourishes with tocopherols (vitamin E), essential fatty acids, and antioxidants.-Argan Butter: A natural emollient and conditioning agent blended from argan oil; leaves hair soft, nourished, and shiny with its high content in natural tocopherols (vitamin E), phenols, carotenes, and essential fatty acids.-Glycerin: Natural humectant; provides hair moisturizing benefits.Water, Cetyl Alcohol, Lysine Carboxymethyl Cysteinate, Dimethicone, Fragrance, Behentrimonium Chloride, Glycerin, Argania Spinosa (Argan) Kernel Oil, Hydrogenated Vegetable Oil, Caprylyl Glycol, Propylene Glycol, Glyceryl Stearate, C12-15 Pareth-3, Isopropyl Alcohol, Aminoethylaminopropyl Dimethicone, Stearyl Alcohol, Polyquaternium-7, Phenoxyethanol, Sodium Benzoate, Sorbic Acid, Alpha-Isomethyl Ionone, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Linalool, Butylphenyl Methypropional. ",
        "n_loves": "2.9K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dry-texture-spray-P412093",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:05:22",
        "product_name": "Dry Texture Spray",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.6 oz/ 60 mL"
                ],
                "price": [
                    "$16.00"
                ],
                "sku": "Item 1873165"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.4 oz/ 205 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 1999614"
            }
        ],
        "rating": "width:85.258%",
        "product_reviews": "194",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.-Zeolite: Provides grit, texture, and odor absorption. -Hydrolyzed Wheat Protein: Conditions and moisturizes the hair.Hydrofluorocarbon 152A, Butane, SD Alcohol 40B (Alcohol Denat.), VP/VA Copolymer, Zeolite, Argania Spinosa (Argan) Kernel Oil, Water, Amp-Isostearoyl Hydrolyzed Wheat Protein, Fragrance, Glycerin, Peg/Ppg-15/15 Allyl Ether Acetate, Methoxycinnamidopropyl Hydroxysultaine, Peg/Ppg-17/18 Dimethicone, Acetyl Triethyl Citrate, Octadecyl Di-T-Butyl-4-Hydroxyhydrocinnamate.",
        "n_loves": "30.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/luminous-hairspray-medium-hold-P427320",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:05:35",
        "product_name": "Luminous Hairspray Medium Hold",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10 oz/ 330 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030534"
            }
        ],
        "rating": "width:87.20000000000002%",
        "product_reviews": "50",
        "ingredients": " -Argan Oil: Rich in tocopherols (vitamin E), essential fatty acids, and antioxidants to nourish hair.SD Alcohol 40-B (Alcohol Denat.), Hydrofluorocarbon 152a, Water, Octylacrylamide/Acrylates/Butylaminoethyl Methacrylate Copolymer, Polyurethane 14, Amp-Acrylates Copolymer, Aminomethyl Propanol, Parfum/Fragrance, Triethyl Citrate, Phenyl Trimethicone, Glycerin, C12-15 Alkyl Benzoate, Peg-75 Lanolin, Panthenol, Argania Spinosa (Argan) Kernel Oil. ",
        "n_loves": "20.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Spray"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/res-torative-hair-mask-P427311",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:05:47",
        "product_name": "Restorative Hair Mask",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$48.00"
                ],
                "sku": "Item 2030393"
            }
        ],
        "rating": "width:86.46800000000002%",
        "product_reviews": "201",
        "ingredients": "-Argan Oil: Helps to nurture hair.-Shea Butter: Provides nourishing benefits to hair and scalp.  -Caryocar Brasiliense Fruit Oil: Nurtures hair with vitamins and essential fatty acids.  AQUA/WATER/EAU, CETEARYL ALCOHOL, BEHENTRIMONIUM CHLORIDE, CANOLA OIL, BUTYROSPERMUM PARKII (SHEA) BUTTER, PARFUM/FRAGRANCE, DIMETHICONE, ARGANIA SPINOSA (ARGAN) KERNEL OIL, CARYOCAR BRASILIENSE FRUIT OIL, HYDROLYZED VEGETABLE PROTEIN PG-PROPYL SILANETRIOL, GUAR HYDROXYPROPYLTRIMONIUM CHLORIDE, TOCOPHEROL, SORBITAN OLEATE, PEG-60 ALMOND GLYCERIDES, CETEARETH-20, POLYQUATERNIUM-37, PPG-1 TRIDECETH-6, QUATERNIUM-98, STEARETH-2, CITRIC ACID, DIMETHICONOL, ACRYLATES COPOLYMER, CAPRYLYL GLYCOL, ISOPROPYL ALCOHOL, ACETAMIDE MEA, DISODIUM EDTA, CHLORPHENESIN, PROPYLENE GLYCOL DICAPRYLATE/DICAPRATE, STEARAMIDOPROPYL DIMETHYLAMINE, POLYACRYLAMIDOPROPYLTRIMONIUM CHLORIDE, DIHYDROGENATED TALLOW HYDROXYETHYLMONIUM METHOSULFATE, POTASSIUM SORBATE, BHT, PHENOXYETHANOL, ALPHA-ISOMETHYL IONONE, LINALOOL, HYDROXYCITRONELLAL. MORHM03",
        "n_loves": "40.3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/mending-infusion-P425008",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:05:59",
        "product_name": "Mending Infusion Styling Hair Serum",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.5 oz/ 75 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 1999655"
            }
        ],
        "rating": "width:94.804%",
        "product_reviews": "1.1K",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness and manageability to hair.  -Boabab Extract: Increases hair elasticity and strength; helps provide damage recovery to leave hair looking and feeling softer and smoother.  -Hydrolyzed Quinoa: Rich in amino acids for hair nourishment and conditioning.  Water, Dimethicone, Glycerin, Cyclohexasiloxane, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Squalane, Argania Spinosa (Argan) Kernel Oil, Hydrolyzed Quinoa, Hydrolyzed Adansonia Digitata Seed Extract, Camellia Sinensis (Green Tea) Leaf Extract, Chamomilla Recutita (Matricaria) Flower Extract, Lavandula Angustifolia (Lavender) Flower Extract, Parfum/Fragrance, Coconut Alkanes, Peg-40 Castor Oil, Galactoarabinan, Polysorbate 60, Dilinoleic Acid/Propanediol Copolymer, Sorbitan Isostearate, Benzophenone-4, Panthenol, Coco-Caprylate/Caprate, Xylitol, Ethyl Macadamiate, Citric Acid, Benzophenone-3, Tocopherol, Malic Acid, Sulfuric Acid, Potassium Sorbate, Sodium Benzoate, Benzyl Alcohol, Phenoxyethanol.Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "39.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moisture-repair-shampoo-P412085",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:06:12",
        "product_name": "Moisture Repair Shampoo",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030351"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.4 oz/ 70 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1869692"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "LIMITED EDITION",
                "size": null,
                "name": [
                    "Size: 16.9 oz / 500 mL",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2433712"
            }
        ],
        "rating": "width:85.374%",
        "product_reviews": "1.1K",
        "ingredients": "-Argan Oil: Helps to nurture hair. -Lavender, Rosemary, Chamomile, and Jojoba Extracts: Provide nourishment to dry hair.-Keratin: Rebuilds and strengthens damaged or porous hair.AQUA/WATER/EAU, SODIUM LAUROYL SARCOSINATE, DISODIUM LAURETH SULFOSUCCINATE, COCAMIDOPROPYL HYDROXYSULTAINE, COCAMIDE MEA, SODIUM LAURYL SULFOACETATE, GLYCOL DISTEARATE, DIMETHICONE, ARGANIA SPINOSA (ARGAN) KERNEL OIL, PERSEA GRATISSIMA (AVOCADO) OIL, CHAMOMILLA RECUTITA (MATRICARIA) FLOWER EXTRACT, LAVANDULA ANGUSTIFOLIA (LAVENDER) FLOWER EXTRACT, ROSMARINUS OFFICINALIS (ROSEMARY) LEAF EXTRACT, SIMMONDSIA CHINENSIS (JOJOBA) SEED EXTRACT, HYDROLYZED VEGETABLE PROTEIN PG-PROPYL SILANETRIOL, PARFUM/FRAGRANCE, SILK AMINO ACIDS, HYDROLYZED KERATIN, KERATIN AMINO ACIDS, CITRIC ACID, C12-13 PARETH-23, C12-13 PARETH-3, TRIDECETH-12, DIVINYLDIMETHICONE/DIMETHICONE COPOLYMER, POLYQUATERNIUM-7, POLYQUATERNIUM-10, QUATERNIUM-80, PEG-150 PENTAERYTHRITYL TETRASTEARATE, AMODIMETHICONE, DIMETHICONOL, PEG-6 CAPRYLIC/CAPRIC GLYCERIDES, PANTHENOL, CYCLOPENTASILOXANE, SODIUM LAUROYL LACTYLATE, SODIUM PCA, SODIUM ACETATE, PROPYLENE GLYCOL, CAPRYLYL GLYCOL, CINNAMIDOPROPYLTRIMONIUM CHLORIDE, ISOPROPYL ALCOHOL, TETRASODIUM EDTA, DISODIUM EDTA, CETRIMONIUM CHLORIDE, CHLORPHENESIN, PHENOXYETHANOL, SODIUM BENZOATE, POTASSIUM SORBATE, CI 19140 (YELLOW 5), CI 17200 (RED 33), ALPHA-ISOMETHYL IONONE, LINALOOL. MOMRS02A",
        "n_loves": "40.7K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-volumizing-mist-P463073",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:06:25",
        "product_name": "Volumizing Mist",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.4 oz/ 160 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2395085"
            }
        ],
        "rating": "width:70.39999999999999%",
        "product_reviews": "25",
        "ingredients": "-Argan Oil: Extremely rich in tocopherols (vitamin E), essential fatty acids, and antioxidants, this natural oil nourishes hair. -Dead Sea Salt: Sourced from the Dead Sea, this uniquely gentle salt provides enhanced texture and volume and contains a variety of restorative minerals such as calcium, magnesium, and potassium.-Rice Amino Acids: Helps to fortify the hair and improve volume and manageability. SD Alcohol 40-B (Alcohol Denat.), Aqua/Water/Eau, VP/VA Copolymer, Isopropyl Alcohol, Polysorbate 20, Argania Spinosa (Argan) Kernel Oil, Lavandula Angustifolia (Lavender) Flower Extract, Camellia Sinensis (Green Tea) Leaf Extract, Acacia Senegal Gum, Hydrolyzed Quinoa, Rice Amino Acids, Wheat Amino Acids, Soy Amino Acids, Arginine HCL, Serine, Threonine, Algin, Chitosan, Pullulan, Trehalose, Xylitylglucoside, Anhydroxylitol, Xylitol, Sorbitol, Glucose, Sea Salt/Maris Sal, Galactoarabinan, Glycerin, Panthenol, Polyquaternium-11, Polyquaternium-16, C12-13 Pareth-9, Citric Acid, Caprylic/Capric Triglyceride, Propanediol, Parfum/Fragrance, Cinnamidopropyltrimonium Chloride, Cetrimonium Chloride, Sodium Benzoate, Potassium Sorbate, Benzyl Alcohol, Phenoxyethanol.",
        "n_loves": "5.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-treatment-mini-P426011",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:06:38",
        "product_name": "Mini Moroccanoil Treatment",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.85 oz/ 25 mL"
                ],
                "price": [
                    "$20.00"
                ],
                "sku": "Item 1869494"
            }
        ],
        "rating": "width:92.38%",
        "product_reviews": "2K",
        "ingredients": "  -Argan Oil: Extremely rich in tocopherols (vitamin E), essential fatty acids, and antioxidants that hydrate and nourish the hair.\n-Linseed Extract: derived from flaxseed, a good source of alpha linolenic acid; an essential fatty acid that helps improve the health of hair.\n\nCyclomethicone, Dimethicone, Argania Spinosa (Argan) Kernel Oil, Fragrance, Linum Usitatissimum (Linseed) Seed Extract, CI 26100 (Red 17), CI 47000 (Yellow 11).",
        "n_loves": "100.9K",
        "categories": [
            "Mini Size",
            "Hair"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hydration-travel-hair-set-P504827",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:06:51",
        "product_name": "Hydration Travel Hair Set",
        "brand_name": "Moroccanoil",
        "options": [],
        "rating": "width:50%",
        "product_reviews": "2",
        "ingredients": "-Argan Oil: Hydrates and nurtures with a rich supply of fatty acids and antioxidants.Moroccanoil Treatment:Cyclomethicone, Dimethicone, Argania Spinosa (Argan) Kernel Oil, Fragrance, Linum Usitatissimum (Linseed) Seed Extract, CI 26100 (Red 17), CI 47000 (Yellow 11).Hydrating Shampoo:Aqua/Water/Eau, Sodium Lauroyl Sarcosinate, Cocamidopropyl Hydroxysultaine, Cocamidopropyl Betaine, Parfum/Fragrance, Lactamide Mea, Sodium Chloride, Acrylates/Palmeth-25 Acrylate Copolymer, Glycerin, Argania Spinosa (Argan) Kernel Oil, Ascophyllum Nodosum Extract, Chondrus Crispus Extract, Laminaria Saccharina Extract, Palmaria Palmata Extract, Undaria Pinnatifida Extract, Xylitol, Xylitylglucoside, Anhydroxylitol, Tocopherol, Retinyl Palmitate, Glucose, Lactic Acid, Lauric Acid, Linoleic Acid, Peg-6 Caprylic/Capric Glycerides, Polyquaternium-7, Polysorbate 20, Peg-20 Glyceryl Laurate, Peg-150 Pentaerythrityl Tetrastearate, Sodium Pca, Sodium Sarcosinate, Ethylhexylglycerin, Caprylic/Capric Triglyceride, Caprylyl Glycol, Didecyldimonium Chloride, Diethylhexyl Syringlyidenemalonate, Ethanolamine, Styrene/Acrylates Copolymer, Tetrasodium Edta, Propylene Glycol, Chlorphenesin, Phenoxyethanol, Sodium Benzoate, Alpha-Isomethyl Ionone, Linalool, Hydroxycitronellal.Hydrating Conditioner:Aqua/Water/Eau, Dimethicone, Cetearyl Alcohol, Parfum/Fragrance, Behentrimonium Chloride, Acetamide Mea, Canola Oil, Argania Spinosa (Argan) Kernel Oil, Allium Sativum Bulb Extract, Anthemis Nobilis Flower Extract, Arctium Lappa Root Extract, Arnica Montana Flower Extract, Hedera Helix (Ivy) Extract, Lamium Album Flower Extract, Nasturtium Officinale Leaf Extract, Pinus Sylvestris Bud Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Citric Acid, Acrylates Copolymer, Polyquaternium-37, Ppg-1 Trideceth-6, Caprylyl Glycol, Propylene Glycol, Sorbitan Oleate, Propylene Glycol Dicaprylate/Dicaprate, Isopropyl Alcohol, Disodium Edta, Chlorphenesin, Phenoxyethanol, Potassium Sorbate, Alpha-Isomethyl Ionone, Linalool, Hydroxycitronellal. Hand Cream Fragrance Originale:Aqua/Water/Eau, Ethylhexyl Palmitate, Cetyl Alcohol, Glycerin, Ceteareth-20, Hydroxypropyl Starch Phosphate, Glyceryl Stearate, Propanediol, Cetearyl Alcohol, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Butyrospermum Parkii (Shea) Butter, Macadamia Ternifolia (Macadamia) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Hydroxyacetophenone, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Squalane, Tocopheryl Acetate, Caprylyl Glycol, Potassium Hydroxide, Disodium Edta, Polysorbate 60, Sorbitan Isostearate, Citric Acid, Sodium Hyaluronate, Ethylhexylglycerin, Chlorphenesin, Phenoxyethanol, Caramel.",
        "n_loves": "6.3K",
        "categories": [
            "Hair",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/hydrating-conditioner-P412086",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:07:01",
        "product_name": "Hydrating Conditioner",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030344"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.4 oz/ 70 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1873090"
            },
            {
                "swatch_group": "Value size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 16.9 oz/ 500 mL",
                    "OUT OF STOCK",
                    "LIMITED EDITION"
                ],
                "price": [
                    "$55.00"
                ],
                "sku": "Item 2449569"
            }
        ],
        "rating": "width:90.32199999999999%",
        "product_reviews": "1.6K",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.-Algae: Natural moisturizer that protects cuticles against dryness.-Vitamin A: A stabilizer that combats against free radicals to retain moisture and fight the effects of hair aging. AQUA/WATER/EAU, DIMETHICONE, CETEARYL ALCOHOL, PARFUM/FRAGRANCE, BEHENTRIMONIUM CHLORIDE, ACETAMIDE MEA, CANOLA OIL, ARGANIA SPINOSA (ARGAN) KERNEL OIL, ALLIUM SATIVUM BULB EXTRACT, ANTHEMIS NOBILIS FLOWER EXTRACT, ARCTIUM LAPPA ROOT EXTRACT, ARNICA MONTANA FLOWER EXTRACT, HEDERA HELIX (IVY) EXTRACT, LAMIUM ALBUM FLOWER EXTRACT, NASTURTIUM OFFICINALE LEAF EXTRACT, PINUS SYLVESTRIS BUD EXTRACT, ROSMARINUS OFFICINALIS (ROSEMARY) LEAF EXTRACT, HYDROLYZED VEGETABLE PROTEIN PG-PROPYL SILANETRIOL, CITRIC ACID, ACRYLATES COPOLYMER, POLYQUATERNIUM-37, PPG-1 TRIDECETH-6, CAPRYLYL GLYCOL, PROPYLENE GLYCOL, SORBITAN OLEATE, PROPYLENE GLYCOL DICAPRYLATE/DICAPRATE, ISOPROPYL ALCOHOL, DISODIUM EDTA, CHLORPHENESIN, PHENOXYETHANOL, POTASSIUM SORBATE, ALPHA-ISOMETHYL IONONE, LINALOOL, HYDROXYCITRONELLAL. MOHC03 Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "49.3K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/luminous-hairspray-strong-finish-P412092",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:07:14",
        "product_name": "Luminous Hairspray Strong Finish",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 10 oz/ 330 mL"
                ],
                "price": [
                    "$30.00"
                ],
                "sku": "Item 2030542"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.3 oz/ 75 mL"
                ],
                "price": [
                    "$14.00"
                ],
                "sku": "Item 1873181"
            }
        ],
        "rating": "width:78.73%",
        "product_reviews": "126",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.  SD Alcohol 40-B (Alcohol Denat.), Hydrofluorocarbon 152a, VA/Crotonates/Vinyl Neodecanoate Copolymer, Octylacrylamide/Acrylates/Butylaminoethyl Methacrylate Copolymer, Aminomethylpropanol, Parfum/Fragrance, PEG-12 Dimethicone, Cyclopentasiloxane, Argania Spinosa (Argan) Kernel Oil.Disclaimer: Ingredients listed may vary slightly from products received. Before use, refer to packaging for most up-to-date in ingredient information and any warnings or instructions.",
        "n_loves": "27.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Spray"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/volumizing-mousse-P427324",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:07:28",
        "product_name": "Volumizing Mousse",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz/ 250 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2030609"
            }
        ],
        "rating": "width:79.13%",
        "product_reviews": "23",
        "ingredients": "-Argan Oil: Provides vitamin E, essential fatty acids, and antioxidants.-Polyquaternium-4: Weightless, flexible polymer that provides volume, lift, and a \"memory\" factor, for hair that holds its shape and styles that last longer.-Soytrimonium Chloride: Hair-conditioning and anti-static agent that adds slip and silkiness.Water, Isobutane, Propane, Polyquaternium-4, Polysorbate 20, Phenoxyethanol, Fragrance, Soytrimonium Chloride, Propylene Glycol, Potassium Sorbate, Argania Spinosa (Argan) Kernel Oil. ",
        "n_loves": "10.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-intense-hydrating-mask-travel-size-P452428",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:07:40",
        "product_name": "Mini Intense Hydrating Mask",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.5 oz / 75 mL"
                ],
                "price": [
                    "$21.00"
                ],
                "sku": "Item 1873124"
            }
        ],
        "rating": "width:87.20000000000002%",
        "product_reviews": "25",
        "ingredients": "-Argan Oil: Restores elasticity, smoothness, and manageability to hair.-Glycerin: Provides hair-moisturizing benefits.-Linseed Extract: Helps improve the health of hair.Water, Cetearyl Alcohol, Argania Spinosa (Argan) Kernel Oil, Glycerin, Dimethicone, Cetrimonium Chloride, Cetyl Alcohol, Behentrimonium Chloride, Isopropyl Alcohol, Fragrance, DMDM Hydantoin, Citric Acid, CI 19140 (Yellow 5), Linum Usitatissimum (Linseed) Seed Extract, CI 15985 (Yellow 6), Butylphenyl Methylpropional, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Linalool, Alpha-Isomethylionone.",
        "n_loves": "22.1K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-volume-2023-travel-hair-set-P504812",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:07:54",
        "product_name": "Volume Travel Hair Set",
        "brand_name": "Moroccanoil",
        "options": [],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "-Argan Oil: Hydrates and nurtures with a rich supply of fatty acids and antioxidants.-Linden Bud Extract: Plumps up and conditions hair.Moroccanoil Treatment Light:Cyclomethicone, Dimethicone, Argania Spinosa (Argan) Kernel Oil, Parfum/Fragrance, Linum Usitatissimum (Linseed) Seed Extract, Ci 26100 (Red 17), Ci 47000 (Yellow 11).Extra Volume Shampoo:Aqua/Water/Eau, Sodium Lauroyl Sarcosinate, Cocamidopropyl Hydroxysultaine, Cocamidopropyl Betaine, Glycerin, Cocamide Dipa, Polyquaternium-70, Peg-150 Pentaerythrityl Tetrastearate, Argania Spinosa (Argan) Kernel Oil, Tilia Tomentosa Bud Extract, Chondrus Crispus Extract, Ascophyllum Nodosum Extract, Laminaria Saccharina Extract, Palmaria Palmata Extract, Undaria Pinnatifida Extract, Citric Acid, Tocopherol, Retinyl Palmitate, Glycol Distearate, Peg-6 Caprylic/Capric Glycerides, Diethylhexyl Syringyldenemalonate, Caprylic/Capric Triglyceride, Laureth-10, Cocamide Mea, Polysorbate 20, Peg-20 Glyceryl Laurate, Acrylates/Palmeth-25 Acrylate Copolymer, Linoleic Acid, Parfum/Fragrance, Dipropylene Glycol, Butylene Glycol, Caprylyl Glycol, Tetrasodium Edta, Chlorphenesin, Phenoxyethanol, Potassium Sorbate, Sodium Benzoate. Extra Volume Conditioner:Aqua/Water/Eau, Dimethicone, Cetearyl Alcohol, Parfum/Fragrance, Behentrimonium Chloride, Canola Oil, Argania Spinosa (Argan) Kernel Oil, Allium Sativum Bulb Extract, Anthemis Nobilis Flower Extract, Arctium Lappa Root Extract, Arnica Montana Flower Extract, Hedera Helix (Ivy) Extract, Lamium Album Flower Extract, Nasturtium Officinale Leaf Extract, Pinus Sylvestris Bud Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Tilia Tomentosa Bud Extract, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Citric Acid, Glycerin, Acrylates Copolymer, Polyquaternium-37, Ppg-1 Trideceth-6, Caprylyl Glycol, Propylene Glycol, Sorbitan Oleate, Propylene Glycol Dicaprylate/Dicaprate, Isopropyl Alcohol, Disodium Edta, Chlorphenesin, Phenoxyethanol, Potassium Sorbate, Sodium Benzoate, Alpha-Isomethyl Ionone, Linalool, Hydroxycitronellal. Hand Cream Fragrance Originale:Aqua/Water/Eau, Ethylhexyl Palmitate, Cetyl Alcohol, Glycerin, Ceteareth-20, Hydroxypropyl Starch Phosphate, Glyceryl Stearate, Propanediol, Cetearyl Alcohol, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Butyrospermum Parkii (Shea) Butter, Macadamia Ternifolia (Macadamia) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Hydroxyacetophenone, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Squalane, Tocopheryl Acetate, Caprylyl Glycol, Potassium Hydroxide, Disodium Edta, Polysorbate 60, Sorbitan Isostearate, Citric Acid, Sodium Hyaluronate, Ethylhexylglycerin, Chlorphenesin, Phenoxyethanol, Caramel.",
        "n_loves": "3.2K",
        "categories": [
            "Hair",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/protect-prevent-spray-P432032",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:08:05",
        "product_name": "Protect & Prevent Spray",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.4 oz/ 160 mL"
                ],
                "price": [
                    "$34.00"
                ],
                "sku": "Item 2070258"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$16.00"
                ],
                "sku": "Item 2070241"
            }
        ],
        "rating": "width:91.74%",
        "product_reviews": "1.8K",
        "ingredients": "-ArganID™: Helps to repair and seal the hair.-Varisoft: Helps protect hair against breakage and frizz while conditioning and nurturing. -Heliogenol: Helps prevent residual oxidation of hair color and the stripping of hair color pigments from the hair fiber.Water (Aqua), Butylene Glycol, Glycerin, Argania Spinosa (Argan) Kernel Oil, Helianthus Annuus (Sunflower) Seed Extract, Carrageenan, Parfum/Fragrance, Peg-40 Hydrogenated Castor Oil, Xanthan Gum, Silicone Quaternium-22, Ppg-26-Buteth-26, Hydroxyacetophenone, Benzophenone-4, Caprylyl Glycol, Dipropylene Glycol, Polyglyceryl-3 Caprate, Citric Acid, Cocamidopropyl Betaine, Carnosine, Palmitamidopropyltrimonium Chloride, Propylene Glycol, Sd Alcohol 40-B (Alcohol Denat.), Benzophenone-3, C12-13 Pareth-9, Caprylic/Capric Triglyceride, Ergothioneine, Algin, Chitosan, Coco-Glucoside, Sorbitan Oleate, Guar Hydroxypropyltrimonium Chloride, Cetrimonium Chloride, Chlorphenesin, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Alpha-Isomethyl Ionone, Linalool.",
        "n_loves": "30.6K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Primers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/blow-dry-concentrate-P427319",
        "error": "Product not available",
        "scrape_timestamp": "08/22/2023, 04:08:17"
    },
    {
        "url": "https://www.sephora.com/ca/en/product/moroccanoil-brumes-du-maroc-hair-body-fragrance-mist-P474353",
        "error": "",
        "scrape_timestamp": "08/22/2023, 04:08:27",
        "product_name": "Hair & Body Fragrance Mist",
        "brand_name": "Moroccanoil",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$36.00"
                ],
                "sku": "Item 2483139"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$20.00"
                ],
                "sku": "Item 2483121"
            }
        ],
        "rating": "width:88.42000000000002%",
        "product_reviews": "848",
        "ingredients": " -Argan Oil: Rich in fatty acids and antioxidants that hydrate and nourish skin and hair.-Vitamin E: Supports natural moisture balance in skin and hair.-Sun-Exposure Absorber: Protects hair from UV rays. SD Alcohol 40-B (Alcohol Denat.), Aqua/Water/Eau, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Tocopheryl Acetate, Dimethicone PEG-8 Meadowfoamate, Glycerin, Isopropyl Palmitate, Ethoxydiglycol, Polyquaternium-59, Butylene Glycol, Cetrimonium Chloride, Linalool, Alpha-Isomethyl Ionone, Benzyl Benzoate, Limonene.",
        "n_loves": "28.4K",
        "categories": [
            "Fragrance",
            "Women",
            "Body Mist & Hair Mist"
        ]
    }
]