[
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-full-size-firmx-reg-face-eye-firmers-2-piece-kit-P505383",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:26:29",
        "product_name": "Full-Size FIRMx® Face & Eye Firmers 2-Piece Kit",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:65%",
        "product_reviews": "8",
        "ingredients": "Unknown Ingredients",
        "n_loves": "1.9K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-water-drench-reg-hyaluronic-cloud-rich-barrier-moisturizer-P504116",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:26:40",
        "product_name": "Water Drench® Hyaluronic Cloud Rich Barrier Moisturizer",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz / 50 mL"
                ],
                "price": [
                    "$79.00"
                ],
                "sku": "Item 2653301"
            }
        ],
        "rating": "width:93.724%",
        "product_reviews": "239",
        "ingredients": "-30% Hyaluronic Acid Complex: A potent hydrator that plumps the look of skin with moisture.-3% HydraFence™: Helps provide up to 120 hours of enhanced hydration.-Moisture Barrier Boosting Complex™: Helps increase the look of skin thickness to combat effects of dehydrators.Water/Aqua/Eau, Dimethicone, Glycerin, Dimethiconol, Dipropylene Glycol, Yeast Extract, Squalane, Sodium Hyaluronate, Vaccinium Vitis-Idaea Fruit Extract,   Gluconolactone, Calcium Gluconate, Polyglutamic Acid, Amylopectin, Lactic Acid, Lithothamnion Calcareum Extract, Hydrolyzed Silk, Tocopherol, Sodium PCA, Citric Acid, Sodium Citrate, Sodium Chloride, Propanediol, Pentylene Glycol, Sodium Benzoate, Potassium Sorbate, Xanthan Gum, Ethylhexylglycerin, Lauryl PEG-9 Polydimethylsiloxyethyl Dimethicone, Dimethicone/PEG-10/15 Crosspolymer, Disodium EDTA, Mica, Phenoxyethanol.",
        "n_loves": "1.5K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-vital-e-microbiome-age-defense-eye-cream-P455336",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:26:54",
        "product_name": "Vital-E™ Microbiome Age Defense Eye Cream",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$72.00"
                ],
                "sku": "Item 2322725"
            }
        ],
        "rating": "width:86.49%",
        "product_reviews": "601",
        "ingredients": " -Gamma E Antioxidant Technology: Uses unparalleled antioxidative power to help improve and prevent the look of dullness, elasticity, and fine lines and wrinkles from environmental damage.-3% Butterfly Ginger Root Extract: Helps detoxify the look of skin exposed to blue light from tech devices.-Pre/Pro-Biodefense Complex: A blend of prebiotic and probiotic ingredients that helps balance, defend, and enhance the look of microbiome health. Water/Aqua/Eau, Glycerin, Dimethicone, Methyl Trimethicone, Butylene Glycol, Caprylyl Methicone, Ceresin, Dimethicone/Peg-10/15 Crosspolymer, Lauryl Peg-9 Polydimethylsiloxyethyl Dimethicone, Astrocaryum Tucuma Seed Butter, Microcrystalline Wax, Caffeine, Dimethylmethoxy Chromanol, Tocopherol, Bacillus, Yeast Beta-Glucan, Palmitoyl Tripeptide-5, Silybum Marianum Seed Extract, Acetyl Heptapeptide-4, Ceramide NP, Sodium Hyaluronate, Hedychium Coronarium Root Extract, Sodium PCA, Eclipta Prostrata Extract, Dunaliella Salina Extract, Panthenol, Melia Azadirachta Leaf Extract, Undaria Pinnatifida Extract, Inulin, Moringa Oleifera Seed Oil, Phenoxyethanol, Paraffin, Potassium Sorbate, Mannitol, Cellulose, Dipropylene Glycol, Sodium Benzoate, Sodium Citrate, Hydroxypropyl Methylcellulose, Citric Acid, Ethylhexylglycerin, Pantolactone, Caprylyl Glycol, Mica.",
        "n_loves": "2.2K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-peptide-21-reg-lift-firm-moisturizer-P465366",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:27:07",
        "product_name": "Peptide 21® Wrinkle Resist Moisturizer",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$129.00"
                ],
                "sku": "Item 2386035"
            }
        ],
        "rating": "width:66.316%",
        "product_reviews": "19",
        "ingredients": " -Peptide and Neuropeptide Complex: Helps to visibly lift and firm skin's appearance.-Asian Natto Gum: Helps improve the look of elasticity, radiance, uneven skin tone, and texture.-Phytofleur™ Cactus: Helps to hydrate.  Water, Glycerin, Dimethicone, Olive Oil Decylesters, Glycereth-26, Squalane, Butylene Glycol, Behenyl Alcohol, Polysilicone-11, Batyl Alcohol, Simmondsia Chinensis (Jojoba) Seed Oil, Hexapeptide-11, Dipeptide Diaminobutyroyl Benzylamide Diacetate, Palmitoyl Tripeptide-5, Tripeptide-10 Citrulline, Acetyl Hexapeptide-1, Acetyl Tetrapeptide-11, Acetyl Hexapeptide-8, Palmitoyl Hexapeptide-12, Acetyl Tetrapeptide-9, Palmitoyl Tetrapeptide-7, Acetyl Tetrapeptide-2, Acetyl Octapeptide-3, Palmitoyl Hexapeptide-19, Trifluoroacetyl Tripeptide-2, Tripeptide-1, Palmitoyl Oligopeptide, Palmitoyl Tripeptide-1, Potassium Hydrolyzed Polygamma-Glutamate, Sodium Polyglutamate, Squalene, Mica (Ci 77019), Sodium Hyaluronate, Sorbic Acid, Tocopherol, Cereus Grandiflorus (Cactus) Flower Extract, Pseudoalteromonas Ferment Extract, Leuconostoc/Radish Root Ferment Filtrate, Magnesium Chloride, Phenoxyethanol, Cetyl Alcohol, Stearyl Alcohol, Trehalose, Glyceryl Stearate, Silanetriol Trehalose Ether, Mannitol, Phytosterols, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Caprylic/Capric Triglyceride, Hydrogenated Lecithin, Polyglyceryl-10 Myristate, Polysorbate 20, Dimethyl Isosorbide, Sodium Benzoate, Potassium Sorbate, Caprylyl Glycol, Sodium Hydroxide, Laureth-12, Hydrolyzed Wheat Protein, Lecithin, Disodium Phosphate, Hydrolyzed Soy Protein, Carbomer, Dextran, Ethylhexylglycerin, Sodium Lactate, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Sodium Phosphate, Xanthan Gum, Triethanolamine, Acrylates Copolymer.",
        "n_loves": "538",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cucumber-gel-mask-P390018",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:27:19",
        "product_name": "Cucumber Gel Mask",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$75.00"
                ],
                "sku": "Item 1529528"
            }
        ],
        "rating": "width:84.35600000000001%",
        "product_reviews": "652",
        "ingredients": " -Cucumber Extract: Helps soothe, hydrate, and de-tox™ the look of skin.\t\n-Papaya Extract: Helps soften and smooth skin's appearance.\t\t\n-Chamomile Extract: Helps comfort and calm the look of skin. Water/Aqua/Eau, Butylene Glycol, Cucumis Sativus (Cucumber) Fruit Extract, Ananas Sativus (Pineapple) Fruit Extract, Vaccinium Myrtillus Fruit/Leaf Extract, Carica Papaya (Papaya) Fruit Extract, Acer Saccharum (Sugar Maple) Extract, Saccharum Officinarum (Sugar Cane) Extract, Aloe Barbadensis Leaf Juice, Chamomilla Recutita (Matricaria) Flower Extract, Chamomilla Recutita (Matricaria) Flower Oil, Citrus Limon (Lemon) Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Mangifera Indica (Mango) Fruit Extract, Sodium PCA, Allantoin, Glycerin, Propylene Glycol, Disodium EDTA, Sodium Hydroxide, Citric Acid, Carbomer, Triethanolamine, Polysorbate 20, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol, Yellow 5 (CI 19140), Blue 1 (CI 42090). \n",
        "n_loves": "7.9K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-water-drench-hyaluronic-cloud-mask-P473857",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:27:31",
        "product_name": "Water Drench® Hyaluronic Cloud Mask Hydrating Gel",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:45.714%",
        "product_reviews": "7",
        "ingredients": "-Hyaluronic Acid Complex 20%: Drenches skin with a liquid cloud of moisture and draws in water.-Pentavitin®: Helps provide hydration for up to 72 hours, even after cleansing.-Vitamin E, Aloe, and Caffeine: Help nourish, soothe, and support the look of dry and dehydrated skin.Water/Aqua/Eau, Glycerin, Polysorbate 20, Carbomer, Propylene Glycol, Sodium Hyaluronate, Saccharide Isomerate, Sodium PCA, Sodium Hydroxide, Caffeine, Aloe Barbadensis Leaf Juice, Citric Acid, Tocopheryl Acetate, Menthol, Eucalyptus Globulus Leaf Extract, Sodium Citrate, Menthoxypropanediol, Sodium Phytate, Sodium Benzoate, Potassium Sorbate, Ethylhexylglycerin, FD&C Blue No. 1/CI 42090, Phenoxyethanol.",
        "n_loves": "796",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-multi-masker-4-piece-mask-kit-P502725",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:27:43",
        "product_name": "Multi-Masker 4-Piece Mask Kit",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:80%",
        "product_reviews": "10",
        "ingredients": "-Hyaluronic Acid: Drenches skin with a liquid cloud of moisture and draws in water.-24K Gold and Colloidal Gold: Drenches skin with a liquid cloud of moisture and draws in water.-Cucumber Extract: Helps soothe, hydrate, and de-tox™ the look of skin.Water Drench® Hyaluronic Cloud Mask Hydrating Gel:Water/Aqua/Eau, Glycerin, Polysorbate 20, Carbomer, Propylene Glycol, Sodium Hyaluronate, Saccharide Isomerate, Sodium PCA, Sodium Hydroxide, Caffeine, Aloe Barbadensis Leaf Juice, Citric Acid, Tocopheryl Acetate, Menthol, Eucalyptus Globulus Leaf Extract, Sodium Citrate, Menthoxypropanediol, Sodium Phytate, Sodium Benzoate, Potassium Sorbate, Ethylhexylglycerin, FD&C Blue No. 1/CI 42090, Phenoxyethanol.Pumpkin Enzyme Mask Enzymatic Dermal Resurfacer:Water/Aqua/Eau, Cucurbita Pepo (Pumpkin), Alumina, Glycerin, Triethanolamine, Carbomer, Lactobacillus/Pumpkin Fruit Ferment Filtrate, Sodium Lactate, Leuconostoc/Radish Root Ferment Filtrate, Potassium Sorbate, Sodium Benzoate, Sodium Hyaluronate, Chlorphenesin, Benzoic Acid, Sorbic Acid, Sodium Phytate, Ascorbic Acid, Tocopheryl Acetate, Benzyl Alcohol, Cinnamal, Phenoxyethanol, Fragrance/Parfum.24K Gold Mask Pure Luxury Lift & Firm:Glycerin, Water/Aqua/Eau, Sodium Hyaluronate, Caffeine, Olivine Extract, Colloidal Gold, Pentylene Glycol, Carbomer, Sodium Hydroxide, Potassium Sorbate, Sodium Benzoate, Sodium Metabisulfite, Mica, Phenoxyethanol, Gold (CI 77480), Iron Oxides (CI 77491), Titanium Dioxide (CI 77891).Cucumber Gel Mask Extreme De-Tox™ Hydrator:Water/Aqua/Eau, Butylene Glycol, Cucumis Sativus (Cucumber) Fruit Extract, Ananas Sativus (Pineapple) Fruit Extract, Vaccinium Myrtillus Fruit/Leaf Extract, Carica Papaya (Papaya) Fruit Extract, Acer Saccharum (Sugar Maple) Extract, Saccharum Officinarum (Sugar Cane) Extract, Aloe Barbadensis Leaf Juice, Chamomilla Recutita (Matricaria) Flower Extract, Chamomilla Recutita (Matricaria) Flower Oil, Citrus Limon (Lemon) Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Mangifera Indica (Mango) Fruit Extract, Sodium PCA, Allantoin, Glycerin, Propylene Glycol, Disodium EDTA, Sodium Hydroxide, Citric Acid, Carbomer, Triethanolamine, Polysorbate 20, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol, Yellow 5 (CI 19140), Blue 1 (CI 42090).",
        "n_loves": "9.3K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-potent-c-trade-power-brightening-hydra-gels-P464799",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:27:53",
        "product_name": "Potent-C™ Power Brightening Hydra-Gels",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 30 Pairs/ 60 Patches"
                ],
                "price": [
                    "$88.00"
                ],
                "sku": "Item 2377364"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 Pair / 2 Patches"
                ],
                "price": [
                    "$7.00"
                ],
                "sku": "Item 2668598"
            }
        ],
        "rating": "width:88.634%",
        "product_reviews": "183",
        "ingredients": " -THD Ascorbate Vitamin C: Has more stability than and 50 times the power of traditional vitamin C. -Ferulic Acid and Vitamin E: Work synergistically with THD ascorbate to enhance its benefits. -Caffeine: Visibly firms the skin and reduces puffiness around the delicate eye area. Water/Aqua/Eau, Glycerin, Chondrus Crispus Powder, Butylene Glycol, Chondrus Crispus Extract, Sodium Hyaluronate, Tetrahexyldecyl Ascorbate, Ferulic Acid, Hydrolyzed Collagen, Tocopheryl Acetate, Niacinamide, Adenosine, Aloe Barbadensis Leaf Juice Powder, Citrus Limon (Lemon) Fruit Extract, Actinidia Chinensis (Kiwi) Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Vitis Vinifera (Grape) Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Junos Fruit Extract, Fragaria Chiloensis (Strawberry) Fruit Extract, Allantoin, Chlorphenesin, Caffeine, 1,2-Hexanediol, Ceratonia Siliqua (Carob) Gum,  Xanthan Gum, Calcium Lactate, Ricinus Communis (Castor) Seed Oil, Iron Oxide Red (Ci 77491), Dextrin,  Peg-60 Hydrogenated Castor Oil, Potassium Chloride, Titanium Dioxide, Disodium Edta, Synthetic Fluorphlogopite, Tin Oxide, Phenoxyethanol. ",
        "n_loves": "13.1K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/max-complexion-correction-pads-P419864",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:28:06",
        "product_name": "Max Complexion Correction Pads",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 60 Pads"
                ],
                "price": [
                    "$65.00"
                ],
                "sku": "Item 1933464"
            }
        ],
        "rating": "width:85.084%",
        "product_reviews": "118",
        "ingredients": "-2% Salicylic Acid: Over-the-counter level visibly clears acne and blemishes and helps prevent future breakouts.  -10% Glycolic Acid Complex: Chemically exfoliates to help improve the look of fine lines and uneven skin tone and texture.-Aloe and Allantoin: Help calm and soothe skin's appearance.Ethanol, Water/Aqua/Eau, Butylene Glycol, Glycolic Acid, Hamamelis Virginiana (Witch Hazel) Water, Aloe Barbadensis Leaf Juice, L-Arginine, Sodium Hydroxide, Chamomilla Recutita (Matricaria) Flower Extract, Fragrance/Parfum, Prunus Persica Fruit Extract, Camellia Sinensis Leaf Extract, Phenoxyethanol, Symphytum Officinale Root Extract, Allantoin, Triethanolamine, Benzoic Acid, Citric Acid, Potassium Sorbate, Sodium Benzoate.",
        "n_loves": "5.4K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/instant-firmx-lip-filler-P507348",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:28:18",
        "product_name": "Instant FIRMx® Lip Filler",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 0.3 fl oz / 10 mL",
                    "NEW"
                ],
                "price": [
                    "$40.00"
                ],
                "sku": "Item 2703650"
            }
        ],
        "rating": "width:73.334%",
        "product_reviews": "3",
        "ingredients": "-2% LineFill™: Increases the look of lip fullness for a temporary effect.-1% Maxi-Lip™: Helps to enhance the look of lip volume with continued use.-3% Hyaluronic Acid Filling Spheres: Plump the look of lips with moisture for a hydrated and supple appearance.Polyisobutene, Squalane, C12-15 Alkyl Benzoate, Hydrogenated Polydecene, Octyldodecanol, Helianthus Annuus (Sunflower) Seed Wax, Simmondsia Chinensis (Jojoba) Seed Oil, Vinyl Dimethicone/Lauryl Dimethicone Crosspolymer, Theobroma Cacao (Cocoa) Seed Butter, Tribehenin, Ethylhexyl Palmitate, Cocos Nucifera (Coconut) Oil, Silica, Caprylic/Capric Triglyceride, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Punica Granatum Seed Oil, Butyrospermum Parkii (Shea) Butter, Dipalmitoyl Hydroxyproline, Palmitoyl Tripeptide-1, Sesamum Indicum (Sesame) Seed Extract, Glucomannan, Dimethyl Isosorbide, Glyceryl Caprylate, Linoleic Acid, Tocopheryl Acetate, Palmitic Acid, Mentha Piperita (Peppermint) Oil, Tocopherol, Sodium Hyaluronate, Capsicum Frutescens Fruit Extract, Linolenic Acid, Trihydroxystearin, Sorbitan Isostearate, Cococaprylate/Caprate, Glyceryl Undecylenate, Polyhydroxystearic Acid, Polyglyceryl-6 Polyricinoleate, Dilinoleic Acid/Butanediol Copolymer, Disodium Stearoyl Glutamate, Water/Aqua/Eau, Castor Oil/IPDI Copolymer, Mica, Tin Oxide, Titanium Dioxide/CI 77891, Iron Oxides/CI 77491.",
        "n_loves": "821",
        "categories": [
            "Makeup",
            "Lip",
            "Lip Balms & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/water-drench-hyaluronic-cloud-cream-P416160",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:28:30",
        "product_name": "Water Drench® Hyaluronic Cloud Cream Hydrating Moisturizer ",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 / 50 mL"
                ],
                "price": [
                    "$73.00"
                ],
                "sku": "Item 1904275"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.67 oz/ 20 mL"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 1993153"
            }
        ],
        "rating": "width:84.84%",
        "product_reviews": "1.9K",
        "ingredients": "-Hyaluronic Acid Complex 30%: Moisturizes the skin and helps it appear supple and smooth.-Pentavitin®: Helps provide hydration for up to 72 hours.-Hydrolyzed Silk: Derivative of silk that helps leave skin feeling silky soft and smooth.Water/Aqua/Eau, Glycerin, Cyclopentasiloxane, Dipropylene Glycol, Dimethicone, Cyclohexasiloxane, Yeast Extract, Sodium Hyaluronate, Ceramide EOP, Ceramide EOS, Ceramide AP, Ceramide NP, Ceramide NS, Sambucus Nigra Fruit Extract, Hydrolyzed Silk, Sodium PCA, Tocopherol, Ascorbyl Palmitate, Caprooyl Phytosphingosine, Caprooyl Sphingosine, Saccharide Isomerate, Saccharomyces/Magnesium Ferment, Saccharomyces/Iron Ferment, Saccharomyces/Copper Ferment, Saccharomyces/Silicon Ferment, Saccharomyces/Zinc Ferment, Olea Europaea (Olive) Leaf Extract, Methyl Gluceth-20, Ethylhexylglycerin, Lauryl PEG-9 Polydimethylsiloxyethyl Dimethicone, Cholesterol, Sodium Chloride, Sodium Citrate, Citric Acid, Behenic Acid, Propylene Glycol, Ceteareth-25, Butylene Glycol, Dimethicone/PEG-10/15 Crosspolymer, Cetyl Alcohol, Disodium EDTA, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Mica.",
        "n_loves": "18.8K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/potent-c-tm-power-serum-P429041",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:28:44",
        "product_name": "Potent-C™ Power Serum",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$142.00"
                ],
                "sku": "Item 2051886"
            }
        ],
        "rating": "width:69.206%",
        "product_reviews": "126",
        "ingredients": "  -THD Ascorbate 20%: Ultra-stable scientific breakthrough form of vitamin C that is 50 times more powerful than traditional vitamin C.\t\t\n-Vitamin E 3% and Ferulic Acid 2%: Help boost the performance of THD Ascorbate vitamin C while providing antioxidant benefits.Water/Aqua/Eau, Tetrahexyldecyl Ascorbate, Butylene Glycol, C9-12 Alkane, Caprylyl Methicone, Tocopheryl Acetate, C10-18 Triglycerides, Polyglyceryl-6 Distearate, Ferulic Acid, Squalane, Hydrogenated Lecithin, Propanediol, Sodium Hyaluronate, Zingiber Officinale (Ginger) Root Extract, Curcuma Longa (Turmeric) Root Extract, Panax Ginseng Root Extract, Jojoba Esters, Leuconostoc/Radish Root Ferment Filtrate, Coco-Caprylate/Caprate, Glycerin, Cetyl Alcohol, Polyglyceryl-3 Beeswax, Xanthan Gum, Disodium EDTA, Mica, Ethylhexylglycerin, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol. \n\n",
        "n_loves": "3.3K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/potent-c-tm-power-eye-cream-P433868",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:28:56",
        "product_name": "Potent-C™ Power Eye Cream",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:79.828%",
        "product_reviews": "350",
        "ingredients": "  -THD Ascorbate: Ultra-potent, gold standard vitamin C that helps improve the look of uneven skin tone and texture, firmness, and fine lines and wrinkles; 50 times more potent than traditional vitamin C (ascorbic acid).\n-Vitamin E: Provides antioxidant benefits.   \n-Ferulic Acid: An antioxidant that works synergistically with vitamins C and E to enhance their benefits.\n-Filmexel®: Acts like a second skin to help protect the delicate eye area.Water, Butylene Glycol, Tetrahexyldecyl Ascorbate, C9-12 Alkane, Tocopheryl Acetate, Bambusa Arundinacea Stem Powder, PEG-100 Stearate, Cetyl Ricinoleate, Ferulic Acid, Butyrospermum Parkii (Shea) Butter, Behenyl Alcohol, Methyl Trimethicone, Glycerin, Carbomer, Methyldihydrojasmonate, Polymethylsilsesquioxane, Saccharomyces Ferment Filtrate, Hydrogenated Lecithin, Diamond Powder, Caffeine, Sodium Hyaluronate, Ubiquinone, Ethylhexylglycerin, Squalane, Soluble Collagen, Undaria Pinnatifida Extract, Caesalpinia Spinosa Fruit Extract, Arnica Montana Flower Extract, Olea Europaea (Olive) Fruit Oil, Corallina Officinalis Extract, Kappaphycus Alvarezii Extract, Tribehenin, C12-15 Alkyl Benzoate, Coco-Caprylate/Caprate, Caprylic/Capric Triglyceride, Jojoba Wax PEG-120 Esters, Sodium Hydroxide, Myristyl Alcohol, Steareth-20, Mica, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol.\n",
        "n_loves": "1.3K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-water-drench-reg-hyaluronic-glow-serum-P467788",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:29:07",
        "product_name": "Water Drench® Hyaluronic Glow Serum",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$98.00"
                ],
                "sku": "Item 2419380"
            }
        ],
        "rating": "width:88.55999999999999%",
        "product_reviews": "486",
        "ingredients": "-HydraFence™ 3%: Provides up to 120 hours of enhanced hydration.-Hyaluronic Acid Complex 75%: Drenches skin with moisture for a plumper look.-Ceramide Complex 5%: Helps improve the look of fine lines and wrinkles.Water/Aqua/Eau, Ricinus Communis (Castor) Seed Oil, Butylene Glycol, Isostearyl Neopentanoate, Glycerin, Sodium Hyaluronate, Lactic Acid, Sphingolipids, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Amylopectin, Phospholipids, Carbomer, Potassium Sorbate, Ethylhexylglycerin, Sodium Hydroxide, Ascorbyl Palmitate, Tocopherol, Lecithin, Sodium Benzoate, Malachite Extract, Lithothamnion Calcareum Extract, Sodium Citrate, Pentylene Glycol, Isostearyl Alcohol, Xanthan Gum, Hydrogenated Palm Glycerides Citrate, Dimethicone, FD&C Blue No. 1 (CI 42090), Phenoxyethanol.",
        "n_loves": "2.3K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/goodbye-acne-tm-acne-treatment-gel-P507513",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:29:19",
        "product_name": "Goodbye Acne™ Acne Treatment Gel",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 1.7 fl oz / 50 ml",
                    "OUT OF STOCK",
                    "NEW"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2703668"
            }
        ],
        "rating": "",
        "product_reviews": "",
        "ingredients": "-2% Salicylic Acid: Diminishes the look of blemishes and helps prevent acne.-1% Time-Released Microencapsulated Retinol, Vitamin C, and Pantothenic Acid: Reduce the appearance of post-acne marks.-Aloe Vera: Hydrates and soothes the look of skin.Salicylic Acid 2%, Non-Medicinal Ingredients, Water/Aqua/Eau, Isononyl Isononanoate, Glyceryl Stearate, Pentylene Glycol, Caprylic/Capric Triglyceride, Propanediol, Cetyl Alcohol, Dimethicone, C9-12 Alkane, PEG-75 Stearate, Butyrospermum Parkii (Shea) Butter, Caprylyl Methicone, Phenoxyethanol, Polyacrylate Crosspolymer-6, Sodium Hydroxide, Butylene Glycol, PEG-100 Stearate, Dl-Alpha Tocopheryl Acetate, Glycerin, Silica, Ceteth-20, Steareth-20, Lecithin, Citric Acid, Coco-Caprylate/Caprate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sodium Phytate, Tetrahexyldecyl Ascorbate, Diethylhexyl Syringylidenemalonate, Squalane, Alcohol, Retinol, Polysorbate 20, Sodium Benzoate, T-Butyl Alcohol, Potassium Sorbate, Polysorbate 60, Oryza Sativa (Rice) Bran Extract, Boswellia Serrata Extract, Honey Extract/Extrait De Miel, Potassium Phosphate, Monobasic, Aloe Barbadensis Extract, Hydrolyzed Vegetable Protein.",
        "n_loves": "13",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-water-drench-hyaluronic-cloud-hydrating-eye-gel-P458206",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:29:32",
        "product_name": "Water Drench® Hyaluronic Cloud Hydrating Eye Gel",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$59.00"
                ],
                "sku": "Item 2355345"
            }
        ],
        "rating": "width:68%",
        "product_reviews": "20",
        "ingredients": "-Hyaluronic Acid Complex 50%: Moisturizes and leaves skin feeling silky soft.-Pentavitin®: Helps provide hydration for up to 72 hours.-AcquaCell 3% and Malachite Complex 2.6%: Help smooth the look of fine lines, wrinkles, and crow’s feet.Water/Aqua/Eau, Butylene Glycol, Dimethicone, Glycerin, Polysilicone-11, Sodium Hyaluronate, Lens Esculenta (Lentil) Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Caffeine, Tocopheryl Acetate, Malachite Extract, Hydrolyzed Silk, Oryza Sativa (Rice) Bran Extract, Ceramide NP, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7, Biotin, Ceramide EOP, Silybum Marianum Seed Extract, Betula Alba Bark Extract, Chrysin, Citrullus Lanatus (Watermelon) Fruit Extract, Ceramide AP, Ascorbyl Palmitate, Ceramide NS, Phenoxyethanol, PEG-240/HDI Copolymer Bis-Decyltetradeceth-20 Ether, Ceramide AS, Saccharide Isomerate, Acrylamide/Sodium Acryloyldimethyltaurate Copolymer, Isohexadecane, Hydroxyethylcellulose, Dimethylacrylamide/Acrylic Acid/Polystyrene Ethyl Methacrylate Copolymer, Cholesterol, Sodium Acryloyldimethyltaurate/VP Crosspolymer, Polysorbate 80, Sodium Lactate, Sodium Benzoate, Decyl Glucoside, Potassium Sorbate, Sorbitan Oleate, Ethylhexylglycerin, Sodium PCA, Caprylyl Glycol, Hexylene Glycol, Ceteareth-25, Citric Acid, Sodium Citrate, T-Butyl Alcohol, Steareth-20, Hydrogenated Lecithin, Cetyl Alcohol, Chlorhexidine Digluconate, Dipropylene Glycol, Disodium EDTA, Tocopherol, Potassium Laurate, Disodium Phosphate, Polysorbate 60, Behenyl Alcohol, Glyceryl Stearate, Sucrose Distearate, N-Hydroxysuccinimide, Sodium Phosphate.",
        "n_loves": "1.3K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-potent-c-power-scrub-P462728",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:29:44",
        "product_name": "Potent-C™ Power Scrub",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 120 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 2387066"
            }
        ],
        "rating": "width:77.5%",
        "product_reviews": "8",
        "ingredients": " -THD Ascorbate Vitamin C: An ultra-stable form of Vitamin C that is 50 times more powerful than traditional Vitamin C.-Vitamin E and Ferulic Acid: Work synergistically to help boost performance of vitamin C.-Multicolored Beads and Spheres: Deliver a multidimensional treatment that helps brighten, exfoliate, polish, nourish, and condition skin's appearance. Water/Aqua/Eau, Alumina, Glycerin, Jojoba Esters, Cellulose, Mannitol, Hydrogenated Jojoba Oil, Carbomer, Tetrahexyldecyl Ascorbate, Ferulic Acid, Ascorbyl Palmitate, Theobroma Cacao (Cocoa) Seed Butter, Simmondsia Chinensis (Jojoba) Seed Oil, Citrus Limon (Lemon) Fruit Extract, Sodium Hyaluronate, Tocopheryl Acetate, L Actose, Phenoxyethanol, Polysorbate 20, Sodium Hydroxide, Hydroxypropyl Methylcellulose, Polyvinyl Alcohol, Silica, Tin Oxide, Potassium Sorbate, Sodium Benzoate, Talc, Ethylhexylglycerin, Fragrance, Titanium Dioxide, Iron Oxides (Ci 77499, Ci 77492), D&C Red No. 30 Lake, D&C Red No. 30, Fd&C Yellow No. 5 Aluminum Lake.",
        "n_loves": "841",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/24k-gold-pure-luxury-lift-firm-hydra-gel-eye-patches-P406104",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:29:56",
        "product_name": "24K Gold Pure Luxury Lift & Firm Hydra-Gel Eye Patches",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 30 pairs - 60 patches"
                ],
                "price": [
                    "$102.00"
                ],
                "sku": "Item 1809318"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 Pair / 2 Patches"
                ],
                "price": [
                    "$7.00"
                ],
                "sku": "Item 2668523"
            }
        ],
        "rating": "width:74.82%",
        "product_reviews": "332",
        "ingredients": " -24K Gold and Colloidal Gold: Give skin a more lifted and firmer appearance for a more youthful-looking eye area.-Caffeine: Helps reduce the look of undereye puffiness. -Hydrolyzed Collagen: Visibly diminishes fine lines, wrinkles, and crow's feet around the delicate eye area.Water/Aqua/Eau, Glycerin, Carrageenan, Butylene Glycol, Ceratonia Siliqua (Carob) Gum, Colloidal Gold, Sodium Hyaluronate, Hydrolyzed Collagen, Caffeine, Niacinamide, Aloe Barbadensis Leaf Juice Powder, Tocopheryl Acetate, Allantoin, Jania Rubens Extract, Adenosine, Lavandula Angustifolia (Lavender) Oil, Ricinus Communis (Castor) Seed Oil, Calcium Lactate, Xanthan Gum, Disodium EDTA, Peg-60 Hydrogenated Castor Oil, Synthetic Fluorphlogopite, Mica, Tin Oxide, Chlorphenesin, Phenoxyethanol, Gold (Ci 77480), Iron Oxides (Ci 77491), Titanium Dioxide (Ci 77891).",
        "n_loves": "56.9K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/instant-firmx-eye-tm-P381549",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:30:08",
        "product_name": "Instant FIRMx® Eye Temporary Eye Tightener",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$52.00"
                ],
                "sku": "Item 1391416"
            }
        ],
        "rating": "width:59.07%",
        "product_reviews": "86",
        "ingredients": "-Firm-A-Tite™: A blend of silicates and seaweed that quickly, temporarily, and visibly tightens.-Eyeliss™: A powerful peptide complex that addresses puffiness and wrinkles over time.-Eye Regener®: A potent alfalfa-lupine complex that targets under-eye bags over time.Water/Aqua/Eau, Glycerin, Butylene Glycol, Sodium Silicate, Sodium Magnesium Fluorosilicate, Magnesium Aluminum Silicate, Dipeptide-2, Palmitoyl Tetrapeptide-7, Argania Spinosa Kernel Extract, Hesperidin Methyl Chalcone, Hydrolyzed Lupine Protein, Sodium Cocoyl Glutamate, Medicago Sativa (Alfalfa) Seed Extract, Tocopheryl Acetate, Ascorbic Acid, Panthenol, Sodium Citrate, Carbomer, Foeniculum Vulgare (Fennel) Seed Extract, Symphytum Officinale Leaf Extract, Chlorhexidine Digluconate, Ethylhexylglycerin, Steareth-20, Carrageenan, Sodium Phytate, Potassium Sorbate, Sodium Benzoate, Citric Acid, Phenoxyethanol.",
        "n_loves": "10.7K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peptide-21-amino-acid-exfoliating-peel-pads-P443346",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:30:21",
        "product_name": "Peptide 21™ Amino Acid Exfoliating Peel Pads",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 60 Pads"
                ],
                "price": [
                    "$75.00"
                ],
                "sku": "Item 2213189"
            }
        ],
        "rating": "width:92.712%",
        "product_reviews": "590",
        "ingredients": " -20% Exfoliating Complex of Phytic Acid, Salicylic Acid and Sodium Lactate: Exfoliates to help reveal beautiful, healthier, younger-looking skin.-Chamomile and Green Tea: Help calm and soothe skin's appearance.-Vitamins A and E: Deliver antioxidant benefits. Water, Butylene Glycol, Sodium Lactate, Phytic Acid, Ppg-5-Ceteth-20, Rosa Centifolia Flower Water, Hamamelis Virginiana (Witch Hazel) Water, Salicylic Acid, Threonine, Glutamic Acid, Serine, Aspartic Acid, Arginine, Alanine, Proline, Valine, Histidine, Glycine, Lysine, Chamomilla Recutita (Matricaria) Flower Extract, Camellia Sinensis Leaf Extract, Ascorbic Acid, Retinyl Palmitate, Tocopheryl Acetate, Aloe Barbadensis Leaf Juice, Borago Officinalis Seed Oil, Symphytum Officinale Leaf Extract, Citrus Limon (Lemon) Peel Extract, Citrus Aurantifolia (Lime) Peel Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Tangerina (Tangerine) Peel Extract, Mentha Piperita (Peppermint) Extract, Salvia Officinalis (Sage) Leaf Extract, Zingiber Officinale (Ginger) Root Extract, Phenoxyethanol, Sodium Hydroxide, Aminobutyric Acid, Potassium Sorbate, Sodium Benzoate, Caprylic/- Capric Triglyceride, Peg-8 Dimethicone, Leucine, Sodium Ascorbyl Phosphate, Limonene, Benzoic Acid, Tyrosine, Phenylalanine, Isoleucine, Citric Acid, Octyldodecanol, Silica, Sodium Propoxyhydroxypropyl Thiosulfate Silica.",
        "n_loves": "4.9K",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/cucumber-de-tox-hydra-gel-eye-patches-P412025",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:30:34",
        "product_name": "Cucumber De-Tox™ Hydra-Gel Eye Patches",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 60 Pads-30 Treatments"
                ],
                "price": [
                    "$75.00"
                ],
                "sku": "Item 1863117"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 Pair / 2 Patches"
                ],
                "price": [
                    "$7.00"
                ],
                "sku": "Item 2668606"
            }
        ],
        "rating": "width:79.248%",
        "product_reviews": "399",
        "ingredients": " -Cucumber Extract: Nourishes, hydrates, and de-puffs skin’s appearance.-Allantoin, Aloe, and Chamomile: Soothe and calm skin.  -Caffeine and Arnica: Diminish the look of dark circles.Water/Aqua/Eau, Glycerin, Carrageenan, Dipropylene Glycol, Ceratonia Siliqua (Carob) Gum, Cucumis Sativus (Cucumber) Fruit Extract, Aloe Barbadensis Leaf Juice Powder, Caffeine, Arnica Montana Flower Extract, Sodium Hyaluronate, Hydrolyzed Collagen, Chamomilla Recutita (Matricaria) Flower Extract, Camellia Sinensis Leaf Extract, Tocopheryl Acetate, Niacinamide, Adenosine, Allantoin, Maltodextrin, Ethylhexylglycerin, Butylene Glycol, Calcium Lactate, Ricinus Communis (Castor) Seed Oil, Xanthan Gum, Dextrin, Potassium Chloride, Disodium EDTA, Peg-60 Hydrogenated Castor Oil, Chlorphenesin, Phenoxyethanol, Mica, Fragrance/Parfum, Yellow 5 (CI19140), Blue 1 (CI 42090).",
        "n_loves": "57.9K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-full-size-hydration-essentials-2-piece-kit-P471062",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:30:47",
        "product_name": "Full-Size Water Drench® Hydra-Pair 2-Piece Kit",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:92.308%",
        "product_reviews": "52",
        "ingredients": "-Hyaluronic Acid: A potent hydrator that drenches skin with moisture and draws in water.-Ceramide NP: Helps smooth and improve the look of fine lines and wrinkles.-Caffeine: Helps reduce the look of under-eye puffiness.Water Drench® Hyaluronic Cloud Cream Hydrating Moisturizer:Water/Aqua/Eau, Glycerin, Cyclopentasiloxane, Dipropylene Glycol, Dimethicone, Cyclohexasiloxane, Yeast Extract, Sodium Hyaluronate, Ceramide EOP, Ceramide EOS, Ceramide AP, Ceramide NP, Ceramide NS, Sambucus Nigra Fruit Extract, Hydrolyzed Silk, Sodium PCA, Tocopherol, Ascorbyl Palmitate, Caprooyl Phytosphin-Gosine, Caprooyl Sphingosine, Saccharide Isomerate, Saccharomyces/Magnesium Ferment, Saccharomyces/Iron Ferment, Saccharomyces/Copper Ferment, Saccharo-Myces/Silicon Ferment, Saccharomyces/Zinc Ferment, Olea Europaea (Olive) Leaf Extract, Methyl Gluceth-20, Ethylhexylglycerin, Lauryl Peg-9 Polydimethylsiloxyethyl Dimethicone, Cholesterol, Sodium Chloride, Sodium Citrate, Citric Acid, Behenic Acid, Propylene Glycol, Ceteareth-25, Butylene Glycol, Dimethicone/PEG-10/15 Crosspolymer, Cetyl Alcohol, Disodium EDTA, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Mica.Water Drench® Hyaluronic Cloud Hydra-Gel Eye Patches:Water/Aqua/Eau, Glycerin, Butylene Glycol, Sodium Hyaluronate, Hydrolyzed Collagen, Caffeine, Ceramide NP, Arnica Montana Flower Extract, Althaea Officinalis Root Extract, Allantoin, Tocopherol, Hydrolyzed Sodium Hyaluronate, Butyrospermum Parkii (Shea) Butter, Glycyrrhiza Glabra (Licorice) Root Extract, Scutellaria Baicalensis Root Extract, Angelica Gigas Root Extract, Cimicifuga Racemosa Root Extract, Morus Alba Bark Extract, Paeonia Lactiflora Root Extract, Phellinus Linteus Extract, Polygonum Multiflorum Root Extract, Sesamum Indicum (Sesame) Seed Extract, Sophora Angustifolia Root Extract, Aloe Barbadensis Leaf Juice, Ricinus Communis (Castor) Seed Oil, Amorphophallus Konjac Root Powder, Carrageenan, Hydroxyacetophenone, Hexylene Glycol, Propanediol, Xylitylglucoside, Sucrose, Anhydroxylitol, Glyceryl Caprylate, Xylitol, Betaine, Ethylhexylglycerin, Glucose, Lecithin, Maltodextrin, Magnesium Aspartate, Zinc Gluconate, Aluminum Hydroxide, Copper Gluconate, PEG-60 Hydrogenated Castor Oil, Gellan Gum, Cyamopsis Tetragonoloba (Guar) Gum, Ceratonia Siliqua Gum, Calcium Chloride, Tin Oxide, Synthetic Fluorphlogopite, Bis(Glycidoxyphenyl)Propane/Bisaminomethylnorbornane Copolymer, Caprylhydroxamic Acid, Disodium EDTA, 1,2-Hexanediol, Ethyl Hexanediol Chlorphenesin, Phenoxyethanol, Mica, Blue 1 (CI 42090), Titanium Dioxide (CI 77891), Iron Oxides (CI 77491).",
        "n_loves": "19.5K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/acne-system-P420421",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:30:58",
        "product_name": "Acne System",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:80.91799999999999%",
        "product_reviews": "109",
        "ingredients": "Acne Clearing Wash:-Salicylic Acid (BHA): Minimizes the look of acne blemishes and helps prevent future breakouts.Water/Aqua/Eau, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Lauryl Glucoside, Dl-Alpha Tocopherol, Octisalate, Phenoxyethanol, Sodium Hydroxide, PEG-150 Pentaerythrityl Tetrastearate, Sodium Chloride, Sodium Benzotriazolyl Butylphenol Sulfonate, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, PPG-26-Buteth-26, Disodium EDTA, Sodium Citrate, Allantoin, Dl-Panthenol, PEG-40 Hydrogenated Castor Oil, PEG-6 Caprylic/Capric Glycerides, Propylene Glycol, BHT, Fragrance/Parfum, Dl-Limonene, Citric Acid, Potassium Sorbate, Sodium Benzoate, Linalool, Butylphenyl Methylpropional, PEG-120 Methyl Glucose Dioleate. Max Complexion Correction Pads:-Salicylic Acid (BHA): Minimizes the look of acne blemishes and helps prevent future breakouts. Ethanol, Water/Aqua/Eau, Butylene Glycol, Glycolic Acid, Hamamelis Virginiana (Witch Hazel) Water, Aloe Barbadensis Leaf Juice, L-Arginine, Sodium Hydroxide, Chamomilla Recutita (Matricaria) Flower Extract, Fragrance/Parfum, Prunus Persica Fruit Extract, Camellia Sinensis Leaf Extract, Phenoxyethanol, Symphytum Officinale Root Extract, Allantoin, Triethanolamine, Benzoic Acid, Citric Acid, Potassium Sorbate, Sodium Benzoate. AHA/BHA Acne Clearing Gel:-Salicylic Acid (BHA): Minimizes the look of acne blemishes and helps prevent future breakouts. Water/Aqua/Eau, Ethanol, Glycolic Acid, Sodium Hydroxide, Glycerin, L-Arginine, Hydroxyethylcellulose, Phenoxyethanol, Butylene Glycol, Cyclopentasiloxane, Sodium Nitrate, T-Butyl Alcohol, Potassium Sorbate, Sodium Benzoate, Aloe Barbadensis Leaf Juice, Retinyl Palmitate, Disodium Phosphate, Polysorbate 60, Helianthus Annuus (Sunflower) Seed Oil, Arnica Montana Flower Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Sodium Phosphate, Monobasic, Denatonium Benzoate, BHT, Glyoxal, Citric Acid.Acne Spot and Area Treatment:-Glycolic Acid Complex (AHA): Chemically exfoliates to help improve the look of pores, fine lines, uneven skin tone and texture.-Colloidal Sulfur: Minimizes the look of acne blemishes and helps prevent future breakouts.Water/Aqua/Eau, Zeolite, Glycolic Acid, Zea Mays (Corn) Starch, Salicylic Acid, Ceteareth-20, Cetyl Alcohol, Acacia Senegal Gum, Polyacrylamide, Glyceryl Stearate, Zinc Oxide, Magnesium Aluminum Silicate, Phenoxyethanol, Peg-100 Stearate, Octyldodecyl Myristate, Caprylyl Glycol, C13-14 Isoparaffin, Bisabolol, Dl-Panthenol, L-Arginine, Methylpropanediol, Butylene Glycol, Allantoin, Polysorbate 80, Glycerin, Caprylhydroxamic Acid, Laureth-7, Aloe Barbadensis Leaf Juice, Disodium Edta, Hydrogenated Lecithin, Leptospermone, Magnesium Ascorbyl Phosphate, Dl-Alpha- Tocopheryl Acetate, Epilobium Angustifolium Flower/Leaf/Stem Extract, Dipotassium Glycyrrhizate, Flavesone, Isoleptospermone, Potassium Bitartrate, Titanium Dioxide, Salix Alba (Willow) Bark Extract, Potassium Sorbate, Sodium Benzoate, Arctostaphylos Uva Ursi Leaf Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Morus Alba Bark Extract, Hexylene Glycol, Isopropyl Myristate, Menthyl Acetate, Methyl Hydrogenated Rosinate, Methyl Rosinate, Triethyl Citrate, Dipropylene Glycol, Poly(Dipropyleneglycol Adipate), Echinacea Angustifolia Extract, Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract, Triethoxycaprylylsilane, 2,6-Dimethyl-7-Octen-2-Ol, Menthol, Vitis Vinifera (Grape) Seed Extract, Sodium Hydroxide, Myristic Acid, Leuconostoc/Radish Root Ferment Filtrate, Sodium Metabisulfite, Citric Acid, Potassium Benzoate, Chlorphenesin, Benzoic Acid, Sorbic Acid.",
        "n_loves": "6.9K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/even-smoother-tm-glycolic-retinol-hydra-gel-eye-patches-P506475",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:31:08",
        "product_name": "Even Smoother™ Glycolic Retinol Hydra-Gel Eye Patches",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 30 Pairs / 60 Patches"
                ],
                "price": [
                    "$88.00"
                ],
                "sku": "Item 2668549"
            }
        ],
        "rating": "width:95.032%",
        "product_reviews": "161",
        "ingredients": "-Glycolic Acid and Time-Released, Microencapsulated Retinol Complex 1%: Diminishes the look of tiny bumps, uneven texture, and signs of aging.-Niacinamide and Revital-Eyes: Soothe, depuff, and brighten the look of skin.-Shea Butter, Avocado Oil, and Vitamin E: Moisturize and reduce the potential for dryness.Water/Aqua/Eau, Glycerin, Chondrus Crispus Powder, Arginine, Glycolic Acid, Retinol, Caffeine, Niacinamide, Lactobacillus Ferment Lysate, Camellia Sinensis Leaf Extract, Punica Granatum Extract, Adenosine, Butyrospermum Parkii (Shea) Butter, Tocopherol Acetate, Persea Gratissima (Avocado) Oil, Lecithin, Lactobacillus Ferment, Allantoin, Sodium Hyaluronate, Tocopherol, Ceratonia Siliqua (Carob) Gum, Chondrus Crispus Extract, Xanthan Gum, Chlorphenesin, Potassium Chloride, Polyglyceryl-10 Laurate, Dextrin, Polyglyceryl-10 Myristate, Iron Oxide Red (CI 77491), Disodium EDTA, Synthetic Fluorphlogopite, Silica, Ultramarines(CI 77007), Butylene Glycol, Pentylene Glycol, Alcohol, Tin Oxide, Polysorbate 20, Potassium Phosphate,Titanium Dioxide (CI 77891), Phenoxyethanol.",
        "n_loves": "6.3K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-pro-strength-stretch-mark-treatment-cream-P482546",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:31:20",
        "product_name": "PRO Strength Stretch Mark Treatment Cream",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:66.666%",
        "product_reviews": "6",
        "ingredients": "-Regu®-Stretch 3%: Visibly reduces width, length, and density of stretch marks.-Regestril™ 2%: Discourages stretch marks from appearing.-Lactic Acid Complex 5%, Shea Butter, Cocoa Butter, Avocado Oil, and Ceramide NP: Deliver moisture and diminish the look of uneven tone and texture.Water/Aqua/Eau, C12-15 Alkyl Benzoate, Butyrospermum Parkii (Shea) Butter, Theobroma Cacao (Cocoa) Seed Butter, Lactic Acid, Stearic Acid, Propanediol, Glycerin, Sodium Hydroxide, Dimethicone, Butylene Glycol, Glyceryl Stearate, Glyceryl Stearate SE, Silica, Methyldihydrojasmonate, Dicaprylyl Carbonate, Caffeine, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7, Phaseolus Lunatus (Green Bean) Seed Extract, Palmitoyl Tripeptide-5, Persea Gratissima (Avocado) Oil, Sodium PCA, Marrubium Vulgare Extract, Sodium Phytate, Pantolactone, Citrus Limon (Lemon) Peel Extract, Avena Sativa (Oat) Kernel Flour, Cetyl Hydroxyethylcellulose, Panthenol, Rutin, Dipotassium Phosphate, Ceramide NP, Citrus Aurantium Dulcis (Orange) Fruit Extract, Zingiber Officinale (Ginger) Root Extract, Citrus Aurantifolia (Lime) Peel Extract, Salvia Officinalis (Sage) Leaf Extract, Mentha Piperita (Peppermint) Extract, Citrus Tangerina (Tangerine) Peel Extract, Potassium Sorbate, Sodium Benzoate, Caprylic/Capric Triglyceride, Xanthan Gum, Cetearyl Alcohol, Phenoxyethanol.",
        "n_loves": "1.6K",
        "categories": [
            "Bath & Body",
            "Shop by Concern",
            "Stretch Marks & Firming"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/acne-clearing-wash-P419866",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:31:30",
        "product_name": "Acne Clearing Wash",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8.5 oz"
                ],
                "price": [
                    "$53.00"
                ],
                "sku": "Item 1933449"
            }
        ],
        "rating": "width:85.40599999999999%",
        "product_reviews": "74",
        "ingredients": "-2% Salicylic Acid: Over-the-counter level visibly clears acne blemishes and helps prevent future breakouts.-Allantoin: Helps calm skin's appearance.-Pro Vitamin B5: Helps condition and nourish the look of skin. Water/Aqua/ Eau, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Lauryl Glucoside, Dl-Alpha Tocopherol, Octisalate, Phenoxyethanol, Sodium Hydroxide, PEG-150 Pentaerythrityl Tetrastearate, Sodium Chloride, Sodium Benzotriazolyl Butylphenol Sulfonate, Butyl Methoxydibenzoylmethane, Ethylhexyl Methoxycinnamate, PPG-26-Buteth-26, Disodium Edta, Sodium Citrate, Allantoin, Dl-Panthenol, PEG-40 Hydrogenated Castor Oil, PEG-6 Caprylic/Capric Glycerides, Propylene Glycol, BHT, Fragrance/Parfum, Dl-Limonene, Citric Acid, Potassium Sorbate, Sodium Benzoate, Linalool, Butylphenyl Methylpropional, PEG-120 Methyl Glucose Dioleate.",
        "n_loves": "3.2K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/irish-moor-mud-purifying-black-mask-P399601",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:31:42",
        "product_name": "Irish Moor Mud Purifying Black Mask",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL"
                ],
                "price": [
                    "$81.00"
                ],
                "sku": "Item 1706852"
            }
        ],
        "rating": "width:84.19800000000001%",
        "product_reviews": "81",
        "ingredients": " -Irish Moor Mud: Contains an unusually high concentration of purifying bio-minerals, trace elements, vitamins, amino acids, and fatty acids.\n-Hijiki Seaweed: Provides nutrition and hydration; contains high levels of calcium, iron, and vitamins B1, B2, and C.\n-Volcanic Ash and Activated Charcoal: Contains healing minerals that detoxify, revitalize, and draw out trapped impurities and toxins from clogged pores (shrinking their appearance) for cleaner, more breathable, deeply-purified skin.\nWater, Glycerin, Peat, Charcoal Powder, Polyacrylamide, Lava Powder, Sargassum Fusiforme Extract, Kaolin, Bentonite, Lactic Acid, C13-14 Isoparaffin, Isohexadecane, Sodium Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Dimethicone, Xanthan Gum, Disodium EDTA, Polysorbate 80, Laureth-7, Sorbitan Oleate, Sodium Benzoate, Potassium Sorbate, Phenoxyethanol, Mica (CI 77019.\t\t\t\t\t\n\t\t\t\t\n",
        "n_loves": "2.9K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-potent-ctm-brightening-vitamin-c-moisturizer-P505146",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:31:54",
        "product_name": "Potent-CTM Brightening Vitamin C Moisturizer",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz / 50 mL"
                ],
                "price": [
                    "$98.00"
                ],
                "sku": "Item 2678902"
            }
        ],
        "rating": "width:95.164%",
        "product_reviews": "153",
        "ingredients": "-10% THD Ascorbate Vitamin C: Brightens skin’s appearance and defies signs of aging.-3% Vitamin E and Ferulic Acid: Provide antioxidant benefits and boost the performance of vitamin C. -Antioxidant Superfood Complex: Vitamin-rich complex that maintains and enhances visible brightening results.Water/Aqua/Eau, Tetrahexyldecyl Ascorbate, Propanediol, C9-12 Alkane, Glycerin, Tocopheryl Acetate, Behenyl Alcohol, Palmitic Acid, Cetyl Palmitate, Polyglyceryl-2 Stearate, Stearic Acid, Stearyl Alcohol, Oleic Acid, Soy Acid, Ferulic Acid, Brassica Oleracea Acephala Leaf Extract, Olea Europaea (Olive) Fruit Extract, Hydrolyzed Collagen, Elastin, Zingiber Officinale (Ginger) Root Extract, Lactic Acid, Ceramide NP, Sodium Hyaluronate, Butyrospermum Parkii (Shea) Butter, Wheat Amino Acids, Glycine Soja (Soybean) Sterols, Saccharomyces Ferment, Jojoba Esters, Olus (Vegetable) Oil, Glyceryl Stearate, Gluconolactone, Calcium Gluconate, Sodium Benzoate, Sodium PCA, Sodium Stearoyl Lactylate, Myristic Acid, Sodium Hydroxide, Sodium Lactate, Lauroyl Lysine, Arachidic Acid, Lauric Acid, Potassium Sorbate, Coco-Caprylate/Caprate, Sodium Carboxymethyl Beta-Glucan, Histidine HCL, Carnosine, Polyglyceryl-6 Distearate, Arachidyl Alcohol, Cetyl Alcohol, Lignoceryl Alcohol, Xanthan Gum, Carbomer, Polyglyceryl-3 Beeswax, Ethylhexylglycerin, Disodium EDTA, Mica, Phenoxyethanol, FD&C Yellow No. 6/CI 15985, Fd&C Yellow No. 5/CI 19140.",
        "n_loves": "761",
        "categories": [
            "Skincare",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/water-drench-hyaluronic-cloud-hydra-gel-eye-patches-P423254",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:32:07",
        "product_name": "Water Drench Hyaluronic Cloud Hydra-Gel Eye Patches",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 30 pairs/ 60 patches"
                ],
                "price": [
                    "$75.00"
                ],
                "sku": "Item 1976984"
            }
        ],
        "rating": "width:80.456%",
        "product_reviews": "307",
        "ingredients": "Water/Aqua/Eau, Glycerin, Butylene Glycol, Sodium Hyaluronate, Hydrolyzed Collagen, Caffeine, Ceramide Np, Arnica Montana Flower Extract, Althaea Officinalis Root Extract, Allantoin, Tocopherol, Hydrolyzed Sodium Hyaluronate, Butyrospermum Parkii (Shea) Butter, Glycyrrhiza Glabra (Licorice) Root Extract, Scutellaria Baicalensis Root Extract, Angelica Gigas Root Extract, Cimicifuga Racemosa Root Extract, Morus Alba Bark Extract, Paeonia Lactiflora Root Extract, Phellinus Linteus Extract, Polygonum Multiflorum Root Extract, Sesamum Indicum (Sesame) Seed Extract, Sophora Angustifolia Root Extract, Aloe Barbadensis Leaf Juice, Ricinus Communis (Castor) Seed Oil, Amorphophallus Konjac Root Powder, Carrageenan, Hydroxyacetophenone, Hexylene Glycol, Propanediol, Xylitylglucoside, Sucrose, Anhydroxylitol, Glyceryl Caprylate, Xylitol, Betaine, Ethylhexylglycerin, Glucose, Lecithin, Maltodextrin, Magnesium Aspartate, Zinc Gluconate, Aluminum Hydroxide, Copper Gluconate, PEG-60 Hydrogenated Castor Oil, Gellan Gum, Cyamopsis Tetragonoloba (Guar) Gum, Ceratonia Siliqua Gum, Calcium Chloride, Tin Oxide, Synthetic Fluorphlogopite, Bis(Glycidoxyphenyl)Propane/Bisaminomethylnorbornane Copolymer, Caprylhydroxamic Acid, Disodium EDTA, 1,2-Hexanediol, Ethyl Hexanediol Chlorphenesin, Phenoxyethanol, Mica, Blue 1 (CI 42090), Titanium Dioxide (CI 77891), Iron Oxides (CI 77491).\t",
        "n_loves": "65.1K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-water-drench-r-hyaluronic-acid-hydrating-body-cream-P482547",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:32:19",
        "product_name": "Water Drench® Hyaluronic Acid Hydrating Body Cream",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 236 mL"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 2577427"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "-Hyaluronic Acid Complex 5%: Drenches skin with moisture and helps it appear supple and smooth.-Pentavitin®: Helps provide hydration for up to 72 hours, even after cleansing*.-Shea Butter, Pro Vitamin B5, and Vitamins C and E: Nourish and moisturize for silky, hydrated, and more youthful-looking skin.Water/Aqua/Eau, Cetearyl Alcohol, Glycerin, Glyceryl Stearate, Stearic Acid, Caprylic/Capric Triglyceride, Isopropyl Myristate, Sodium Hyaluronate, Ascorbic Acid, Tocopheryl Acetate, Panthenol, Butyrospermum Parkii (Shea) Butter, Saccharide Isomerate, Sodium Phytate, Sodium Hydroxide, Potassium Sorbate, Sodium Benzoate, Citric Acid, Sodium Citrate, Polysorbate 60, Dimethicone, Carbomer, PEG-100 Stearate, Cetyl Ethylhexanoate, Ethylhexylglycerin, Phenoxyethanol.",
        "n_loves": "559",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/retinol-fusion-pm-P381578",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:32:31",
        "product_name": "Retinol Fusion PM Night Serum",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "OUT OF STOCK"
                ],
                "price": [
                    "$88.00"
                ],
                "sku": "Item 1391341"
            }
        ],
        "rating": "width:87.628%",
        "product_reviews": "97",
        "ingredients": "-Microencapsulated Retinol 1.5%: Helps increase skin smoothness, reduce the appearance of fine lines and wrinkles, and enhance skin tone and texture.Cyclopentasiloxane, Squalane, Water, Retinol, Tocopheryl Acetate, Ascorbyl Palmitate, Bisabolol, Lecithin, Potassium Phosphate, Pentylene Glycol, Polysorbate-20, Alcohol.",
        "n_loves": "6.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-microdermabrasion-blackhead-acne-medication-P479647",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:32:44",
        "product_name": "Microdermabrasion Blackhead Acne Medication",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 57 mL"
                ],
                "price": [
                    "$92.00"
                ],
                "sku": "Item 2554681"
            }
        ],
        "rating": "width:92.308%",
        "product_reviews": "13",
        "ingredients": "-2% Salicylic Acid: Visibly reduces acne, blackheads, and whiteheads.-Enzymatic Exfoliant: Helps remove the look of surface impurities and excess oil that can cause acne.-Exfoliating Crystals: Visibly polish skin's surface. Medicinal Ingredient: Salicylic Acid 2%, Non-Medicinal Ingredients: Water/Aqua/Eau, Alumina, Bentonite, Kaolin, Aloe Barbadensis Leaf Juice, Propanediol, Glycerin, Maltodextrin, Citric Acid, Titanium Dioxide/CI 77891, Zinc Oxide, Phenoxyethanol, Polyacrylate Crosspolymer-6, Polysorbate 20, Papain, Potassium Sorbate, t-Butyl Alcohol, Sodium Benzoate, Triethoxycaprylylsilane, Sodium Hyaluronate, Ethylhexylglycerin.",
        "n_loves": "3.3K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-water-drench-reg-hyaluronic-cloud-makeup-removing-gel-cleanser-P472824",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:32:55",
        "product_name": "Water Drench® Hyaluronic Cloud Makeup Removing Gel Cleanser",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 2473460"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "14",
        "ingredients": "-Hyaluronic Acid: Drenches skin with a liquid cloud of moisture and improves hydration.-Amilite®: Effectively cleanses without stripping skin of moisture.-Squalane, Marshmallow Extract, and Sodium PCA: Work to soothe and visibly soften skin.Water/Aqua/Eau, Glycerin, Acrylates Copolymer, Butylene Glycol, Polysorbate 20, Potassium Cocoyl Glycinate, Cocamidopropyl Betaine, Sodium Chloride, Potassium Cocoate, Sodium PCA, Squalane, Coco-Glucoside, Glyceryl Oleate, Sodium Hydroxide, Althaea Officinalis Root Extract, Citric Acid, Sodium Phytate, Sodium Glycolate, Cocamidopropyl Dimethylamine, Sodium Hyaluronate, Sodium Benzoate, Potassium Sorbate, Propylene Glycol, Hydrolyzed Silk, Ethylhexylglycerin, Tocopherol, Hydrogenated Palm Glycerides Citrate, Lecithin, Ascorbyl Palmitate, Phenoxyethanol, Fragrance/Parfum.",
        "n_loves": "869",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-firmx-collagen-serum-P458203",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:33:08",
        "product_name": "FIRMx® Collagen Serum",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$134.00"
                ],
                "sku": "Item 2355329"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "2",
        "ingredients": " -Marine Collagen, Plant Collagen, and Hydrolyzed Collagen: Improve the look of fine lines, wrinkles, crow’s feet, and firmness.-Hydroxyproline, Peptides, Collagen Amino Acids, and Fatty Acids: Collagen-supporting ingredients that help support results.-Uplevity™ Tetrapeptide 2%: Fights the look of sagginess.Vegetable Collagen, Water/Aqua/Eau, Dimethicone, Butylene Glycol, Polysilicone-11, Glycerin, Caffeine, Squalane, Soluble Collagen, Collagen Amino Acids, Hydrolyzed Collagen, Palmitoyl Dipeptide-5 Diaminobutyroyl Hydroxythreonine, Palmitoyl Tripeptide-5, Acetyl Tetrapeptide-2, Sodium Hyaluronate, Hydroxyproline, Sodium Citrate, Citric Acid, Acrylamide/Sodium Acryloyldimethyltaurate Copolymer, Ammonium Acrylolydimethyltaurate/VP Copolymer, Hydroxystearic Acid, Magnesium Chloride, Polysorbate 20, Polysorbate 80, Sodium Hydroxide, Sorbitan Isostearate, Decyl Glucoside, Lauryl Glucoside, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Leuconostoc/Radish Root Ferment Filtrate, Disodium EDTA, Potassium Sorbate, Sodium Benzoate, Isohexadecane, Ethylhexylglycerin, Hexylene Glycol, Caprylyl Glycol, Phenoxyethanol, Mica (CI 77019).",
        "n_loves": "1.1K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-firmx-collagen-moisturizer-P458202",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:33:20",
        "product_name": "FIRMx® Collagen Moisturizer",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$119.00"
                ],
                "sku": "Item 2355311"
            }
        ],
        "rating": "width:68.75%",
        "product_reviews": "32",
        "ingredients": " -Marine Collagen, Plant Collagen, and Hydrolyzed Collagen: Improve the look of fine lines, wrinkles, crow’s feet, and firmness.-Hydroxyproline, Peptides, Collagen Amino Acids, and Fatty Acids: Collagen-supporting ingredients that help boost visible results.-Hyaluronic Acid Complex 5% and Squalane: Leave skin feeling hydrated and looking supple and plump with moisture.Vegetable Collagen, Water/Aqua/Eau, Dimethicone, Butylene Glycol, Polysilicone-11, Glycerin, Acrylamide/Sodium Acryloyldimethyltaurate Copolymer, Caffeine, Squalane, Hydrolyzed Collagen, Soluble Collagen, Collagen Amino Acids, Hydroxystearic Acid, Hydroxyproline, Palmitoyl Tripeptide-5, Palmitoyl Dipeptide-5 Diaminobutyroyl Hydroxythreonine, Sodium Hyaluronate, Phenoxyethanol, Isohexadecane, Ammonium Acrylolydimethyltaurate/VP Copolymer, Leuconostoc/Radish Root Ferment Filtrate, Sodium Citrate, Polysorbate 80, Citric Acid, Polysorbate 20, Decyl Glucoside, Sorbitan Oleate, Sodium Hydroxide, Disodium EDTA, Caprylyl Glycol, Hexylene Glycol, Potassium Sorbate, Sodium Benzoate, Ethylhexylglycerin, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Magnesium Chloride, Mica (CI 77019).",
        "n_loves": "745",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/firmx-peeling-gel-P377561",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:33:34",
        "product_name": "FIRMx™ Exfoliating Peel Gel",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$67.00"
                ],
                "sku": "Item 1500164"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2273563"
            }
        ],
        "rating": "width:90.72800000000001%",
        "product_reviews": "1.7K",
        "ingredients": " - Pineapple and Pomegranate Enzymes: Effectively peel with enzymatic exfoliation.- Cellulose: Gently smooths complexion when massaged onto skin.- Glycerin and Hyaluronic Acid: Hydrate and soothe skin.D14Water/Aqua/Eau, Peg-32, Cellulose, Butylene Glycol, Citrus Aurantium Bergamia (Bergamot) Fruit Water, Sorbitol, R-Bacillus Licheniformis Keratinase, Ananas Sativus (Pineapple) Fruit Extract, Lactobacillus/Punica Granatum Fruit Ferment Extract, Leuconostoc/Radish Root Ferment Filtrate, Sodium Hyaluronate, Glycerin, Sodium Hydroxide, Citric Acid, Tetrasodium EDTA, Algin, Carbomer, Tromethamine, Isopropyl Myristate, Sodium Chloride, Calcium Chloride, Potassium Sorbate, Sodium Benzoate, Mica, Phenoxyethanol.",
        "n_loves": "58.2K",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-anti-aging-cleansing-oil-makeup-remover-P472823",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:33:46",
        "product_name": "Anti-Aging Cleansing Oil Makeup Remover",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 2473478"
            }
        ],
        "rating": "width:56.666%",
        "product_reviews": "6",
        "ingredients": "-Salicylic Acid (BHA): Gently exfoliates to cleanse and reduces the look of enlarged pores.-Mandelic Acid (AHA): Improves the look of fine lines, wrinkles, and uneven texture.-Avocado, Soybean, Lemon, Grapefruit, and Yuzu Oils: Nourish and melt away even long-wear and waterproof makeup.C12-15 Alkyl Benzoate, C13-16 Isoparaffin, Polysorbate 80, Glycine Soja (Soybean) Oil, Persea Gratissima (Avocado) Oil, Citrus Limon (Lemon) Peel Oil, Citrus Paradisi (Grapefruit) Seed Oil, Citrus Junos Peel Oil, Mandelic Acid, Salicylic Acid, Water/Aqua/Eau, Polyglyceryl-4 Laurate/Sebacate, Polyglyceryl-4  Caprylate/Caprate, Fragrance/Parfum.",
        "n_loves": "689",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/24k-gold-mask-pure-luxury-lift-firm-mask-P397330",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:34:00",
        "product_name": "24K Gold Mask Pure Luxury Lift & Firm Mask",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$115.00"
                ],
                "sku": "Item 1686526"
            }
        ],
        "rating": "width:70.042%",
        "product_reviews": "237",
        "ingredients": "-24K Gold: Provides powerful anti-aging benefits, helps firm, lift, brighten, and calm the appearance of skin while providing an opulent glow.-Colloidal Gold: Helps lift and firm the look of skin.-Magnesium: Helps re-energize skin and minimize the look of the aging effects of stress.-Caffeine: Helps tone and condition the appearance of skin. Glycerin, Water, Sodium Hyaluronate, Caffeine, Olivine Extract, Colloidal Gold, Pentylene Glycol, Carbomer, Sodium Hydroxide, Potassium Sorbate, Sodium Benzoate, Sodium Metabisulfite, Mica, Phenoxyethanol, Gold (Ci 77480), Iron Oxides (Ci 77491), Titanium Dioxide (Ci 77891).",
        "n_loves": "2.7K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-firmx-reg-tight-toned-cellulite-treatment-P506164",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:34:15",
        "product_name": "FIRMx® Tight & Toned Cellulite Treatment",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 3.4 oz / 100 mL",
                    "NEW"
                ],
                "price": [
                    "$67.00"
                ],
                "sku": "Item 2689552"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "2",
        "ingredients": "-Flavoslim™ 1.5%: Is a citrus-derived complex that visibly diminishes cellulite.-Caffeine: Firms and invigorates skin’s appearance.-Mokaté Melon Oil: Nourishes and moisturizes skin with vitamin E and essential fatty acids.Water/Aqua/Eau, Cetearyl Alcohol, Glycerin, Butylene Glycol, Hydrogenated Farnesene, Polysorbate 20, Coco-Caprylate/Caprate, Undecane, Triheptanoin, Citrus Aurantium Bergamia (Bergamot) Fruit Extract, Caffeine, Citrullus Lanatus (Watermelon) Seed Oil, Tocopheryl Acetate, Tocopherol, Castor Oil/IPDI Copolymer, Dilinoleic Acid/Butanediol Copolymer, Maltodextrin, Tridecane, C9-12 Alkane, Carbomer, Sodium Hydroxide, Sodium Benzoate, Potassium Sorbate, FD&C Yellow No. 5/CI 19140, Fragrance/Parfum, Phenoxyethanol.",
        "n_loves": "1.1K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/firmx-r-collagen-face-eye-hydra-gel-patches-P500244",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:34:28",
        "product_name": "FIRMx® Collagen Face & Eye Hydra-Gel Patches",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 90 patches / 2 sizes"
                ],
                "price": [
                    "$88.00"
                ],
                "sku": "Item 2533339"
            }
        ],
        "rating": "width:91.16799999999999%",
        "product_reviews": "231",
        "ingredients": "-Marine Collagen, Plant Collagen, and Hydrolyzed Collagen: Help improve the look of fine lines, wrinkles, crow's feet, and firmness.-Hydroxyproline, Collagen Amino Acids, Fatty Acids, and Peptide Complex: Collagen-supporting ingredients that help boost results.-Hyaluronic Acid and Squalane: Leave skin feeling hydrated, supple, and plump with moisture.Water/Aqua/Eau, Glycerin, Vegetable Collagen, Chondrus Crispus Powder, Dipropylene Glycol, Soluble Collagen, Hydrolyzed Collagen, Hydrolyzed Hyaluronic Acid, Collagen Amino Acids, Hyaluronic Acid, Allantoin, Caffeine, Squalane, Adenosine, Niacinamide, Hydrolyzed Extensin, Hydroxystearic Acid, Dipalmitoyl Hydroxyproline, Tripeptide-1, Chondrus Crispus Extract, Leuconostoc/Radish Root Ferment Filtrate, Sodium Hyaluronate, Palmitic Acid, Hydroxypropyltrimonium Hyaluronate, Potassium Sorbate, Sodium Acetylated Hyaluronate, Dextrin, Sodium Hyaluronate Crosspolymer, Hydrolyzed Sodium Hyaluronate, Potassium Hyaluronate, Xanthan Gum, Ceratonia Siliqua (Carob) Gum, Synthetic Fluorphlogopite, Calcium Lactate, Chlorphenesin, Disodium Edta, 1,2-Hexanediol, Butylene Glycol, Titanium/Titanium Dioxide, Potassium Chloride, Ethylhexylglycerin, Titanium Dioxide/CI 77891, Mica/CI 77019, Phenoxyethanol.",
        "n_loves": "21.9K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-mini-water-drench-broad-spectrum-spf-45-hyaluronic-cloud-moisturizer-P482545",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:34:40",
        "product_name": "Mini Water Drench Broad Spectrum SPF 45 Hyaluronic Cloud Moisturizer",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: .67 oz/ 20 mL"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 2577385"
            }
        ],
        "rating": "width:76%",
        "product_reviews": "35",
        "ingredients": "-Broad-Spectrum SPF 45: Reef-safe sunscreen that protects skin from aging UVA/UVB rays.-30% Hyaluronic Acid Complex: Drenches skin with fluffy-light moisture and draws in water.-Ceramides and ProHyal+®: Reduce the look of fine lines, wrinkles, and signs of aging.Octocrylene 10%, Octisalate 5%, Homosalate 5%, Avobenzone 3%, Water/Aqua/Eau, Polymethylsilsesquioxane, Glycerin, Dipropylene Glycol, Dimethicone, Argania Spinosa Kernel Oil, Dl-Alpha Tocopheryl Acetate, Yeast Extract, Cyclopentasiloxane, Cyclohex- Asiloxane, Phenoxyethanol, Lauryl Peg-9 Polydimethylsiloxyethyl Dimethicone,Isododecane, Dimethicone/Peg-10/15 Crosspolymer, Saccharide Isomerate, Methyl Gluceth-20, Sodium Chloride, Sodium Hyaluronate, Bisabolol, Peg-15/ Lauryl Dimethicone Crosspolymer, Sodium Pca, Propylene Glycol, Ceteareth-25, Sodium Benzoate, Potassium Sorbate, Sodium Citrate, Citric Acid, Sambucus Nigra Fruit Extract, Cetyl Alcohol, Saccharomyces/Magnesium Ferment, Hydrolyzed Silk, Behenic Acid, Ceramide Np, Cholesterol, Ethylhexylglycerin, Mica (Ci 77019), Deltatocopherol, Cera- Mide Ns, Saccharomyces/Iron Ferment, Saccharomyces/Copper Ferment, Saccharomyces/Silicon Ferment, Saccharo- Myces/Zinc Ferment, Butylene Glycol,Ceramide Ap, Ceramide Eop, Ceramide Eos, Olea Europaea (Olive) Leaf Extract, Caprooyl Phytosphingosine, Caprooyl Sphingosine, Disodium Edta, Ascorbyl Palmitate.",
        "n_loves": "4.6K",
        "categories": [
            "Skincare",
            "Sunscreen",
            "Face Sunscreen"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-max-mineral-tinted-cream-broad-spectrum-spf-45-P482544",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:34:51",
        "product_name": "Max Mineral Tinted Cream Broad Spectrum SPF 45",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$52.00"
                ],
                "sku": "Item 2577369"
            }
        ],
        "rating": "width:82.308%",
        "product_reviews": "26",
        "ingredients": "-Broad Spectrum SPF 45: Zinc oxide and titanium dioxide provide mineral-based UV protection.-Safflower Extract and Vitamins C and E: Help nourish and hydrate the look of skin.-Universal Vanishing Tint and Diamond Powder: Help neutralize the look of redness and give skin a radiant finish.Titanium Dioxide 1.93%, Zinc Oxide 19.24%, Water/Aqua/Eau, Butyloctyl Salicylate, C9-12 Alkane, Carthamus Tinctorius (Safflower) Seed Oil, Dicaprylyl Carbonate, Isodecyl Neopentanoate, Cetyl Alcohol, Coco-Caprylate/Caprate, Propanediol, Ethylhexyl Olivate, Glyceryl Stearate, PEG-150 Stearate, Cetearyl Olivate, Stearyl Phosphate, Triethoxycaprylylsilane, Phenoxyethanol, Sorbitan Olivate, Oleth-3 Phosphate, Iron Oxides (CI 77492), HDI/Trimethylol Hexyllactone Crosspolymer, Alumina, Xanthan Gum, Polymethylsilsesquioxane, Polyhydroxystearic Acid, Squalane, Gluconolactone, Isopropyl Titanium Triisostearate, Sodium Phytate, Iron Oxides (CI 77491), Sodium Benzoate, Iron Oxides (CI 77499), Hydrogen Dimethicone, Potassium Sorbate, Mica, Silica, Ascorbic Acid, DL-Alpha Tocopheryl Acetate, Diamond Powder.",
        "n_loves": "2.9K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "BB & CC Cream"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/pumpkin-enzyme-mask-P401718",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:35:03",
        "product_name": "Pumpkin Enzyme Mask",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz/ 148 mL"
                ],
                "price": [
                    "$81.00"
                ],
                "sku": "Item 1663038"
            }
        ],
        "rating": "width:88.77000000000001%",
        "product_reviews": "130",
        "ingredients": "-Pumpkin Enzyme: Provides enzymatic exfoliation to help smooth skin’s surface. -Alpha Hydroxy Acid (AHA): Chemically peels to help reveal younger, radiant-looking skin. -Aluminum Oxide Crystals: Polish skin’s surface to help improve the look of uneven texture. \nWater/Aqua/Eau, Cucurbita Pepo (Pumpkin), Alumina, Glycerin, Triethanolamine, Carbomer, Lactobacillus/Pumpkin Fruit Ferment Filtrate, Sodium Lactate, Leuconostoc/Radish Root Ferment Filtrate, Potassium Sorbate, Sodium Benzoate, Sodium Hyaluronate, Chlorphenesin, Benzoic Acid, Sorbic Acid, Sodium Phytate, Ascorbic Acid, Tocopheryl Acetate, Benzyl Alcohol, Cinnamal, Phenoxyethanol, Fragrance/Parfum.\n",
        "n_loves": "6.5K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-pro-strength-niacinamide-discoloration-treatment-P455609",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:35:15",
        "product_name": "PRO Strength Niacinamide Discoloration Treatment",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$119.00"
                ],
                "sku": "Item 2324069"
            }
        ],
        "rating": "width:82.48%",
        "product_reviews": "379",
        "ingredients": " -Niacinamide: Helps reduce the look of discoloration and uneven skin tone. -Tranexamic Acid: Helps reduce the look of dark patches and post-blemish marks. -Kojic Acid: Helps enhance visible brightening benefits.  Water/Aqua/Eau, Niacinamide, Isononyl Isononanoate, Dimethyl Isosorbide, Tranexamic Acid, Dimethicone, Propanediol, Pentylene Glycol, Caprylic/Capric Triglycerides, Alpha-Arbutin, Glyceryl Stearate, C9-12 Alkane, Cetyl Alcohol, Butyrospermum Parkii (Shea) Butter, Citric Acid, Kojic Acid, Morus Alba (White Mulberry) Root Extract, Resveratrol, Scutellaria Lateriflora Extract, Hydrangea Arborescens Root Extract, Squalane, Hydrolyzed Vegetable Protein, Phenoxyethanol, Peg-100 Stearate, Tocopheryl Acetate, Polyacrylate Crosspolymer-6, Peg-75 Stearate, Ceteareth-20, Steareth-20, Silica, Ammonium Acryloyldimethyltaurate/Beheneth-25 Methacrylate Crosspolymer, Dimethiconol, Coco-Caprylate/Caprate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Titanium Dioxide, Sodium Phytate, Diethylhexyl Syringylidenemalonate, Potassium Sorbate, Sodium Benzoate, Polysorbate 60, Polysorbate 20, T-Butyl Alcohol, Caprylic/Capric Triglyceride, Caprylyl Glycol, Hexylene Glycol, Sorbitan Isostearate.",
        "n_loves": "8.6K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/aha-bha-acne-clearing-gel-P419865",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:35:28",
        "product_name": "AHA/BHA Acne Clearing Gel",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz"
                ],
                "price": [
                    "$65.00"
                ],
                "sku": "Item 1933456"
            }
        ],
        "rating": "width:85.294%",
        "product_reviews": "102",
        "ingredients": "-2% Salicylic Acid (BHA): Over-the-counter level visibly clears acne blemishes and helps prevent future breakouts.-10% Glycolic Acid Complex (AHA): Chemically exfoliates to help reduce the look of fine lines, dullness, and uneven skin tone.-Aloe Vera: Hydrates and helps calm the look of skin. Water/Aqua/Eau, Ethanol, Glycolic Acid, Sodium Hydroxide, Glycerin, L-Arginine, Hydroxyethylcellulose, Phenoxyethanol, Butylene Glycol, Cyclopentasiloxane, Sodium Nitrate, T-Butyl Alcohol, Potassium Sorbate, Sodium Benzoate, Aloe Barbadensis Leaf Juice, Retinyl Palmitate, Disodium Phosphate, Polysorbate 60, Helianthus Annuus (Sunflower) Seed Oil, Arnica Montana Flower Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Sodium Phosphate, Monobasic, Denatonium Benzoate, BHT, Glyoxal, Citric Acid.",
        "n_loves": "6.2K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/instant-firmx-tm-P381550",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:35:41",
        "product_name": "Instant FIRMx® Temporary Face Tightener",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 3.4 oz/ 100 mL"
                ],
                "price": [
                    "$67.00"
                ],
                "sku": "Item 1391408"
            }
        ],
        "rating": "width:63.684000000000005%",
        "product_reviews": "38",
        "ingredients": "-Firm-A-Tite™: A blend of silicates and seaweed that quickly, temporarily, and visibly tightens skin.-Vitamins C and E: Nourish skin and provide antioxidant benefits over time.-Provitamin B5: Moisturizes and visibly softens skin over time.Water/Aqua/Eau, Butylene Glycol, Glycerin, Sodium Silicate, Magnesium Aluminum Silicate, Sodium Magnesium Fluorosilicate, Foeniculum Vulgare (Fennel) Seed Extract, Symphytum Officinale Root Extract, Panthenol, Tocopheryl Acetate, Carrageenan, Sodium Phytate, Potassium Sorbate, Sodium Benzoate, Ascorbic Acid, Phenoxyethanol.",
        "n_loves": "3.9K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/firmx-peeling-gel-mini-P450917",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:35:53",
        "product_name": "Mini FIRMx™ Exfoliating Peel Gel",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2273563"
            }
        ],
        "rating": "width:90.72800000000001%",
        "product_reviews": "1.7K",
        "ingredients": " - Pineapple and Pomegranate Enzymes: Effectively peel with enzymatic exfoliation.- Cellulose: Gently smooths complexion when massaged onto skin.- Glycerin and Hyaluronic Acid: Hydrate and soothe skin.D14Water/Aqua/Eau, Peg-32, Cellulose, Butylene Glycol, Citrus Aurantium Bergamia (Bergamot) Fruit Water, Sorbitol, R-Bacillus Licheniformis Keratinase, Ananas Sativus (Pineapple) Fruit Extract, Lactobacillus/Punica Granatum Fruit Ferment Extract, Leuconostoc/Radish Root Ferment Filtrate, Sodium Hyaluronate, Glycerin, Sodium Hydroxide, Citric Acid, Tetrasodium EDTA, Algin, Carbomer, Tromethamine, Isopropyl Myristate, Sodium Chloride, Calcium Chloride, Potassium Sorbate, Sodium Benzoate, Mica, Phenoxyethanol.",
        "n_loves": "20.6K",
        "categories": [
            "Skincare",
            "Mini Size"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/lashes-to-die-for-turbo-conditioning-lash-enhancer-P445829",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:36:05",
        "product_name": "Lashes To Die For® Turbo Conditioning Lash Enhancer",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:40%",
        "product_reviews": "8",
        "ingredients": "-11% Peptide Complex and Biotin: Improves the look of natural lash length, thickness, density, and fullness.\n-10% Conditioning Complex: Helps to moisturize and soften the look of natural lashes.  \n-Tahitian Plankton Extract: Helps to enhance the appearance of dry, brittle lashes.\n\n Water/Aqua/Eau, Glycerin, Propylene Glycol, Myristoyl Pentapeptide-17, Myristoyl Hexapeptide-16, Biotin, Aloe Barbadensis Leaf Juice, Plankton Extract, Retinyl Palmitate, Tocopheryl Acetate, Ascorbic Acid, Sodium Hyaluronate, Panthenol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Benzoic Acid, Hydrolyzed Glycosaminoglycans, Silica, Sodium Propoxyhydroxypropyl Thiosulfate Silica, Triethanolamine, Cyclodextrin, Disodium EDTA, PEG-8 Dimethicone, Pentylene Glycol, Hexylene Glycol, 1,2-Hexanediol, Sodium Benzoate, Potassium Sorbate, Caprylyl Glycol, Octyldodecanol, Phenoxyethanol.\n",
        "n_loves": "621",
        "categories": [
            "Makeup",
            "Eye",
            "Eyebrow"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-masking-minis-5-piece-mask-kit-P502740",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:36:15",
        "product_name": "Masking Minis 5-Piece Mask Kit",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [],
                "price": [
                    "$26.00"
                ],
                "sku": "Item 2625358"
            }
        ],
        "rating": "width:74.11800000000001%",
        "product_reviews": "17",
        "ingredients": "-Hyaluronic Acid: A potent hydrator that drenches skin with moisture and draws in water.-24K Gold and Colloidal Gold: Help lift and firm the look of skin for a more youthful-looking appearance.  -2% PTR Active Purple™ Fermented Brew: A blend of potent antioxidants that help improve the look of aging.Active Purple™ Pore-Refining Antioxidant Mask:Water/Aqua/Eau, Kaolin, Glycerin, Squalane, Butyrospermum Parkii (Shea) Butter, Glyceryl Stearate SE, Cetearyl Alcohol, Stearic Acid, Hydrogenated Farnesene, Anthocyanins, Oryza Sativa (Rice) Hull Extract, Ipomoea Batatas Root Extract,  Camellia Sinensis Leaf Extract, Vaccinium Myrtillus Fruit/Leaf Extract, Glycolic Acid, Palmitic Acid, Sodium PCA, Allantoin, Aloe Barbadensis Leaf Juice, Ceramide NP, Sodium Hydroxide, Cetearyl Olivate, Sorbitan Olivate, Magnesium Stearate, Citric Acid, Linoleic Acid, Oleic Acid, Tocopherol, Triolein, Sodium Phytate, Sodium Benzoate, Potassium Sorbate, Jojoba Esters, Leuconostoc/Radish Root Ferment Filtrate, Avena Sativa (Oat) Kernel Flour, Saccharomyces Lysate, Lactobacillus Ferment Lysate, Caprylic/Capric Triglyceride, Lecithin, Phytosteryl Canola Glycerides, Caprylyl Glycol, 1,2-Hexanediol, Cetearyl Glucoside, t-Butyl Alcohol,  Hydroxyacetophenone, Titanium Dioxide/CI 77891, Manganese Violet/CI 77742, Mica/CI 77019, Polyacrylate Crosspolymer-6, Bismuth Oxychloride/CI 77163, Ultramarines/CI 77007, Phenoxyethanol, Fragrance/Parfum. Pumpkin Enzyme Mask Enzymatic Dermal Resurfacer:Water/Aqua/Eau, Cucurbita Pepo (Pumpkin), Alumina, Glycerin, Triethanolamine, Carbomer, Lactobacillus/Pumpkin Fruit Ferment Filtrate, Sodium Lactate, Leuconostoc/Radish Root Ferment Filtrate, Potassium Sorbate, Sodium Benzoate, Sodium Hyaluronate, Chlorphenesin, Benzoic Acid, Sorbic Acid, Sodium Phytate, Ascorbic Acid, Tocopheryl Acetate, Benzyl Alcohol, Cinnamal, Phenoxyethanol, Fragrance/Parfum.24K Gold Mask Pure Luxury Lift & Firm:Glycerin, Water/Aqua/Eau, Sodium Hyaluronate, Caffeine, Olivine Extract, Colloidal Gold, Pentylene Glycol, Carbomer, Sodium Hydroxide, Potassium Sorbate, Sodium Benzoate, Sodium Metabisulfite, Mica, Phenoxyethanol, Gold (CI 77480), Iron Oxides (CI 77491), Titanium Dioxide (CI 77891).Cucumber Gel Mask Extreme De-Tox™ Hydrator:Water/Aqua/Eau, Butylene Glycol, Cucumis Sativus (Cucumber) Fruit Extract, Ananas Sativus (Pineapple) Fruit Extract, Vaccinium Myrtillus Fruit/Leaf Extract, Carica Papaya (Papaya) Fruit Extract, Acer Saccharum (Sugar Maple) Extract, Saccharum Officinarum (Sugar Cane) Extract, Aloe Barbadensis Leaf Juice, Chamomilla Recutita (Matricaria) Flower Extract, Chamomilla Recutita (Matricaria) Flower Oil, Citrus Limon (Lemon) Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Mangifera Indica (Mango) Fruit Extract, Sodium PCA, Allantoin, Glycerin, Propylene Glycol, Disodium EDTA, Sodium Hydroxide, Citric Acid, Carbomer, Triethanolamine, Polysorbate 20, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol, Yellow 5 (CI 19140), Blue 1 (CI 42090).Water Drench® Hyaluronic Cloud Mask Hydrating Gel:Water/Aqua/Eau, Glycerin, Polysorbate 20, Carbomer, Propylene Glycol, Sodium Hyaluronate, Saccharide Isomerate, Sodium PCA, Sodium Hydroxide, Caffeine, Aloe Barbadensis Leaf Juice, Citric Acid, Tocopheryl Acetate, Menthol, Eucalyptus Globulus Leaf Extract, Sodium Citrate, Menthoxypropanediol, Sodium Phytate, Sodium Benzoate, Potassium Sorbate, Ethylhexylglycerin, FD&C Blue No. 1/CI 42090, Phenoxyethanol.",
        "n_loves": "25.8K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-even-smoother-trade-glycolic-retinol-resurfacing-peel-pads-P479980",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:36:28",
        "product_name": "Even Smoother™ Glycolic Retinol Resurfacing Peel Pads",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 60 pads"
                ],
                "price": [
                    "$71.00"
                ],
                "sku": "Item 2554707"
            }
        ],
        "rating": "width:86.66600000000001%",
        "product_reviews": "12",
        "ingredients": "-20% Glycolic Acid Complex & 1.5% Time-Released Retinol: Help improve the look of texture, clarity, fine lines, and wrinkles.-Allantoin and Adenosine: Help reduce the potential for dryness and soothe skin.-Hyaluronic Acid: Helps leave skin feeling healthy and balanced, not tight or dry.Water/Aqua/Eau, Glycolic Acid, Sodium Hydroxide, Butylene Glycol, Retinol, Lecithin, Sodium Hyaluronate, Allantoin, Niacinamide, Adenosine, Potassium Sorbate, Sodium Benzoate, Potassium Phosphate, Ethylhexylglycerin, Pentylene Glycol, Polysorbate 20, Alcohol, Phenoxyethanol.",
        "n_loves": "2.5K",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-instant-firmx-no-filter-primer-P504115",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:36:41",
        "product_name": "Instant FIRMx® No-Filter Primer",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL"
                ],
                "price": [
                    "$57.00"
                ],
                "sku": "Item 2653319"
            }
        ],
        "rating": "width:80.94200000000001%",
        "product_reviews": "297",
        "ingredients": "-Firm-A-Tite™: A blend of silicates and seaweed extract.-3% BarPull: Hydrates and provides long-term benefits.-Elastiflex IQ™: Helps improve the look of smoothness and elasticity over time.Water, Glycerin, Butylene Glycol, Sodium Silicate, Sodium Magnesium Fluorosilicate, Magnesium Aluminum Silicate, Sea Water, Carrageenan, Pullulan, Sodium Phytate, Xanthan Gum, Hydrolyzed Rhodophyceae Extract, Sodium Benzoate, Foeniculum Vulgare (Fennel) Seed Extract, Symphytum Officinale Root Extract, Dipeptide-2, Citric Acid, Palmitoyl Tetrapeptide-7, Boswellia Serrata Extract, Centella Asiatica Extract, Mica, Argania Spinosa Kernel Extract, Camellia Sinensis Leaf Extract, Hesperidin Methyl Chalcone, Lactobacillus Ferment Lysate, Saccharomyces Lysate, Hydrolyzed Lupine Protein, Medicago Sativa (Alfalfa) Seed Extract, Tocopheryl Acetate, Ascorbic Acid, Panthenol, Carbomer, Sodium Citrate, Chlorhexidine Digluconate, Iron Oxides, Titanium Dioxide, 1,2-Hexanediol, Caprylyl Glycol, Steareth-20, Sodium Cocoyl Glutamate, Potassium Sorbate, Hydroxyacetophenone, Phenoxyethanol.",
        "n_loves": "3.1K",
        "categories": [
            "Makeup",
            "Face",
            "Face Primer"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-firmx-collagen-eye-cream-P458205",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:36:53",
        "product_name": "FIRMx® Collagen Eye Cream",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:36%",
        "product_reviews": "5",
        "ingredients": " -Marine Collagen, Plant Collagen, and Hydrolyzed Collagen: Improve the look of fine lines, wrinkles, crow’s feet, and firmness. -Hydroxyproline, Peptides, Collagen Amino Acids, and Fatty Acids: Collagen-supporting ingredients that help boost visible results.-Eye’Fective™ 2% and Caffeine: Reduce the look of darkness and puffiness.Vegetable Collagen, Water/Aqua/Eau, Butylene Glycol, Dimethicone, Dimethicone/Peg-10/15 Crosspolymer, Glycerin, Squalane, Propanediol, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Caffeine, Hydrolyzed Collagen, Soluble Collagen, Collagen Amino Acids, Hydroxyproline, Hydroxystearic Acid, Palmitoyl Tripeptide-5, Palmitoyl Dipeptide-5 Diaminobutyroyl Hydroxythreonine, Rh-Oligopeptide-1, Hyaluronic Acid, Jasminum Sambac (Jasmine) Flower Extract, Crataegus Monogyna Flower Extract, Sodium Hyaluronate, Colloidal Oatmeal, Hydrogenated Lecithin, Tocopherol, Leuconostoc/Radish Root Ferment Filtrate, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Ammonium Acrylolydimethyltaurate/VP Copolymer, Citric Acid, Sodium Citrate, Sorbic Acid, Silanetriol, Sodium PCA, Sodium Phosphate, Polysorbate-60, Sodium Hydroxide, Sodium Benzoate, Sorbitan Isostearate, Potassium Sorbate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Magnesium Chloride, Dipropylene Glycol, Pentylene Glycol, Ethylhexylglycerin, Phenoxyethanol, Mica.",
        "n_loves": "679",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/potent-c-tm-targeted-spot-brightener-P434334",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:37:02",
        "product_name": "Potent-C™ Targeted Spot Brightener",
        "brand_name": "Peter Thomas Roth",
        "options": [],
        "rating": "width:70.66600000000001%",
        "product_reviews": "15",
        "ingredients": "Unknown Ingredients",
        "n_loves": "1.2K",
        "categories": [
            "Skincare",
            "Treatments",
            "Blemish & Acne Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-water-drench-reg-broad-spectrum-spf-45-hyaluronic-cloud-moisturizer-P472822",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:37:13",
        "product_name": "Water Drench® Broad Spectrum SPF 45 Hyaluronic Cloud Moisturizer",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$75.00"
                ],
                "sku": "Item 2450468"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: .67 oz/ 20 mL"
                ],
                "price": [
                    "$32.00"
                ],
                "sku": "Item 2577385"
            }
        ],
        "rating": "width:85.77600000000001%",
        "product_reviews": "838",
        "ingredients": "-Broad-Spectrum SPF 45: Water-resistant sunscreen that shields skin from the visible aging effects of UVA/UVB rays. - 30% Hyaluronic Acid Complex: Drenches skin with fluffy-light moisture and draws in water. - Ceramides and ProHyal+®: Reduce the look of fine lines, wrinkles, and signs of aging.Octocrylene 10%, Octisalate 5%, Homosalate 5%, Avobenzone 3%, Water/Aqua/Eau, Polymethylsilsesquioxane, Glycerin, Dipropylene Glycol, Dimethicone, Argania Spinosa Kernel Oil, Dl-Alpha Tocopheryl Acetate, Yeast Extract, Cyclopentasiloxane, Cyclohex- Asiloxane, Phenoxyethanol, Lauryl Peg-9 Polydimethylsiloxyethyl Dimethicone,Isododecane, Dimethicone/Peg-10/15 Crosspolymer, Saccharide Isomerate, Methyl Gluceth-20, Sodium Chloride, Sodium Hyaluronate, Bisabolol, Peg-15/ Lauryl Dimethicone Crosspolymer, Sodium Pca, Propylene Glycol, Ceteareth-25, Sodium Benzoate, Potassium Sorbate, Sodium Citrate, Citric Acid, Sambucus Nigra Fruit Extract, Cetyl Alcohol, Saccharomyces/Magnesium Ferment, Hydrolyzed Silk, Behenic Acid, Ceramide Np, Cholesterol, Ethylhexylglycerin, Mica (Ci 77019), Deltatocopherol, Cera- Mide Ns, Saccharomyces/Iron Ferment, Saccharomyces/Copper Ferment, Saccharomyces/Silicon Ferment, Saccharo- Myces/Zinc Ferment, Butylene Glycol,Ceramide Ap, Ceramide Eop, Ceramide Eos, Olea Europaea (Olive) Leaf Extract, Caprooyl Phytosphingosine, Caprooyl Sphingosine, Disodium Edta, Ascorbyl Palmitate.",
        "n_loves": "5.7K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peptide-21-wrinkle-resist-serum-P443344",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:37:26",
        "product_name": "Peptide 21™ Wrinkle Resist Serum",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$169.00"
                ],
                "sku": "Item 2213163"
            }
        ],
        "rating": "width:88.512%",
        "product_reviews": "571",
        "ingredients": " -73% Peptide and Neuropeptide Complex: Helps to visibly reduce the look of fine lines and wrinkles.-Asian Natto Gum: Helps improve the look of elasticity, radiance, uneven skin tone and texture.-Squalane: Helps hydrate.  Water, Glycerin, Rosa Centifolia Flower Water, Isopropyl Myristate, Squalane, Mannitol, Butylene Glycol, Natto Gum, Tripeptide-10 Citrulline, Acetyl Octapeptide-3, Palmitoyl Hexapeptide-12, Acetyl Tetrapeptide-11, Acetyl Hexapeptide-8, Acetyl Hexapeptide-1, Palmitoyl Oligopeptide, Acetyl Tetrapeptide-9, Acetyl Tetrapeptide-2, Tripeptide-1, Palmitoyl Tetrapeptide-7, Hexapeptide-11, Dipeptide Diaminobutyroyl  Benzylamide Diacetate, Palmitoyl Tripeptide-5, Trifluoroacetyl Tripeptide-2, Palmitoyl Tripeptide-1, Sodium Polyglutamate, Sodium Hyaluronate, Tocopheryl Acetate, Retinyl Palmitate, Ascorbic Acid, Hydrolyzed Soy Protein, Hydrolyzed Wheat Protein, Lecithin, Pseudoalteromonas Ferment Extract, Acrylates Copolymer, Magnesium Chloride, Polysorbate 20, Dimethyl Isosorbide, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Leuconostoc/Radish Root Ferment Filtrate, Peg-8 Dimethicone, Disodium Phosphate, Carbomer, Dextran, Sodium Lactate, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Xanthan Gum, Triethanolamine, Sodium Phosphate, , Octyldodecanol, Silica, Sodium Propoxyhydroxypropyl Thiosulfate Silica, Sodium Hydroxide, Caprylyl Glycol, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol.",
        "n_loves": "1.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/peter-thomas-roth-even-smoother-trade-glycolic-retinol-resurfacing-serum-P479979",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:37:38",
        "product_name": "Even Smoother™ Glycolic Retinol Resurfacing Serum",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL"
                ],
                "price": [
                    "$88.00"
                ],
                "sku": "Item 2554699"
            }
        ],
        "rating": "width:92.85799999999999%",
        "product_reviews": "14",
        "ingredients": "-15% Glycolic Acid Complex & 1.5% Time-Released Retinol: Help improve the look of texture, clarity, fine lines, and wrinkles.-Niacinamide: Helps diminish the look of uneven tone and discoloration.-Hyaluronic Acid and Collagen: Work to help plump the look of skin with moisture.Water/Aqua/Eau, Glycolic Acid, Propanediol, Sodium Hydroxide, Simmondsia Chinensis (Jojoba) Seed Oil, Ethylhexyl Olivate, Polyglyceryl-2 Distearate, C9-12 Alkane, Arachidyl Alcohol, Zea Mays (Corn) Starch, Glyceryl Stearate, Niacinamide, Tocopherol, Adansonia Digitata Seed Oil, Cucurbita Pepo (Pumpkin) Seed Oil, Retinol, Collagen, Adenosine, Squalane, Allantoin, Ascorbic Acid, Panthenol, Lecithin, Ceramide NP, Volcanic Soil, Pullulan, Sodium Phytate, Arachidyl Glucoside, Amylopectin, Polysorbate 20, 1,2-Hexanediol, Silica, Sodium Hyaluronate, Leuconostoc/Radish Root Ferment Filtrate, Potassium Sorbate, Sclerotium Gum, Coco-Caprylate/Caprate, Sodium Benzoate, Xanthan Gum, Lysolecithin, Pentylene Glycol, Potassium Phosphate, Ethylhexylglycerin, Behenyl Alcohol, Alcohol, Phenoxyethanol, Mica/CI 77019.",
        "n_loves": "2.4K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/anti-aging-cleansing-gel-P381613",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:37:49",
        "product_name": "Anti-Aging Cleansing Gel",
        "brand_name": "Peter Thomas Roth",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 240 mL"
                ],
                "price": [
                    "$53.00"
                ],
                "sku": "Item 1391226"
            }
        ],
        "rating": "width:87.05000000000001%",
        "product_reviews": "1.7K",
        "ingredients": " -1% Glycolic Acid (AHA): Exfoliates surface dead skin cells and stimulates cellular turnover.-1% Salicylic Acid (BHA): Helps to loosen sebum within the pores and prevents future breakouts.-Panthenol (Pro Vitamin B5): Moisturizes, nourishes, and clarifies.-Lemon, Lime, and Grapefruit Extracts: Brighten.\n\nWater, Sodium Laureth Sulfate,\nCocamidopropyl B E T A I N E , L A Uryl\nGlucoside, Propylene Glycol, Salicylic\nAcid, Glycolic Acid, Quercus Alba Bark\nExtract, Citrus Grandis (Grapefruit) Fruit\nExtract, Prunus Persica (Peach) Fruit\nExtract, Citrus Aurantifolia (Lime) Fruit\nExtract, Citrus Limon (Lemon) Fruit\nExtract, Arginine, Tilia Cordata Flower\nExtract, Allantoin, Bht, Panthenol,\nButylene Glycol, Potassium Sorbate,\nSodium Benzoate, Phenoxyethanol, Amyl\nCinnamal, Linalool, Fragrance,\nRed 40 (Ci 16035), Yellow 5 (Ci 19140).\n\n\n",
        "n_loves": "3.9K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    }
]