[
    {
        "url": "https://www.sephora.com/ca/en/product/purity-foaming-cleanser-P501582",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:38:03",
        "product_name": "Purity Foaming Cleanser",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 5 oz / 150 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$37.00"
                ],
                "sku": "Item 2619393"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "1",
        "ingredients": "-Papaya Enzymes: Unclog the appearance of pores.-Glycolic Acid: Exfoliates pores.-Witch Hazel: Visibly tightens pores.Aqua/Water/Eau, Cocamidoprpyl Detain, Decyl Glucoside, Lauryl Glucoside, Polysorbate 20, Glycerin, Sodium Chloride, Hamamelis Virginiana (Witch Hazel) Water, Glycolic Acid, Sodium Pca, Disodium Cocoyl Glutamate, 1,2-Hexanediol, Caprylyl Glycol, Alcohol, Hydroxyacetophenone, Sodium Cocoyl Glutamate, Parfum/Fragrance, Linalool, Phytic Acid, Lactobacillus Ferment, Carica Papya (Papaya) Fruit Extract, Leuconostoc/Radish Root Ferment Filtrate.",
        "n_loves": "546",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-microdelivery-resurfacing-peel-P505153",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:38:15",
        "product_name": "Microdelivery Resurfacing Peel",
        "brand_name": "philosophy",
        "options": [],
        "rating": "",
        "product_reviews": "",
        "ingredients": "-Vitamin C-Salicylic AcidThe Microdelivery Peel Step I:Peg-6, Sodium Bicarbonate, Oleth-20, Glyceryl Stearate Se, Silica, Magnesium Ascorbyl Phosphate, Tocopheryl Acetate, Retinyl Palmitate, Ethylhexyl Palmitate, Citrus Aurantium Dulcis (Orange) Oil, Tribehenin, Sorbitan Isostearate, Palmitoyl Oligopeptide, Beta-Carotene, Isopropylparaben, Isobutylparaben, Butylparaben, Methylparaben, Propylparaben.The Microdelivery Peel Step II:Water, Lactic Acid, Hydroxyethylcellulose, Linoleamidopropyl Pg-Dimonium Chloride Phosphate, Salicylic Acid, Polyquaternium-10, Propylene Glycol, Diazolidinyl Urea, Methylparaben, Propylparaben.",
        "n_loves": "228",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/purity-made-simple-hydra-bounce-eye-gel-P433606",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:38:25",
        "product_name": "Purity Made Simple Hydra-Bounce Eye Gel",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL"
                ],
                "price": [
                    "$39.00"
                ],
                "sku": "Item 2114809"
            }
        ],
        "rating": "width:70.36200000000001%",
        "product_reviews": "83",
        "ingredients": "Water, Glycerin, Caprylic/Capric Triglyceride, Butylene Glycol, Peg-240/Hdi Copolymer Bis-Decyltetradeceth-20 Ether, Limnanthes Alba (Meadowfoam) Seed Oil, Polyglyceryl-2 Diisostearate, Polysorbate 20, Butyrospermum Parkii (Shea) Butter Extract, Phenoxyethanol, Olea Europaea (Olive) Fruit Oil, Tocopheryl Acetate, Bisabolol, Cetearyl Olivate, Cyclopentasiloxane, Sorbitan Olivate, Caffeine, Panthenol, Propylene Glycol, Creatine, Dimethiconol, Salvia Hispanica Seed Oil, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Peg-8, Lecithin, Cyclohexasiloxane, Hydrogenated Lecithin, Ascorbyl Glucoside, Bht, Disodium Edta, Ginkgo Biloba Leaf Extract, Sodium Hydroxide, Tocopherol, Aesculus Hippocastanum (Horse Chestnut) Seed Extract, Glucose, Lactic Acid, Chlorphenesin, Alcohol Denat., Ascorbyl Palmitate, Pantolactone, Potassium Sorbate, Camellia Sinensis Leaf Extract, Coffea Arabica (Coffee) Seed Extract, Pongamia Pinnata Seed Extract, Sorbic Acid, Citric Acid, Ascorbic Acid, Sodium Benzoate, Angelica Archangelica Root Extract, Citrus Aurantium Amara (Bitter Orange) Peel Extract, Maltodextrin, Polyglyceryl-3 Diisostearate, Magnesium Aluminum Silicate, Xanthan Gum, Farnesol, Caprylyl Glycol, Sclerotium Gum, Fd&C Yellow No. 5 (Ci 19140).",
        "n_loves": "4.9K",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-purity-made-simple-detox-mask-P452691",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:38:37",
        "product_name": "Purity Made Simple Detox Mask",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1x 0.68 oz/ 20 mL"
                ],
                "price": [
                    "$12.00"
                ],
                "sku": "Item 2286169"
            }
        ],
        "rating": "width:73.334%",
        "product_reviews": "6",
        "ingredients": "Aqua/Water/Eau, Glycerin, Propanediol, Pentylene Glycol, Methyl Perfluorobutyl Ether, Methyl Perfluoroisobutyl Ether, Sodium Cocoamphoacetate, Cocamidopropyl Betaine, Xanthan Gum, Sodium Chloride, Phenoxyethanol, Citric Acid, Salix Alba (Willow) Bark Extract, Sodium Citrate, Coconut Acid, Parfum/Fragrance, Butylene Glycol, Linalool, Ethylhexylglycerin, Sodium Hyaluronate, Camellia Sinensis Leaf Extract.",
        "n_loves": "486",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-the-microdelivery-resurfacing-solution-P476567",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:38:49",
        "product_name": "The Microdelivery Resurfacing Solution",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$64.00"
                ],
                "sku": "Item 2522175"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "2",
        "ingredients": "-AHAs 4%: Gently exfoliate. -Vitamin C: Visibly brightens and evens skin tone. -Hyaluronic Acid: Boosts hydration. Aqua/Water/Eau, Glycerin, Glycolic Acid, Sodium Hydroxide, Lactic Acid, Citric Acid, Sodium PCA, 3-O-Ethyl Ascorbic Acid, Hydroxyacetophenone, Pullulan, Hamamelis Virginiana (Witch Hazel) Water, 1,2-Hexanediol, Caprylyl Glycol, Niacinamide, Xanthan Gum, Alcohol, Sodium Hyaluronate, Butylene Glycol, Citrus Aurantium Dulcis (Orange) Juice, Centella Asiatica Leaf Extract, Carbomer, Polysorbate 20, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7.",
        "n_loves": "354",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-biome-balance-glow-serum-P480341",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:39:01",
        "product_name": "Hope In a Jar Biome-Balance Glow Serum",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$69.00"
                ],
                "sku": "Item 2560761"
            }
        ],
        "rating": "width:91.83600000000001%",
        "product_reviews": "316",
        "ingredients": "-Hyaluronic Acid: Provides supercharged hydration.-AA2G™: A more stable and potent form of vitamin C.-Prebiotics: Help balance a healthy microbiome and give skin a natural glow. Aqua/Water/Eau, Glycerin, Bis-Peg-18 Methyl Ether Dimethyl Silane, Polysorbate 80, Xanthan Gum, 1,2-Hexanediol, Caprylyl Glycol, Alpha-Glucan Oligosaccharide, Hydroxyacetophenone, Sodium Citrate, Methylpropanediol, Propanediol, Ascorbyl Glucoside, Parfum/Fragrance, Biosaccharide Gum-1, Citric Acid, Pentylene Glycol, Ethylhexylglycerin, Tocopherol, Hyaluronic Acid, Silanetriol, Limonene.",
        "n_loves": "453",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-turbo-booster-b5-P472183",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:39:16",
        "product_name": "Turbo Booster B5",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 0.25 oz/ 7.1 g",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$50.00"
                ],
                "sku": "Item 2419042"
            }
        ],
        "rating": "",
        "product_reviews": "",
        "ingredients": "-Panthenol (Pro-vitamin B5): This humectant with soothing properties helps skin attract water and then hold onto it. Panthenol.",
        "n_loves": "113",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/purity-made-simple-P7109",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:39:29",
        "product_name": "Purity Made Simple Cleanser",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 240 mL"
                ],
                "price": [
                    "$39.00"
                ],
                "sku": "Item 2375681"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16 oz/ 472 mL"
                ],
                "price": [
                    "$59.00"
                ],
                "sku": "Item 2375699"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 22 oz/ 650 mL"
                ],
                "price": [
                    "$73.00"
                ],
                "sku": "Item 2375707"
            }
        ],
        "rating": "width:90.00999999999999%",
        "product_reviews": "12.6K",
        "ingredients": " -Meadowfoam Seed Oil: Conditions skin for a lightly hydrated, non-stripped feel.Aqua/Water/Eau, Sodium Lauroamphoacetate, Sodium Trideceth Sulfate, Limnanthes Alba (Meadowfoam) Seed Oil, Coco-Glucoside, Coconut Alcohol, Peg-120 Methyl Glucose Dioleate, Glycerin, Phenoxyethanol, Isopropyl Alcohol, Carbomer, Polysorbate 20, Chlorphenesin, Citric Acid, Disodium Phosphate, Aniba Rosaeodora (Rosewood) Wood Oil, Linalool, Ethylhexylglycerin, Xanthan Gum, Sodium Citrate, Bulnesia Sarmientoi Wood Oil, Pelargonium Graveolens Flower Oil, Sodium Hydroxide, Amyris Balsamifera Bark Oil, Cymbopogon Martini Oil, Rosa Damascena Flower Oil, Tocopherol, Daucus Carota Sativa (Carrot) Seed Oil, Mimosa Tenuiflora Bark Extract, Ormenis Multicaulis Oil, Piper Nigrum (Pepper) Fruit Extract, Salvia Sclarea (Clary) Oil, Santalum Album (Sandalwood) Oil, Fd&C Yellow No. 5 (Ci 19140).",
        "n_loves": "200.6K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-smooth-glow-multi-tasking-moisturizer-P480343",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:39:43",
        "product_name": "Hope In a Jar Smooth-Glow Multi-Tasking Moisturizer",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2560738"
            }
        ],
        "rating": "width:92.798%",
        "product_reviews": "311",
        "ingredients": "-AHA/Glycolic Acid: Gently promotes exfoliation of dead skin cells and re-texturization.-Hyaluronic Acid: Provides immediate, supercharged hydration.-Provitamin P: Revitalizes and restores skin’s rosy glow.Aqua/Water/Eau, Dimethicone, Stearic Acid, Glycerin, Butylene Glycol, Glycolic Acid, C12-15 Alkyl Benzoate, Pentylene Glycol, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Cetearyl Alcohol, Squalane, Sodium Hydroxide, Dimethicone Crosspolymer, Ceteareth-20, Boron Nitride, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Polysilicone-11, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, 1,2-Hexanediol, Caprylyl Glycol, Hydroxyacetophenone, Polysorbate 60, Parfum/Fragrance, Methylpropanediol, Sorbitan Isostearate, Citrus Reticulata (Tangerine) Peel Extract, Glucosyl Hesperidin, Limonene, Hyaluronic Acid, Silanetriol, Citric Acid, Citrus Reticulata (Tangerine) Fruit Extract, Sodium Benzoate, Potassium Sorbate.",
        "n_loves": "1.3K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/purity-made-simple-one-step-facial-cleansing-cloths-P374947",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:39:55",
        "product_name": "Purity Made Simple One-Step Facial Cleansing Cloths",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 30 Cloths"
                ],
                "price": [
                    "$22.00"
                ],
                "sku": "Item 2409183"
            }
        ],
        "rating": "width:77.678%",
        "product_reviews": "336",
        "ingredients": " -Meadowfoam Seed Oil: Conditions the skin for a non-stripped, comfortable feel.Aqua/Water/Eau, Butylene Glycol, Sodium Citrate, Gluconolactone, Cetearyl Isononanoate, Ceteareth-20, Cetearyl Alcohol, Phenoxyethanol, Sodium Benzoate, Glycerin, Glyceryl Stearate, Benzoic Acid, Ceteareth-12, Cetyl Palmitate, Ethylhexylglycerin, Parfum/Fragrance, Linalool, Calcium Gluconate, Geraniol, Sodium Hydroxide, Limnanthes Alba (Meadowfoam) Seed Oil, Tocopherol.",
        "n_loves": "19.7K",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wipes"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-eye-revival-serum-in-cream-P480342",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:40:07",
        "product_name": "Hope In a Jar Eye Revival Serum-In-Cream",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 0.5 oz/ 15 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$63.00"
                ],
                "sku": "Item 2560753"
            }
        ],
        "rating": "width:87.96799999999999%",
        "product_reviews": "256",
        "ingredients": "-Enhanced Hyaluronic Acid: Provides immediate, supercharged hydration.-Responsibly Sourced Elderberry Extract: Rich in flavonoids to target dark circles and puffiness.-Exclusive Radiance Complex: Tangerine peel extract to improve skin’s luminosity.Aqua/Water/Eau, Glycerin, Neopentyl Glycol Diheptanoate, Tribehenin Peg-20 Esters, Caprylic/Capric Triglyceride, Octyldodecyl Neopentanoate, Polyglyceryl-2 Diisostearate, Carthamus Tinctorius (Safflower) Seed Oil, Sodium Polyacrylate, Propanediol, Sodium Potassium Aluminum Silicate, Butylene Glycol, Hydroxyacetophenone, 1,2-Hexanediol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Caprylyl Glycol, Tocopheryl Acetate, Methylpropanediol, Spirulina Maxima Extract, 3-O-Ethyl Ascorbic Acid, Sambucus Nigra Flower Extract, Adenosine, Sodium Hydroxide, Citrus Reticulata (Tangerine) Peel Extract, Glucosyl Hesperidin, Hyaluronic Acid, Silanetriol, Citric Acid, Citrus Reticulata (Tangerine) Fruit Extract, Sodium Benzoate, Potassium Sorbate, Mica, Titanium Dioxide (Ci 77891).",
        "n_loves": "312",
        "categories": [
            "Skincare",
            "Eye Care",
            "Eye Creams & Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/oil-free-moisturizer-P462909",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:40:19",
        "product_name": "Purity Oil-free Mattifying Moisturizer",
        "brand_name": "philosophy",
        "options": [],
        "rating": "width:78.572%",
        "product_reviews": "14",
        "ingredients": " -Bamboo Extract: Absorbs oil to visibly mattify the skin. -Vitamin B5, C, and E: Soothe, visibly brighten, and nourish the skin. -Patented Green-Tea Antioxidant Complex: Defends the skin against external stressors and free-radical damage. Aqua/Water/Eau, Butylene Glycol, Glycerin, Bis-Peg-18 Methyl Ether Dimethyl Silane, Aluminum Starch Octenylsuccinate, Sodium Polyacrylate, Bambusa Arundinacea Stem Extract, Polysorbate 80, Phenoxyethanol, Polymethylsilsesquioxane, Tocopheryl Acetate, Panthenol, Salvia Hispanica Seed Extract, Disodium Edta, Parfum/Fragrance, Linalool, Ascorbyl Glucoside, Peg-8, Lactobacillus Ferment, Tocopherol, Sodium Hyaluronate, Lecithin, Alcohol Denat., Geraniol, Pantolactone, Bht, Ascorbyl Palmitate, Citronellol, Camellia Sinensis Leaf Extract, Coffea Arabica (Coffee) Seed Extract, Pongamia Pinnata Seed Extract, Benzyl Benzoate, Limonene, Angelica Archangelica Root Extract, Citrus Aurantium Amara (Bitter Orange) Peel Extract, Maltodextrin, Citric Acid, Magnesium Aluminum Silicate, Xanthan Gum, Ascorbic Acid, Caprylyl Glycol, Sclerotium Gum, Sorbic Acid, Fd&C Yellow No. 5 (Ci 19140), Fd&C Yellow No. 6 (Ci 15985).",
        "n_loves": "799",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/false-purity-pore-minimizing-serum-P501580",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:40:29",
        "product_name": "Purity Pore Minimizing Serum",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$52.50"
                ],
                "sku": "Item 2619385"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "2",
        "ingredients": "-Salicylic Acid: Helps prevent look of enlarged pores by repelling blackhead buildup.-Lentil Seed Extract: Supports slackened pore walls.-Lilac Extract: Promotes clarity and healthy-looking skin with antimicrobial peptides.Aqua/Water/Eau, Glycerin, Pentylene Glycol,Polysorbate 20, Hydroxyethylcellulose, Hydroxyacetophenone, Salicylic Acid, Maltodextrin, 1.2-Hexanediol, Alpha-Glucan Oligosaccharide, Caprylyl Glycol, Sodium Hydroxide, Parfum/Fragrance, Phytic Acid, Lens Esculenta (Lentil) Seed Extract, Linalool, Syringa Vulgaris (Lilac) Extract, Disodium Phosphate, Polysorbate 60, Backhousia Citriodora Leaf Extract, Geraniol, Sodium Benzoate, Citronellol, Benzyl Benzonate, Sodium Phosphate.",
        "n_loves": "507",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-microdelivery-exfoliating-daily-facial-wash-P504282",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:40:41",
        "product_name": "Microdelivery Exfoliating Daily Facial Wash",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz / 240 mL"
                ],
                "price": [
                    "$40.50"
                ],
                "sku": "Item 2657674"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 16 oz / 472 mL"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2657666"
            }
        ],
        "rating": "width:87.106%",
        "product_reviews": "304",
        "ingredients": "-Vitamin CAqua/Water/Eau, Solum Diatomeae/Diatomaceous Earth/Terre De Diatomees, Sodium Cocoyl Apple Amino Acids, Glycerin, Acrylates/Steareth-20 Methacrylate Copolymer, Acrylates Copolymer, Decyl Glucoside, Disodium Cocoamphodiacetate, Phenoxyethanol, Lauryl Glucoside, Lithium Magnesium Sodium Silicate, Polysorbate 20, Hexylene Glycol, Sodium Hydroxide, Citrus Aurantium Dulcis (Orange) Peel Extract, Limonene, Decylene Glycol, Ethylhexylglycerin, Panthenol, 1,2-Hexanediol, Tetrasodium Glutamate Diacetate, Tetrasodium Edta, Sodium Lauryl Sulfate, Ascorbyl Glucoside, Tocopherol, Helianthus Annuus (Sunflower) Seed Oil, Tocotrienols, Borago Officinalis Seed Oil, Triolein, Trilinolein.",
        "n_loves": "932",
        "categories": [
            "Skincare",
            "Cleansers",
            "Exfoliators"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/clear-days-ahead-dark-spot-correcting-serum-P449594",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:40:55",
        "product_name": "Clear Days Ahead Dark Spot Correcting Serum",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "SALE",
                "size": null,
                "name": [
                    "Size: 1 oz/ 30 mL",
                    "SALE",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$40.00",
                    "$50.00"
                ],
                "sku": "Item 2269728"
            }
        ],
        "rating": "width:50%",
        "product_reviews": "4",
        "ingredients": "Aqua/Water/Eau, Glycerin, Alcohol Denat., Niacinamide, Ascorbyl Glucoside, Cyclohexasiloxane, Zeolite, Bellis Perennis (Daisy) Flower Extract, Xanthan Gum, Styrene/Acrylates Copolymer, Phenoxyethanol, Sodium Hydroxide, Dimethicone, Sodium Polyacrylate, Bisabolol, 1,2-Hexanediol, Caprylyl Glycol, Cyclopentasiloxane, Disodium Edta, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Salicylic Acid, Parfum/Fragrance, Trideceth-6, Sargassum Muticum Extract, Palmaria Palmata Extract, Tartaric Acid, Sodium Metabisulfite, Sodium Sulfite, Peg/Ppg-18/18 Dimethicone, Sodium Lauryl Sulfate, Linalool, Limonene, Glycyrrhiza Uralensis (Licorice) Root Extract, Potassium Sorbate, Butylene Glycol, Sodium Phosphate, Carica Papaya (Papaya) Fruit Extract, Psidium Guajava Fruit Extract, Glycyrrhiza Glabra (Licorice) Rhizome/Root Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Farnesol, Saxifraga Sarmentosa Extract, Bht.",
        "n_loves": "546",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/purity-made-simple-ultra-light-moisturizer-P428413",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:41:07",
        "product_name": "Purity Made Simple Ultra-Light Moisturizer",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4.7 oz/ 141 mL"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 2028470"
            }
        ],
        "rating": "width:86.678%",
        "product_reviews": "542",
        "ingredients": "Water, Cyclopentasiloxane, Bis-PEG-18 Methyl Ether Dimethyl Silane, Glycerin, Butylene Glycol, Butyrospermum Parkii (Shea) Butter, Glyceryl Stearate, PEG-100 Stearate, Cetearyl Alcohol, Cetyl Alcohol, Limnanthes Alba (Meadowfoam) Seed Oil, Phenoxyethanol, Stearic Acid, Tocopheryl Acetate, Salvia Hispanica Seed Oil, Panthenol, Fragrance, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Linalool, BHT, Ascorbyl Glucoside, Disodium EDTA, Sodium Hydroxide, PEG-8, Tocopherol, Sodium Hyaluronate, Lecithin, Alcohol Denat., Geraniol, Polyglyceryl-3 Diisostearate, Pantolactone, Ascorbyl Palmitate, Citronellol, Camellia Sinensis Leaf Extract, Coffea Arabica (Coffee) Seed Extract, Pongamia Pinnata Seed Extract, Benzyl Benzoate, Limonene, Ascorbic Acid, Angelica Archangelica Root Extract, Citrus Aurantium Amara (Bitter Orange) Peel Extract, Maltodextrin, Citric Acid, Magnesium Aluminum Silicate, Xanthan Gum, Caprylyl Glycol, Sclerotium Gum, Sorbic Acid, FD&C Yellow No. 5 (Ci 19140), FD&C Yellow No. 6 (Ci 15985).",
        "n_loves": "15.6K",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/help-me-P4647",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:41:20",
        "product_name": "Help Me",
        "brand_name": "philosophy",
        "options": [],
        "rating": "width:87.09599999999999%",
        "product_reviews": "1.2K",
        "ingredients": " -Retinol: Delivered in a patented microsponge delivery system this purest form of vitamin A encourages skin renewal and helps promote collagen to reduce fine lines, clear congested pores, even skin tone, and smooth skin texture.-Ascorbyl Palmitate (Vitamin C): Provides antioxidant protection against environmental damage.-Tocopherol Acetate (Vitamin E): Provides antioxidant protection against environmental damage.-Bisabolol: Derived from chamomile, this natural calming agent soothes irritated skin.\n\n\n\nWater, Caprylic/Capric Triglyceride, Emulsfying Wax, Glycerin, C10-30 Cholesterol / Lanosterol Esters, Cetyl Ricinoleate, Cetyl Alcohol, Dimethicone, Benzyl Alcohol, Cyclomethicone, Retinol , Tocopherol Acetate, Ascorbyl Palmitate, Methyl Methacrylate/ Glycol Dimethacrylate Crosspolymer, Stearic Acid, Peg-10 Soy Sterol, Phenoxyethanol, Magnesium Aluminum Silicate, Methylparaben, Triethanolamine, Disodium Edta, Bisabolol, Bht, Polysorbate 20, Propyl Gallate, Ascorbic Acid.\n",
        "n_loves": "20.7K",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/oil-free-cleanser-P462908",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:41:30",
        "product_name": "Purity Oil-Free One-step Mattifying Facial Cleanser",
        "brand_name": "philosophy",
        "options": [],
        "rating": "width:92%",
        "product_reviews": "10",
        "ingredients": " -Bamboo Extract: Absorbs oil, leaving the skin with a healthy, matte appearance and a squeaky-clean feel.Aqua/Water/Eau, Sodium Lauroamphoacetate, Sodium Trideceth Sulfate, Acrylates Copolymer, Polysorbate 20, Sodium C14-16 Olefin Sulfonate, Glycerin, Lauryl Betaine, Isopropyl Alcohol, Phenoxyethanol, Peg-150 Pentaerythrityl Tetrastearate, Sodium Chloride, Peg-6 Caprylic/Capric Glycerides, Parfum/Fragrance, Sodium Hydroxide, Disodium Phosphate, Linalool, Citric Acid, Sodium Citrate, Bambusa Vulgaris Shoot Extract, Potassium Sorbate, Sodium Benzoate.",
        "n_loves": "621",
        "categories": [
            "Skincare",
            "Cleansers",
            "Face Wash & Cleansers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-hope-in-jar-hyaluronic-glow-moisturizer-P482063",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:41:40",
        "product_name": "Hope in a Jar Hyaluronic Glow Moisturizer",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2560746"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "1",
        "ingredients": "-Norwegian Glacial Water: Targets sensitivity and balances skin's PH.-Hyaluronic Acid: Provides fast, supercharged hydration and protects against water loss.-Pineapple Extract: An AHA that provides skin with gentle-yet-effective exfoliation.Aqua/Water/Eau, Glycerin, Pentylene Glycol, Caprylic/Capric Triglyceride, Pentaerythrityl Tetraethylhexanoate, Cetearyl Alcohol, 1,2-Hexanediol, Caprylyl Glycol, Dimethicone, Ammonium Acryloyldimethyltaurate/Beheneth-25 Methacrylate Crosspolymer, Butylene Glycol, Cetearyl Glucoside, Methylpropanediol, Sodium Polyacrylate Starch, Parfum/Fragrance, Ananas Sativus (Pineapple) Fruit Extract, Laureth-3, Citric Acid, Hydroxyethylcellulose, Glucosyl Hesperidin, Guar Hydroxypropyltrimonium Chloride, Acetyl Dipeptide-1 Cetyl Ester, Limonene, Hyaluronic Acid, Sodium Benzoate, Potassium Sorbate, Silanetriol, Hydrolyzed Opuntia Ficus-Indica Flower Extract, Agave Americana Leaf Extract, Fd&C Blue No. 1 (Ci 42090), D&C Red No. 33 (Ci 17200).",
        "n_loves": "270",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-the-microdelivery-dream-peel-6-aha-bha-refining-gel-P452701",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:41:52",
        "product_name": "The Microdelivery Dream Peel 6% AHA/BHA Refining Gel",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$68.00"
                ],
                "sku": "Item 2320802"
            }
        ],
        "rating": "width:84.378%",
        "product_reviews": "169",
        "ingredients": " -6% AHA/BHA-Resetting Probiotic Complex-Hibiscus Extract Aqua/Water/Eau, Glycerin, Glycolic Acid, Sodium Hydroxide, Lactic Acid, Pentylene Glycol, Tocopheryl Acetate, Xanthan Gum, Chondrus Crispus (Carrageenan) Extract, Alpha-Glucan Oligosaccharide, Cetyl Ethylhexanoate, Maltodextrin, Niacinamide, Hibiscus Sabdariffa Flower Extract, 1,2-Hexanediol, Caprylyl Glycol, Hamamelis Virginiana (Witch Hazel) Water, Cetearyl Olivate, Panthenol, Salicylic Acid, Sorbitan Olivate, Polysorbate 20, Polymnia Sonchifolia Root Juice, Sodium Magnesium Silicate, Citric Acid, Punica Granatum Seed Oil, Disodium Edta, Salvia Hispanica Seed Oil, Alcohol, Aloe Barbadensis Leaf Juice, Glucose, Butylene Glycol, Sodium Hyaluronate, Centella Asiatica Leaf Extract, Citrus Aurantium Dulcis (Orange) Peel Extract, Limonene, Chamomilla Recutita (Matricaria) Flower Extract, Magnesium Hydroxide, Vanillyl Butyl Ether, Phenoxyethanol, Lactobacillus, Lactococcus Ferment Extract, Pantolactone, Hyaluronic Acid, Silanetriol, Sodium Benzoate, Sorbic Acid, Potassium Sorbate, Polyglyceryl-3 Diisostearate, Ascorbic Acid, D&C Red No. 33 (Ci 17200), Fd&C Red No. 4 (Ci 14700).",
        "n_loves": "1.8K",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/purity-made-simple-pore-extractor-mask-P427538",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:42:04",
        "product_name": "Purity Made Simple Pore Extractor Mask",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.5 oz/ 75 mL"
                ],
                "price": [
                    "$53.00"
                ],
                "sku": "Item 2040020"
            }
        ],
        "rating": "width:92.898%",
        "product_reviews": "107",
        "ingredients": "Water, Kaolin, Solum Diatomeae/Diatomaceous Earth/Terre De Distomees, Propanediol, Bentonite, Decyl Glucoside, Alchol Denat., Lauryl Glucoside, Propylene Glycol, Polysilicone-11, Pvp, Xanthan Gum, Sailicylic Acid, Sodium Pca, Sodium Citrate, Citric Acid, Fragrance, Chlorphenesin, Linalool, Disodium Edta, Limonene, Laureth-12, Phenoxyethanol, Geraniol, Vanillyl Butyl Ether, Ethylhexylglycerin, Titanium Dioxide (Ci 77891).",
        "n_loves": "6.4K",
        "categories": [
            "Skincare",
            "Masks",
            "Face Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/dose-wisdom-tm-P506819",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:42:17",
        "product_name": "Dose of Wisdom™",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "NEW",
                "size": null,
                "name": [
                    "Size: 1 oz / 30 mL",
                    "NEW"
                ],
                "price": [
                    "$81.00"
                ],
                "sku": "Item 2703486"
            }
        ],
        "rating": "width:100%",
        "product_reviews": "3",
        "ingredients": "-Molecule-Grafted Hyaluronic Acid: Supports lasting and in-depth hydration with its natural hyaluronic acid.-Molecule-Grafted Vitamin C: Provides optimal collagen support in a stable, potent, and non-irritating form.-Patented Vitality Booster: Renews vitality and is naturally loaded with oxygen. Aqua/Water/Eau, Glycerin, Pentaerythrityl Tetraethylhexanoate, Propanediol, Alcohol Denat., Xanthan Gum, 3-O-Ethyl Ascorbic Acid, Hydroxyacetophenone, Caprylic/Capric Triglyceride, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Maltodextrin, Squalane, 1,2-Hexanediol, Caprylyl Glycol, Methylpropanediol, Sodium Citrate, Citric Acid, Parfum/Fragrance, Plantago Lanceolata Leaf Extract, Carbomer, Lactobacillus, Sodium PCA, Sodium Hydroxide, Polysorbate 60, Adenosine, Peg-8, Mica, Sorbitan Isostearate, Tocopherol, Biosaccharide Gum-1, Pentylene Glycol, Limonene, Silica, Dimethylmethoxy Chromanol, Ethylhexylglycerin, Hordeum Vulgare/Hordeum Vulgare Extract/Extrait D’orge, Hyaluronic Acid, Ganoderma Lucidum (Mushroom) Stem Extract, Silanetriol, Ascorbyl Palmitate, Agave Americana Leaf Extract, Citral, Rosmarinus Officinalis (Rosemary) Leaf Extract, Ascorbic Acid, Sodium Benzoate, Potassium Sorbate, Titanium Dioxide.",
        "n_loves": "91",
        "categories": [
            "Skincare",
            "Treatments",
            "Face Serums"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-hope-in-jar-instant-glow-peeling-mousse-P480339",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:42:29",
        "product_name": "Hope In a Jar Instant Glow Peeling Mousse",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2.5 oz/ 75 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$53.00"
                ],
                "sku": "Item 2560787"
            }
        ],
        "rating": "width:91.042%",
        "product_reviews": "192",
        "ingredients": "-Pineapple Fruit Extract: Gentle yet powerful enzymatic exfoliant.-Witch Hazel Water: Minimizes the appearance of pores and refines skin.-Cornflower Extract: Visibly reduces redness.Aqua/Water/Eau, Peg-8, Cellulose, Butylene Glycol, Glycerin, Peg-7 Glyceryl Cocoate, Hamamelis Virginiana (Witch Hazel) Water, Carbomer, Saccharide Isomerate, 1,2-Hexanediol, Caprylyl Glycol, Panthenol, Alcohol, Sodium Hydroxide, Parfum/Fragrance, Ananas Sativus (Pineapple) Fruit Extract, Propylene Glycol, Trisodium Ethylenediamine Disuccinate, Citric Acid, Methylpropanediol, Guar Hydroxypropyltrimonium Chloride, Pentylene Glycol, Sodium Citrate, Panthenyl Triacetate, Taraxacum Officinale (Dandelion) Rhizome/Root Extract, Pantolactone, Sodium Benzoate, Hydroxyethylcellulose, Hydroxypropylcellulose, Potassium Sorbate, Centaurea Cyanus Flower Extract, Hyaluronic Acid, Silanetriol, Titanium Dioxide (Ci 77891), Fd&C Blue No. 1 (Ci 42090), D&C Red No. 33 (Ci 17200).",
        "n_loves": "511",
        "categories": [
            "Skincare",
            "Treatments",
            "Facial Peels"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/philosophy-hope-in-jar-overnight-power-hydrator-P480340",
        "error": "",
        "scrape_timestamp": "08/22/2023, 07:42:41",
        "product_name": "Hope In a Jar Skin Resurrection Overnight Power Hydrator",
        "brand_name": "philosophy",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2.5 oz/ 75 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$62.00"
                ],
                "sku": "Item 2560779"
            }
        ],
        "rating": "width:92.93599999999999%",
        "product_reviews": "235",
        "ingredients": "-Myramaze Resurrection Plant: Improves skin’s ability to fight dehydration, dullness, and rough texture.-Hyaluronic Acid: Provides supercharged hydration and protects against water loss.-Mandelic Acid: Helps reduce the appearance of fine lines and rough texture.Aqua/Water/Eau, Caprylic/Capric Triglyceride, Cetyl Alcohol, Glycerin, Neopentyl Glycol Diheptanoate, Propanediol, Dimethicone, Glycolic Acid, Arachidyl Alcohol, Sodium Hydroxide, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Behenyl Alcohol, Glyceryl Stearate, Squalane, Peg-100 Stearate, 1,2-Hexanediol, Caprylyl Glycol, Dimethicone/Vinyl Dimethicone Crosspolymer, Arachidyl Glucoside, Magnesium Aluminum Silicate, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Hydroxyacetophenone, Citric Acid, Bisabolol, Mandelic Acid, Parfum/Fragrance, Xanthan Gum, Polysorbate 60, Allantoin, Sodium Pca, Phytic Acid, Sorbitan Isostearate, Myrothamnus Flabellifolia Leaf Extract, Methylpropanediol, Sodium Hyaluronate, Limonene, Evodia Rutaecarpa Fruit Extract, Ascorbic Acid, Faex/Yeast Extract/Extrait De Levure, Hydrolyzed Opuntia Ficus-Indica Flower Extract, Citral, Adenosine, Hyaluronic Acid, Silanetriol, Linalool.",
        "n_loves": "384",
        "categories": [
            "Skincare",
            "Moisturizers",
            "Moisturizers"
        ]
    }
]