[
    {
        "url": "https://www.sephora.com/ca/en/product/self-tan-classic-bronzing-lotion-P407201",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:53:32",
        "product_name": "Self Tan Classic Bronzing Lotion",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 8 oz/ 237 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 1808641"
            }
        ],
        "rating": "width:72.592%",
        "product_reviews": "27",
        "ingredients": " -100 Percent Natural DHA: Tanning agent.Water, Dihydroxyacetone, Caprylic/Capric Triglyceride, Glycerin, Caramel, Prunus Armeniaca  (Apricot) Kernel Oil, Cetearyl Alcohol, Glyceryl Stearate, PEG-100 Stearate, Sorbitan Stearate, Dimethicone, Cetyl Alcohol, Dimethyl Isosorbide, Phenoxyethanol, Ceteareth-20, Fragrance, Sclerotium Gum, Sodium Metabisulfite, Ethylhexylglycerin, Linalool, Hexyl Cinnamal, Benzyl Salicylate, Chamomilla Recutita (Matricaria) Flower Extract, Butylphenyl Methylpropional, Citronellol, Limonene, Geraniol, Hydroxycitronellal, Alpha-Isomethyl Ionone, Anise Alcohol, Coumarin, CI 14700 (Red 4), CI 19140 (Yellow 5), CI 42090 (Blue 1).",
        "n_loves": "2.2K",
        "categories": [
            "Bath & Body",
            "Self Tanners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/self-tan-express-bronzing-mousse-P407448",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:53:45",
        "product_name": "Self Tan Express Bronzing Mousse",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 1635564"
            }
        ],
        "rating": "width:82.56%",
        "product_reviews": "461",
        "ingredients": " -100 Percent Natural DHA: Tanning agent.\nWater, Dihydroxyacetone, Caramel, Propylene Glycol, Ethoxydiglycol, Glycerin, PPG-5-Ceteth-20, Decyl Glucoside, Phenoxyethanol, Melanin, Fragrance, Hydroxyethylcellulose, Dimethyl Isosorbide, Sodium Metabisulfite, Ethylhexylglycerin, Linalool, Aloe Barbadensis Leaf Juice, Alpha-isomethyl Ionone, Potassium Sorbate, Citric Acid, CI 14700 (Red 4), CI 19140 (Yellow 5), CI 42090 (Blue 1).\n",
        "n_loves": "32.6K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/self-tan-purity-bronzing-water-mousse-P429683",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:53:58",
        "product_name": "Self Tan Purity Bronzing Water Mousse",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 2059038"
            }
        ],
        "rating": "width:76.666%",
        "product_reviews": "162",
        "ingredients": " -Dihydroxyacetone   \nWater Dihydroxyacetone, Glycerin, Butylene Glycol, Decyl Glucoside, Ethoxydiglycol, Phenoxyethanol, Saccharide Isomerate, Citrus Nobilis (Mandarin Orange) Fruit Extract, Sodium Metabisulfite, Potassium Sorbate, Citric Acid, Fragrance, Linalool, Limonene, Hexyl Cinnamal, Citronellol, Hibiscus Sabdariffa Flower Extract, Sodium Citrate.\n",
        "n_loves": "9.7K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-purity-tanning-waters-mini-kit-P456204",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:54:12",
        "product_name": "Purity Tanning Waters Mini Kit",
        "brand_name": "St. Tropez",
        "options": [],
        "rating": "width:66.06%",
        "product_reviews": "33",
        "ingredients": " -100% Natural DHA: Acts as a customizable tanning agent. -Hyaluronic Acid: Hydrates skin. Self Tan Purity Bronzing Water Mousse: Aqua (Water), Dihydroxyacetone, Glycerin, Butylene Glycol, Decyl Glucoside, Ethoxydiglycol, Phenoxyethanol, Saccharide Isomerate, Citrus Nobilis (Mandarin Orange) Fruit Extract, Sodium Metabisulfite, Potassium Sorbate, Citric Acid, Parfum (Fragrance), Linalool, Limonene, Hexyl Cinnamal, Citronellol, Hibiscus Sabdariffa Flower Extract, Sodium Citrate.Self Tan Purity Bronzing Water Face Mist: Aqua (Water), Dihydroxyacetone, PEG-40 Hydrogenated Castor Oil, Phenoxyethanol, Benzyl Alcohol, Glycerin, Saccharide Isomerate, Citrus Nobilis (Mandarin Orange) Fruit Extract, Sodium Metabisulfite, Parfum (Fragrance), Panthenol, Hydrolyzed Hyaluronic Acid, Linalool, Butylene Glycol, Limonene, Hexyl Cinnamal, Citronellol, Hibiscus Sabdariffa Flower Extract, Citric Acid, Sodium Citrate, Potassium Sorbate.",
        "n_loves": "10.3K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-tan-tonic-glow-drops-P481831",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:54:21",
        "product_name": "Tan Tonic Glow Drops",
        "brand_name": "St. Tropez",
        "options": [],
        "rating": "width:92.23800000000001%",
        "product_reviews": "1.1K",
        "ingredients": "-Niacinamide: Smooths the look of fine lines, reduces the look of redness, and visibly evens skin tone.-Vitamin E and Echinacea: Help protect from environmental damage, soothe skin, and reduce the look of redness.-Dual Molecular Weight Hyaluronic Acid: Hydrates and visibly plumps skin. Aqua (Water/Eau), Dihydroxyacetone, Glycerin, PPG-5-Ceteth-20, Bellis Perennis (Daisy) Flower/Helichrysum Italicum Extract, Echinacea Purpurea Extract, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate, Xanthan Gum, Biosaccharide Gum-1, Niacinamide, Tocopherol, Malpighia Glabra (Acerola) Fruit Juice, Phenoxyethanol, Caprylyl Glycol, Sodium Metabisulfite, Parfum (Fragrance), Linalool, Caramel, Benzyl Salicylate, Coumarin, Limonene, Hexyl Cinnamal, Hydroxycitronellal, Geraniol, Potassium Sorbate, Citric Acid, Alpha-Isomethyl Ionone.",
        "n_loves": "16.7K",
        "categories": [
            "Skincare",
            "Self Tanners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/self-tan-purity-bronzing-water-face-mist-P432262",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:54:32",
        "product_name": "Self Tan Purity Bronzing Water Face Mist",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2.7 oz/ 80 mL"
                ],
                "price": [
                    "$42.00"
                ],
                "sku": "Item 2059046"
            }
        ],
        "rating": "width:77.47%",
        "product_reviews": "419",
        "ingredients": "Water, Dihydroxyacetone, PPG-5-Ceteth-20, Propylene Glycol, Glycerin, Ethoxydiglycol, Coco-Glucoside, Caramel, Phenoxyethanol, Parfum, Sodium Metabisulfite, Hydrolyzed Jojoba Esters, Hydroxyethylcellulose, Tocopherol, Decylene Glycol, Caprylyl Glycol, d-limonene, Anisyl Alcohol, Sodium Hydroxide, Linalool, Hexyl Cinnamal, Benzyl Salicylate, Butylphenyl Methylpropional, Citronellol, Hydroxycitronellal, Alpha-isomethyl Ionone, Coumarin.",
        "n_loves": "37K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Face"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-gradual-tan-tinted-daily-firming-lotion-P482318",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:54:46",
        "product_name": "Gradual Tan Tinted Daily Firming Lotion",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 2566636"
            }
        ],
        "rating": "width:51.818%",
        "product_reviews": "22",
        "ingredients": "-Dual Molecular Weight Hyaluronic Acid: Hydrates and visibly plumps skins.-Marine Algae: Supports firmer-, more youthful-looking skin over time.-Blend of Upcycled Blueberry and Raspberry Seed Oils: Is high in antioxidants and helps protect skin from environmental damage.Aqua (Water), Coco-Caprylate, Dihydroxyacetone, Caramel, Cetearyl Alcohol, Pentaerythrityl Distearate, Cetearyl Glucoside, Dimethicone, Glycerin, Ethoxydiglycol, Trimethylsiloxysilicate, Vitis Vinifera (Grape) Seed Oil, Alaria Esculenta Extract, Biosaccharide Gum-1, Rubus Idaeus (Raspberry) Seed Oil, Sodium Hyaluronate, Vaccinium Myrtillus Seed Oil, Tocopherol, Helianthus Annuus (Sunflower) Seed Oil, Caprylic/Capric Triglyceride, Capryloyl/Capryloyl Leucine Isosorbide Esters, Parfum (Fragrance), Ceteareth-20, Phenoxyethanol, Caprylyl Glycol,  Cellulose, Mica, Xanthan Gum, Isosorbide, Pentaerythrityl Tetra-Di-t-Butyl Hydroxyhydrocinnamate, Hexanediol, Hydroxyacetophenone, Benzyl Salicylate, Linalool, Coumarin, Limonene, Citronellol, CI 15985 (Yellow 6), CI 77891 (Titanium Dioxide), CI 14700 (Red 4), CI 42090 (Blue 1).",
        "n_loves": "2.1K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/self-tan-extra-dark-bronzing-mousse-P429682",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:54:58",
        "product_name": "Self Tan Extra Dark Bronzing Mousse",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 2059020"
            }
        ],
        "rating": "width:66.494%",
        "product_reviews": "154",
        "ingredients": " -DihydroxyacetoneWater, Dihydroxyacetone, Caramel, Ethoxydiglycol, Glycerin, PPG-5-Ceteth-20, Propylene Glycol, Coco-Glucoside, Dimethyl Isosorbide, Phenoxyethanol, Melanin, Fragrance, Hydrolyzed Jojoba Esters, Sodium Metabisulfite, Hydroxyethylcellulose, Citric Acid, Tocopherol, Linalool, Benzyl Salicylate, Caprylyl Glycol, Decylene Glycol, Hexyl Cinnamal, Butylphenyl Methylpropional, Citronellol, Limonene, Geraniol, Coumarin, Alpha-Isomethyl Ionone, Hydroxycitronellal, Sodium Hydroxide, CI 14700 (Red 4), CI 19140 (Yellow 5), CI 42090 (Blue 1).     \n",
        "n_loves": "7.7K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-self-tan-purity-vitamins-face-serum-P456205",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:55:10",
        "product_name": "Self Tan Purity Vitamins Face Serum",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.69 oz/ 50 mL"
                ],
                "price": [
                    "$45.00"
                ],
                "sku": "Item 2345890"
            }
        ],
        "rating": "width:84.11%",
        "product_reviews": "365",
        "ingredients": " -100% Vegan and Natural Tanning Active: Self-tanning properties.-Hyaluronic Acid: Provides up to 72 hours of hydration. -Vitamin C and D Boosters: Brightens skin, protect against environmental stressors, and mimics the effects of sunshine without harmful UV rays.  Aqua (Water/Eau), Dihydroxyacetone, Propanediol, Glycerin, PEG-40 Hydrogenated Castor Oil, Hydroxyethylcellulose, Phenoxyethanol, Betaine, Citrus Nobilis (Mandarin Orange) Fruit Extract, Sodium Metabisul te, Beta Vulgaris (Beet) Root Extract, Fructooligosaccharides, Parfum (Fragrance), Ethylhexylglycerin, Propylene Glycol Dicaprylate/Dicaprate,Prunus Persica (Peach) Flower Extract, Potassium Lactate, Terminalia Ferdinandiana Seed Oil, Linalool, Lactic Acid, Limonene, Citronellol, Hexyl Cinnamal, Hydrolyzed Hyaluronic Acid, Persea Gratissima (Avocado) Fruit Extract, Sodium Hydroxide, Sodium Benzoate, Potassium Sorbate, Citric Acid, Hibiscus Sabdariffa Flower Extract. ",
        "n_loves": "9K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Face"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/self-tan-classic-bronzing-mousse-P407450",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:55:23",
        "product_name": "Self Tan Classic Bronzing Mousse",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 118 mL"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 1809516"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 237 mL"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 1809524"
            }
        ],
        "rating": "width:85.028%",
        "product_reviews": "521",
        "ingredients": " -100 Percent Natural DHA: Tanning agent.\nWater, Dihydroxyacetone, PPG-5-Ceteth-20, Propylene Glycol, Glycerin, Ethoxydiglycol, Coco-Glucoside, Caramel, Phenoxyethanol, Parfum, Sodium Metabisulfite, Hydrolyzed Jojoba Esters, Hydroxyethylcellulose, Tocopherol, Decylene Glycol, Caprylyl Glycol, d-limonene, Anisyl Alcohol, Sodium Hydroxide, Linalool, Hexyl Cinnamal, Benzyl Salicylate, Butylphenyl Methylpropional, Citronellol, Hydroxycitronellal, Alpha-isomethyl Ionone, Coumarin, CI 14700 (Red 4), CI 19140 (Yellow 5), CI 42090 (Blue 1).\n",
        "n_loves": "29.9K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-gradual-tan-classic-daily-youth-boosting-cream-P483691",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:55:37",
        "product_name": "Gradual Tan Classic Daily Youth Boosting Cream",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.6 oz / 50 mL"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 2566651"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "4",
        "ingredients": "-Blend of Upcycled Blueberry & Raspberry Seed Oils: Is high in antioxidants and protects skin from environmental damage.-Red Bell Pepper: Offers blue light protection, shielding skin from digital pollution-induced, visible signs of aging.-Dual Molecular Weight Hyaluronic Acid: Hydrates and visibly plumps skin.Aqua (Water), Diheptyl Succinate, Shea Butter Ethyl Esters, Propanediol, Cetearyl Alcohol, Dihydroxyacetone, Pentaerythrityl Distearate, Cetearyl Glucoside, Tapioca Starch, Saccharomyces Ferment, Ethoxydiglycol, Glycerin, Capsicum Annuum Fruit Extract, Capryloyl/Capryloyl Leucine Isosorbide Esters, Sphingomonas Ferment Extract, Rubus Idaeus (Raspberry) Seed Oil, Vaccinium Myrtillus Seed Oil, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate, Tocopherol, Biosaccharide Gum-1, Ceteareth-20, Parfum (Fragrance), Phenoxyethanol, Dimethicone, Caprylyl Glycol, Coco-Caprylate/Caprate, Triheptanoin, Xanthan Gum, Capryloyl Glycerin/Sebacic Acid Copolymer, Lauroyl Lysine, Isosorbide, C9-12 Alkane, Dilinoleic Acid/Butanediol Copolymer, Pentaerythrityl Tetra-Di-t-Butyl Hydroxyhydrocinnamate, Benzyl Salicylate, Linalool, Coumarin, Limonene, Sodium Benzoate, Citric Acid, Citronellol, Sodium Salicylate, Castor Oil/IPDI Copolymer.",
        "n_loves": "2.2K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-self-tan-luxe-whipped-creme-mousse-P483492",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:55:51",
        "product_name": "Self Tan Luxe Whipped Creme Mousse",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$59.00"
                ],
                "sku": "Item 2581239"
            }
        ],
        "rating": "width:83.636%",
        "product_reviews": "11",
        "ingredients": "-Hyaluronic Acid: Hydrates skin. -Niacinamide: Visibly reduces redness and evens skin tone. -Vitamin E and Echinacea: Free radicals that soothe skin and reduce visible redness. Aqua (Water/ Eau), Dihydroxyacetone, Caprylic/capric triglyceride, C12-15 Alkyl benzoate, Caramel, Glycerin, Acetamidoethoxyethanol, Butane, PEG-12 Dimethicone, Cetearyl alcohol, Erythrulose, Glyceryl Stearate SE, PEG-40 hydrogenated castor oil, Steareth-21, Isobutane, Propane, Niacinamide, Sodium Hyaluronate, Echinacea Purpurea extract, Tocopheryl acetate, Dimethyl isosorbide, Ceteareth-25, Parfum (Fragrance), Phenoxyethanol, Decyl glucoside, Steareth-2, Coco glucoside, Ethylhexylglycerin, Sodium metabisulfite, Tetrasodium EDTA, Alpha-isomethyl ionone, Benzyl Benzoate, Benzyl Salicylate, Coumarin, Geraniol, Hexyl Cinnamal, Hydroxycitronellal, Limonene, Linalool, CI 19140 (Yellow 5), CI 16035 (Red 40), CI 42090 (Blue 1).Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "1.3K",
        "categories": [
            "Bath & Body",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-luxe-body-serum-P504785",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:56:05",
        "product_name": "Luxe Body Serum",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz / 200 mL"
                ],
                "price": [
                    "$59.00"
                ],
                "sku": "Item 2643989"
            }
        ],
        "rating": "width:95.246%",
        "product_reviews": "917",
        "ingredients": "-Hyaluronic Acid: Hydrates. -Niacinamide: Visibly reduces redness.-Collagen: Supports skin elasticity. Aqua (Water), Dihydroxyacetone, Butylene Glycol, Polysorbate 20, Trehalose, Phenoxyethanol, Hydroxyethylcellulose, Saccharide Isomerate, Panthenol, Sodium Metabisulfite, Parfum (Fragrance), Maltodextrin, Caramel, Citric Acid, Ethylhexylglycerin, Sodium Hyaluronate, Biosaccharide Gum-1, Linalool, Benzyl Salicylate, Niacinamide, Sodium Citrate, Coumarin, Limonene, Hexyl Cinnamal, Hydroxycitronellal, Geraniol, Alpha-Isomethyl Ionone, Sodium Hydroxide.",
        "n_loves": "6.4K",
        "categories": [
            "Bath & Body",
            "Body Moisturizers",
            "Body Lotions & Body Oils"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/self-tan-dark-bronzing-mousse-P407452",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:56:17",
        "product_name": "Self Tan Dark Bronzing Mousse",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 198 mL"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 1808674"
            }
        ],
        "rating": "width:78.07600000000001%",
        "product_reviews": "239",
        "ingredients": " -100 Percent Natural DHA: Tanning agent.  \nWater, Dihydroxyacetone, Ethoxydiglycol, Caramel, Propylene Glycol, Glycerin, PPG-5-Ceteth-20, Decyl Glucoside, Phenoxyethanol, Melanin, Hydroxyethylcellulose, Sodium Metabisulfite, Parfum, Ethylhexylglycerin, Aloe Barbadensis Leaf Juice,  Linalool, Hexyl Cinnamal, Benzyl Salicylate, Butylphenyl Methylpropional, Citronellol, d-limonene, Hydroxycitronellal, Alpha-isomethyl Ionone, Coumarin, Anisyl Alcohol, Potassium Sorbate, Citric Acid, CI 14700 (Red 4), CI 19140 (Yellow 5), CI 42090 (Blue 1). \n",
        "n_loves": "8.7K",
        "categories": [
            "Bath & Body",
            "Self Tanners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/tan-build-up-remover-mitt-P419466",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:56:30",
        "product_name": "Tan Build Up Remover Mitt",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 mitt"
                ],
                "price": [
                    "$12.00"
                ],
                "sku": "Item 1932763"
            }
        ],
        "rating": "width:97.77799999999999%",
        "product_reviews": "63",
        "ingredients": "Unknown Ingredients",
        "n_loves": "12.3K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-gradual-tan-watermelon-daily-firming-lotion-P481832",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:56:43",
        "product_name": "Gradual Tan Watermelon Daily Firming Lotion",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$38.00"
                ],
                "sku": "Item 2566644"
            }
        ],
        "rating": "width:86.004%",
        "product_reviews": "413",
        "ingredients": "-Dual Molecular Weight Hyaluronic Acid: Hydrates and visibly plumps skins.-Marine Algae: Provides firmer-, more youthful-looking skin over time.-Blend of Upcycled Blueberry and Raspberry Seed Oils: Is high in antioxidants to help protect skin from environmental damage.Aqua (Water), Coco-Caprylate, Dihydroxyacetone, Cetearyl Alcohol, Pentaerythrityl Distearate, Glycerin, Cetearyl Glucoside, Dimethicone, Ethoxydiglycol, Vitis Vinifera (Grape) Seed Oil, Alaria Esculenta Extract, Rubus Idaeus (Raspberry) Seed Oil, Vaccinium Myrtillus Seed Oil, Biosaccharide Gum-1, Citrullus Lanatus (Watermelon) Fruit Juice, Sodium Hyaluronate, Tocopherol, Helianthus Annuus (Sunflower) Seed Oil, Caprylic/Capric Triglyceride, Capryloyl/Capryloyl Leucine Isosorbide Esters, Ceteareth-20, Parfum (Fragrance), Phenoxyethanol, Caprylyl Glycol, Cellulose, Xanthan Gum, Isosorbide, Pentaerythrityl Tetra-Di-t-Butyl Hydroxyhydrocinnamate, Linalool, Hexanediol, Hydroxyacetophenone, Alpha-Isomethyl Ionone, Benzyl Alcohol, Sodium Benzoate, Lactic Acid, Potassium Sorbate, Citric Acid.",
        "n_loves": "6.6K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-self-tan-purity-vitamins-bronzing-water-body-mist-P456206",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:56:55",
        "product_name": "Self Tan Purity Vitamins Bronzing Water Body Mist",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 2345882"
            }
        ],
        "rating": "width:87.726%",
        "product_reviews": "409",
        "ingredients": " -100% Vegan and Natural Tanning Active: Customizable tanning agent that fades evenly. -Vitamin C and D Boosters: Brighten skin, protect against environmental stressors, and mimic the effects of sunshine without harmful UV rays. -Hyaluronic Acid: Provides up to 24 hours of hydration.  Aqua (Water/ Eau), Dihydroxyacetone, PEG-40 Hydrogenated Castor Oil, Polysorbate 20, Glycerin, Betaine, Phenoxyethanol, Parfum (Fragrance), Citrus Nobilis (Mandarin Orange) Fruit Extract, Sodium Metabisul_te, Beta Vulgaris (Beet) Root Extract, Fructooligosaccharides, Linalool, Ethylhexylglycerin, Propylene Glycol Dicaprylate/ Dicaprate, Potassium Lactate, Limonene, Citronellol, Terminalia Ferdinandiana Seed Oil, Hexyl Cinnamal, Lactic Acid, Hydrolyzed Hyaluronic Acid, Persea Gratissima (Avocado) Fruit Extract, Potassium Sorbate, Hibiscus Sabdariffa Flower Extract, Sodium Benzoate.",
        "n_loves": "11.6K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/self-tan-classic-bronzing-mist-P409602",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:57:09",
        "product_name": "Self Tan Classic Bronzing Mist",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 198 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 1808666"
            }
        ],
        "rating": "width:76.19%",
        "product_reviews": "21",
        "ingredients": "  -100% Natural DHA (Tanning Agent)\n\nDimethyl Ether, Water, Alcohol Denat., Dihydroxyacetone, Polysorbate 20, Propylene Glycol, PPG-5-Ceteth-20, Fragrance, Erythrulose, Aloe Barbadensis Leaf Juice, Sodium PCA, Citric Acid, Butylphenyl Methylpropional, Tocopheryl Acetate, Benzyl Salicylate, Linalool, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Geraniol, Citronellol, Hexyl Cinnamal, Cinnamyl Alcohol, Eugenol, Hydroxycitronellal, Alpha-Isomethyl Ionone, Phenoxyethanol, Methylparaben, Propylparaben, CI 14700, CI 19140, CI 42090.",
        "n_loves": "2.8K",
        "categories": [
            "Bath & Body",
            "Self Tanners"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-self-tan-express-starter-kit-P456203",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:57:21",
        "product_name": "Self Tan Express Starter Kit",
        "brand_name": "St. Tropez",
        "options": [],
        "rating": "width:75.2%",
        "product_reviews": "25",
        "ingredients": " -100% Natural DHA: Customizable tanning agent that fades evenly. Aqua (Water), Dihydroxyacetone, Caramel, Propylene Glycol, Ethoxydiglycol, Glycerin, PPG-5-Ceteth-20, Decyl Glucoside, Phenoxyethanol, Parfum (Fragrance), Melanin, Cetyl Hydroxyethylcellulose, Dimethyl Isosorbide, Sodium Metabisulfite, Ethylhexylglycerin, Linalool, Benzyl Salicylate, CI 14700 (Red 4), Hexyl Cinnamal, CI 19140 (Yellow 5), Citronellol, CI 42090 (Blue 1), Limonene, Aloe Barbadensis Leaf Juice, Geraniol, Coumarin, Alpha-Isomethyl Ionone, Hydroxycitronellal, Potassium Sorbate, Citric Acid. ",
        "n_loves": "8K",
        "categories": [
            "Skincare",
            "Value & Gift Sets"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-self-tan-express-bronzing-gel-P456401",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:57:33",
        "product_name": "Self Tan Express Bronzing Gel",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$56.00"
                ],
                "sku": "Item 2345908"
            }
        ],
        "rating": "width:67.5%",
        "product_reviews": "24",
        "ingredients": "  -100 Percent Natural DHA: A customizable tanning agent that fades evenly.-Hyaluronic Acid: Provides up to 72 hours of hydration. Water, Dihydroxyacetone, Butylene Glycol, Caramel, PEG-40 Hydrogenated Castor Oil, Ethoxydiglycol, Polyacrylate Crosspolymer-6, Saccharide Isomerate, Hexylene Glycol, Phenoxyethanol, Benzyl Alcohol, Parfum (Fragrance), Glycine, Melanin, Sodium Metabisulfite, Linalool, Benzyl Salicylate, Hexyl Cinnamal, Hydrolyzed Hyaluronic Acid, t-Butyl Alcohol, Citronellol, Limonene, Geraniol, Citric Acid, Sodium Citrate, Hydroxycitronellal, Leuconostoc/ Radish Root Ferment Filtrate, Alpha-Isomethyl Ionone, Anise Alcohol, Coumarin, CI 14700 (Red 4), CI 42090 (Blue 1).",
        "n_loves": "3K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/st-tropez-tanning-essentials-double-sided-luxe-tan-applicator-mitt-P456400",
        "error": "",
        "scrape_timestamp": "08/22/2023, 10:57:45",
        "product_name": "Double Sided Luxe Tan Applicator Mitt",
        "brand_name": "St. Tropez",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1 Mitt"
                ],
                "price": [
                    "$12.00"
                ],
                "sku": "Item 2345916"
            }
        ],
        "rating": "width:90.786%",
        "product_reviews": "382",
        "ingredients": "Unknown Ingredients",
        "n_loves": "28.7K",
        "categories": [
            "Skincare",
            "Self Tanners",
            "For Body"
        ]
    }
]