[
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-flourish-density-booster-P480195",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:28:22",
        "product_name": "Flourish® Density Booster for Healthy Hair Growth",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 120 mL"
                ],
                "price": [
                    "$68.00"
                ],
                "sku": "Item 2536894"
            }
        ],
        "rating": "width:89.542%",
        "product_reviews": "218",
        "ingredients": "-Alpha Keratin 60ku CLINICAL® Protein: A protein duo that encourages growth with microbiome-balancing ingredients. -Biomimetic Signal Peptides: Nourish and calm the scalp to help create a healthy environment for growth. -Larch Wood Extract: Encourages the initiation of the anagen growth phase. Aqua (Water, Eau), Keratin, Methyl Nicotinate, Acetyl Tetrapeptide-3, Zingiber Officinale (Ginger) Root Extract, Pisum Sativum (Pea) Extract, Nasturtium Officinale Extract, Moringa Oleifera Seed Extract, Jasminum Officinale (Jasmine) Flower Extract, Hydrolyzed Linseed Extract, Hydrolyzed Hibiscus Esculentus Extract, Helianthus Annuus (Sunflower) Seed Extract, Daucus Carota Sativa (Carrot) Root Extract, Cynara Scolymus (Artichoke) Leaf Extract, Amaranthus Caudatus Seed Extract, Saccharomyces Lysate Extract, Larix Europaea Wood Extract, Trifolium Pratense (Clover) Flower Extract, Camellia Sinensis Leaf Extract, Isochrysis Galbana Extract, Tocopherol, Mentha Piperita (Peppermint) Oil, Dextran, Pentylene Glycol, Sodium Phytate, Sodium Dilauramidoglutamide Lysine, Quaternium-51, Ethylhexylglycerin, Sodium Metabisulfite, Glycine, Parfum (Fragrance), Biosaccharide Gum-4, Butylene Glycol, Glycerin, Zinc Chloride, PPG-26-Buteth-26, Propanediol, Polyacrylate Crosspolymer-6, PEG-40 Hydrogenated Castor Oil, t-Butyl Alcohol, Alcohol, Tetrasodium EDTA, Sodium Benzoate, Potassium Sorbate, Disodium EDTA, Phenoxyethanol, Citric Acid, Linalool, Geraniol, Limonene, Citronellol, Benzyl Benzoate, Citral, Hexyl Cinnamal. ",
        "n_loves": "17.9K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-colorkick-de-brassing-blonde-shampoo-P476039",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:28:34",
        "product_name": "ColorKick® Debrassing Blue - Purple Shampoo",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 240 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2500221"
            }
        ],
        "rating": "width:88.75%",
        "product_reviews": "32",
        "ingredients": "-Special Blend of Chamomile, Lemon Fruit, Red Cabbage, and Purple Ginseng Extracts and Natural Salicylic Acid from Wintergreen Leaf Extract: Subtly and cumulatively brightens yellow tones and rinses away brassiness.-Turmeric Root Extract: Protects against UV damage, color distortion, pollution, and free radicals.-Viola odorata Flower/Leaf, Lavender Flower, and Rosemary Leaf Extracts: Neutralize brassiness and reduce yellowing of natural and color-treated hair.Aqua (Water, Eau), Sodium Cocoyl Isethionate, Sodium Lauroyl Methyl Isethionate, Lauryl Glucoside, Disteareth-75 IPDI, Polyglyceryl-3 Laurate, Coconut Acid, Keratin, Panthenol, Salicylic Acid, Curcuma Longa (Turmeric) Root Extract, Chamomilla Recutita (Matricaria) Flower Extract, Oryza Sativa (Rice) Bran Extract, Melia Azadirachta Flower Extract, Citrus Limon (Lemon) Peel Extract, Coccinia Indica Fruit Extract, Brassica Oleracea Capitata (Cabbage) Leaf Extract, Helianthus Annuus (Sunflower) Seed Oil, Melia Azadirachta Leaf Extract, Corallina Officinalis Extract, Madecassoside, Tocopherol, Rosmarinus Officinalis (Rosemary) Leaf Extract, Sodium Phytate, Oryza Sativa (Rice) Seed Protein, Asiaticoside, Citrus Paradisi (Grapefruit) Fruit Extract, Ocimum Sanctum Leaf Extract, Ocimum Basilicum (Basil) Flower/Leaf Extract, Solanum Melongena (Eggplant) Fruit Extract, Phytic Acid, Leuconostoc/Radish Root Ferment Filtrate, Aloe Barbadensis Flower Extract, Salvia Hispanica Seed Extract, Hydrolyzed Quinoa, Hydrolyzed Adansonia Digitata Seed Protein, Oryza Sativa (Rice) Extract, Polygonum Bistorta Root Extract, Galactoarabinan, Gluconolactone, Caprylyl/Capryl Glucoside, Camellia Sinensis Leaf Extract, Zinc Gluconate, Caesalpinia Spinosa Fruit Extract, Viola Odorata Flower/Leaf Extract, Ethyl Oleate, Sorbitan Oleate, Polyquaternium-37, Helianthus Annuus (Sunflower) Sprout Extract, Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract, Copper Gluconate, Rice Oil Glycereth-8 Esters, Glycerin, Ethylhexylglycerin, Heptyl Glucoside, Sodium Isethionate, Hydroxypropyl Methylcellulose Stearoxy Ether, Trisodium Ethylenediamine Disuccinate, Guar Hydroxypropyltrimonium Chloride, Potassium Sorbate, Propylene Glycol, Sodium Dilauramidoglutamide Lysine, Xylitol, Trehalose, Magnesium Aspartate, Butylene Glycol, Sodium Phosphate, Ethyl Linoleate, Caprylyl Glycol, Caprylic Acid, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Calcium Gluconate, Parfum (Fragrance), Phenoxyethanol, Sodium Benzoate, Benzyl Alcohol, Chlorphenesin, Citric Acid, Maltodextrin, Alcohol, Benzyl Salicylate, Hexyl Cinnamal, Linalool.",
        "n_loves": "2.4K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-create-volumizing-primer-P448743",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:28:46",
        "product_name": "Create Style-Setting Hair Volumizing Primer",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$54.00"
                ],
                "sku": "Item 2277291"
            }
        ],
        "rating": "width:65%",
        "product_reviews": "8",
        "ingredients": " -Hydrolyzed Wheat Protein: Enhances the appearance and feel of hair; it increases suppleness and facilitates styling while improving gloss/sheen and texture.-Panthenol (Vitamin B5): Delivers moisture, softness, and shine.-Hydrolyzed Soy Protein: Improves manageability, conditions and moisturizes hair, and improves its overall healthy appearance.  ",
        "n_loves": "1.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Primers"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-smooth-conditioner-P448732",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:28:58",
        "product_name": "Smooth Conditioner for Coarse & Textured Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2277150"
            }
        ],
        "rating": "width:93.88799999999999%",
        "product_reviews": "108",
        "ingredients": " -Pink Pomelo: A nutrient-rich citrus fruit full of vitamin A, C, and B1 and zinc that gives hair a shot of vitality. -Phospholipids: Help fight frizz and protect against humidity. -Gotu Kola: A multitasking Indian herb that promotes strength, smoothness, and luster.",
        "n_loves": "2.8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-refresh-purifying-leave-in-conditioner-P448736",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:29:09",
        "product_name": "Detangling Heat Protectant Purifying Leave-In Conditioner",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 5 oz/ 150 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$44.00"
                ],
                "sku": "Item 2277192"
            }
        ],
        "rating": "width:81.42799999999998%",
        "product_reviews": "14",
        "ingredients": " -Amino Acid Blend: Helps nurture the hair. -Benzophenone-4: A light stabilizer that helps to minimize the impact of UV light on hair.-White Horehound Extract: Has a detoxifying effect on hair and helps to neutralize the negative effects of pollutants.  ",
        "n_loves": "3.4K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Leave-In Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/colorkick-r-color-illuminating-hydrating-mask-for-all-hair-shades-P507511",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:29:20",
        "product_name": "COLORKICK® Color-Illuminating & Hydrating Mask for All Hair Shades",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "OUT OF STOCK",
                "size": null,
                "name": [
                    "Size: 5 oz / 150 ml",
                    "OUT OF STOCK",
                    "NEW"
                ],
                "price": [
                    "$96.00"
                ],
                "sku": "Item 2688539"
            }
        ],
        "rating": "",
        "product_reviews": "",
        "ingredients": "-Alpha Keratin 60ku®: Virtue's proprietary protein that strengthens and repairs hair from the inside out.-Specialty Rice Protein, Sunflower Sprout Extract, and Tara Tree Fruit Extract: Protect from the damaging, color fading, and distorting effects of UV rays.-Shea Butter, Moringa Seed Oil, Jojoba, and Sunflower Seed Wax: Restores hydration, adds vibrant shine, and maximizes tonality.Aqua (Water, Eau), Cetearyl Alcohol, Behentrimonium Chloride, Isoamyl Laurate, Cetyl Alcohol, Brassicamidopropyl Dimethylamine, Brassica Alcohol, Dimethicone, Cetyl Esters, Squalane, Glycerin, Glyceryl Ricinoleate, Ceteareth-20, Ethylhexylglycerin, Keratin, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Curcuma Longa (Turmeric) Root Extract, Corallina Officinalis Extract, Panthenol, Coccinia Indica Fruit Extract, Solanum Melongena (Eggplant) Fruit Extract, Viola Odorata Flower/Leaf/Stem Extract, Aloe Barbadensis Flower Extract, Phospholipids, Hydrolyzed Verbascum Thapsus Flower, Brassica Oleracea Capitata (Cabbage) Leaf Extract, Polygonum Bistorta Root Extract, Hydrolyzed Rice Protein, Salvia Hispanica Seed Extract, Tocopherol, Spathodea Campanulata Flower, Copper Gluconate, Hydrolyzed Quinoa, Hydrolyzed Adansonia Digitata Seed Extract, Camellia Sinensis Leaf Extract, Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract, Caesalpinia Spinosa Fruit Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Ocimum Sanctum Leaf Extract, Ocimum Basilicum (Basil) Flower/Leaf Extract, Opuntia Ficus-Indica Seed Oil, Moringa Oleifera Seed Oil, Quercus Petraea Fruit Extract, Hydrogenated Ethylhexyl Olivate, Butyrospermum (Shea) Butter, Oryza Sativa (Rice) Bran Extract, Tocopheryl Acetate, Hydrogenated Olive Oil Unsaponifiables, Magnesium Aspartate, Ricinus Communis (Castor) Seed Oil, Jojoba Esters, Helianthus Annuus (Sunflower) Seed Extract, Helianthus Annuus (Sunflower) Seed Oil,  Sodium Phytate, Propanediol, Caprylyl/Caprylyl Glucoside, Betaine, Trideceth-12, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Caprylic Acid, Maltodextrin, Caprylyl Glycol, Parfum (Fragrance), Amodimethicone, Hydroxyethylcellulose, Laureth-9, C11-15 Alketh-7, Quaternium-95, Sodium Dilauramidoglutamide Lysine, Sodium Carrageenan, Xylitol, Trehalose, Galactoarabinan, Sodium Phosphate, Polysorbate 60, Disodium Phosphate, Ethyl Linoleate, Ethyl Oleate, Sorbitan Oleate, Polyquaternium-37, Trisiloxane, Disiloxane, Zinc Gluconate, Sorbic Acid, Phenoxyethanol, Benzyl Alcohol, Chlorphenesin, Potassium Sorbate, Citric Acid, Acetic Acid, Sodium Benzoate, Benzyl Salicylate, Linalool.",
        "n_loves": "37",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-the-perfect-ending-split-end-serum-P448738",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:29:33",
        "product_name": "Strengthening Split End Hair Repair Serum Treatment",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2277218"
            }
        ],
        "rating": "width:81.28999999999999%",
        "product_reviews": "93",
        "ingredients": " -Pea Protein: Packed with phytonutrients, it helps protect hair from daily styling and thermal heat damage. -Hydrolyzed Quinoa: Plant-based protein that enhances color, hydrates, and adds shine. -Baobab Seed Oil: From the African Tree of Life (known for its ability to store water), this rich, silky oil is an intense emollient for.",
        "n_loves": "5.2K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-restorative-treatment-mask-P448169",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:29:44",
        "product_name": "Restorative, Hydrating Treatment Hair Mask with Keratin",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 5 oz/ 148 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$96.00"
                ],
                "sku": "Item 2277226"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$46.00"
                ],
                "sku": "Item 2277234"
            }
        ],
        "rating": "width:88.612%",
        "product_reviews": "209",
        "ingredients": "-Cystoseira Compressa Extract (Brown Algae): This marine active helps provide intensive repair and helps provide heat protection. -Amaranthus Caudatus Seed Extract: Helps enhance color, add moisture retention, and shine; rich in flavonoids and polyphenols.-Baobab Seed Oil: From the African Tree of Life (known for its ability to store water), this rich, silky oil acts as an intense emollient for dry, damaged hair. Aqua (Water, Eau), Cetearyl Alcohol, Behentrimonium Chloride, Dimethicone, PEG-100 Stearate, Glyceryl Stearate, PEG-8 Dimethicone, Cetyl Alcohol, Stearamidopropyl Dimethylamine, Isododecane, Cetyl Esters, Hydrogenated Ethylhexyl Olivate, Parfum (Fragrance), Ethylhexylglycerin, Alpha Keratin, Panthenol, Helianthus Annuus (Sunflower) Seed Oil, Moringa Oleifera Seed Oil, Madecassoside, Amaranthus Caudatus Seed Extract, Tocopherol, Rosmarinus Officinalis (Rosemary) Leaf Extract, Zea Mays (Corn) Starch, Quercus Petraea Fruit Extract, Hydrolyzed Adansonia Digitata Seed Oil, Hydrogenated Olive Oil Unsaponifiables, Oryza Sativa (Rice) Bran Extract, Cystine Bis-PG-Propyl Silanetriol, Cynara Scolymus (Artichoke) Leaf Extract, Citrus Paradisi (Grapefruit) Fruit Extract, Asiaticoside, Hydrolyzed Quinoa, Cystoseira Compressa Extract, Tocopheryl Acetate, Pisum Sativum (Pea) Extract, Hydrolyzed Linseed Extract, Hydrolyzed Pea Protein PG-Propyl Silanetriol, Glycerin, Butyrospermum Parkii (Shea) Butter, Propanediol, Caprylyl Glycol, Isopropyl Alcohol, Polysorbate 60, Dimethiconol, Hydroxyethylcellulose, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Jojoba Esters, Sodium Dilauramidoglutamide Lysine, Polysorbate 20, Sorbic Acid, Polysilicone-15, Butylene Glycol, Phenoxyethanol, Benzyl Alcohol, Chlorphenesin, Benzoic Acid, Citric Acid, Disodium EDTA, BHT, Sodium Nitrate, Alcohol, Glyoxal, Gluconolactone, Sodium Chloride, Sodium Benzoate, Potassium Sorbate, Phenethyl Alcohol, Calcium Gluconate, Dehydroacetic Acid, Hexyl Cinnamal, Linalool, Coumarin, Benzyl Salicylate, Butylphenyl Methylpropional, Limonene.",
        "n_loves": "11.3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-correct-polish-un-frizz-cream-P448864",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:29:57",
        "product_name": "Correct Un-Frizz Hair Styling & Smoothing Cream",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 120 mL"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2286243"
            }
        ],
        "rating": "width:93.062%",
        "product_reviews": "98",
        "ingredients": "-Pink Pomelo: Provides nutrients like vitamin A, C, B1, and zinc. -Phospholipids: Help fight frizz and protect against humidity.-Gotu Kola: Supports hair strength, smoothness, and luster. Aqua (Water), Dimethicone, Propanediol, Butylene Glycol Dicaprylate/Dicaprate, Isononyl Isononanoate, Cyclopentasiloxane, Behenyl Alcohol, Cetearyl Alcohol, Glycine Soja (Soybean) Oil, Sodium Acrylates Copolymer, Stearic Acid, Alpha Keratin, Phospholipids, Citrus Paradisi (Grapefruit) Fruit Extract, Madecassoside, Asiaticoside, Polysorbate 60, Lecithin, Parfum (Fragrance), Glycerin, Ethylhexylglycerin, Phenoxyethanol, Disodium EDTA, Citric Acid, Linalool, Limonene, Coumarin, Benzyl Salicylate.",
        "n_loves": "5.2K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-recovery-conditioner-P448734",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:30:09",
        "product_name": "Hydrating Recovery Conditioner for Dry, Damaged & Colored Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2277176"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 17 oz/ 500 mL"
                ],
                "price": [
                    "$124.00"
                ],
                "sku": "Item 2344489"
            },
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$23.50"
                ],
                "sku": "Item 2329811"
            }
        ],
        "rating": "width:92.85799999999999%",
        "product_reviews": "378",
        "ingredients": " -Hydrolyzed Quinoa: This plant-based protein that enhances color, helps moisture retention, and adds shine. -Baobab Seed Oil: From the African Tree of Life (known for its ability to store water), this rich, silky oil helps act as an intense emollient for dry, damaged hair.  -Grapefruit Extract: Loaded with vitamin C and antioxidants, this refreshing fruit helps revitalize the scalp and returns hair’s vibrance and shine.",
        "n_loves": "8.2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-flourish-brow-density-booster-serum-P506265",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:30:23",
        "product_name": "Flourish® Brow Density Booster Serum",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 0.14 oz / 4 ml"
                ],
                "price": [
                    "$108.00"
                ],
                "sku": "Item 2638351"
            }
        ],
        "rating": "width:95.38399999999999%",
        "product_reviews": "65",
        "ingredients": "-Alpha Keratin 60ku CLINICAL®: Anchors the brow, supports new growth, and thickens and enhances.-Specialty Tetrapeptide Blend and Red Clover Flower Extract: Reactivates follicles to fill in uneven patches and enhance fullness.-Natural Microalgae Extract: Prevents brow loss, improves volume, and makes brows stronger.Aqua (Water, Eau), Glycerin, Propanediol, Pentylene Glycol, Butylene Glycol, Coco-Caprylate/Caprate, Acrylates Copolymer, Isopropyl Palmitate, Squalane, Keratin, Biotin, Panthenol, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Larix Europaea Wood Extract, Zingiber Officinale (Ginger) Root Extract, Pisum Sativum (Pea) Sprout Extract, Tocopherol, Isochrysis Galbana Extract, Mentha Piperita (Peppermint) Oil, Lactobacillus Ferment, Camellia Sinensis Leaf Extract, Menthyl Lactate, Saccharomyces Lysate Extract, Sodium Dilauramidoglutamide Lysine, Ethylhexylglycerin, Acacia Senegal Gum Extract, Xanthan Gum, Caprylyl Glycol, Polyquaternium-73, Bisabolol, Isomalt, Glycine, Sodium Metabisulfite, Dextran, Zinc Chloride, Hexylene Glycol, Phenoxyethanol, Sodium Hydroxide, Sodium Benzoate.Clean at Sephora products are formulated without the following banned or restricted ingredients (please see Clean at Sephora landing page for full list of specific restrictions and allowances by category—this is not an exhaustive list): Acrylates, Aluminum Salts, Animal Musks/Fats/Oils, Benzophenones and related compounds, Butoxyethanol, Butylated hydroxyanisole (BHA), Butylated hydroxytoluene (BHT) under 0.1%, Carbon Black or Black 2, Coal Tar, Ethanolamines, Formaldehyde and Formaldehyde Releasing Agents, Hydroquinone, Lead and Lead Acetate, Mercury + Mercury Compounds (Thimerisol), Methoxyethanol, Methyl Cellosolve, Methylchloroisothiazolinone and Methylisothiazolinone, Mineral Oil, Nanomaterials (restrictions for specific nanomaterials only), Oxybenzone, Parabens, Petrolatum and Paraffin (USP grade only), Phenoxyethanol under 1%, Phthalates, Plastic Microbeads, Polyacrylamide & Acrylamide, Resorcinol, Retinyl Palmitate, Styrene, Sulfates, Talc (no detection of asbestos), Toluene, Triclosan and Triclocarban, Undisclosed Synthetic Fragrance (under 1% and formulated without Acetaldehyde, Acetone, Acetonitrile, Benzalkonium chloride, BPA, EDTA, Methylene chloride, PTFE, PFOA), 1,4-Dioxane (ingredients must comply with impurity thresholds), Octinoxate, PFAS compounds, Nitromusks and Polycyclic Musks, Ethoxylated Ingredients (including PEGS or polyethylene glycol must meet contamination limits for 1,4-Dioxane and ethylene oxide), Cyclic Silicones, EDTA and derivatives (allowed if no technical substitute under 0.2%).",
        "n_loves": "2.1K",
        "categories": [
            "Makeup",
            "Eye",
            "Eyebrow"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-full-shampoo-P448729",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:30:35",
        "product_name": "Volumizing Full Shampoo for Fine Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 240 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2277127"
            }
        ],
        "rating": "width:90.98%",
        "product_reviews": "286",
        "ingredients": "-Phospholipids: Help fight frizz and protects against humidity.Aqua (Water, Eau), Sodium Cocoyl Isethionate, Sodium Lauroyl Methyl Isethionate, Cocamidopropyl Betaine, Glycerin, Sodium Methyl Cocoyl Taurate, Cocamide Mipa, Alpha Keratin, Panthenol, Centella Asiatica Meristem Cell Culture, Hydrolyzed Adansonia Digitata Seed Oil, Palmitamidopropyltrimonium Chloride, Coconut Acid, Peg-200 Hydrogenated Glyceryl Palmate, Sodium Chloride, Guar Hydroxypropyltrimonium Chloride, Polyquaternium-7, Peg-7 Glyceryl Cocoate, Ethylhexylglycerin, Sodium Dilauramidoglutamide Lysine, Xanthan Gum, Parfum (Fragrance), Propanediol, Phenoxyethanol, Chlorphenesin, Disodium Edta, Citric Acid, Sodium Benzoate, Benzyl Alcohol, Potassium Sorbate, Sodium Hydroxide.",
        "n_loves": "9.3K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-smooth-shampoo-P448731",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:30:49",
        "product_name": "Smooth Shampoo for Coarse & Textured Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 240 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2277143"
            }
        ],
        "rating": "width:95.96199999999999%",
        "product_reviews": "104",
        "ingredients": " -Pink Pomelo: A nutrient-rich citrus fruit full of vitamin A, C, and B1 and zinc that gives hair a shot of vitality. -Phospholipids: Help fight frizz and protect against humidity. -Gotu Kola: A multitasking Indian herb that promotes strength, smoothness, and luster.",
        "n_loves": "3.3K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-recovery-shampoo-P448733",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:31:02",
        "product_name": "Hydrating Recovery Shampoo for Dry, Damaged & Colored Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 240 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2277168"
            },
            {
                "swatch_group": "Value size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 17 oz/ 500 mL"
                ],
                "price": [
                    "$106.00"
                ],
                "sku": "Item 2344471"
            }
        ],
        "rating": "width:89.74399999999999%",
        "product_reviews": "351",
        "ingredients": " -Hydrolyzed Quinoa: This plant-based protein that enhances color, helps moisture retention, and adds shine. - Baobab Seed Oil: From the African Tree of Life (known for its ability to store water), this rich, silky oil helps act as an intense emollient for dry, damaged hair.  - Grapefruit Extract: Loaded with vitamin C and antioxidants, this refreshing fruit helps revitalize the scalp and returns hair’s vibrance and shine.",
        "n_loves": "9.6K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/flourish-thickening-hydrating-mask-for-thinning-hair-P502035",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:31:16",
        "product_name": "Flourish® Thickening & Hydrating Mask for Thinning Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5 oz / 150 mL"
                ],
                "price": [
                    "$94.50"
                ],
                "sku": "Item 2593390"
            }
        ],
        "rating": "width:96.132%",
        "product_reviews": "212",
        "ingredients": "-Alpha Keratin 60KU CLINICAL® Protein: A protein duo that encourages growth and strengthens strands.-Fructooligosaccharides and Beet Root Extract: Infuse hydration into hair without weighing it down.-Biomimetic Tetrapeptide with Red Clover Flower Extract: Targets the follicle to promote healthier hair growth.Aqua (Water, Eau), Cetearyl Alcohol, Brassicamidopropyl Dimethylamine, Dimethicone, Cetyl Esters, Cetyl Alcohol, Behentrimonium Chloride, Isododecane, Glycerin, Ceteareth-20, Hydrogenated Ethylhexyl Olivate, Keratin, Trifolium Pratense (Clover) Flower Extract, Larix Europaea Wood Extract, Panthenol, Tocopherol, Biotin, Niacinamide, Quercus Petraea Fruit Extract, Salvia Hispanica Seed Extract, Hydrolyzed Adansonia Digitata Seed Extract, Sodium Ascorbyl Phosphate, Oryza Sativa (Rice) Seed Protein, Acetyl Tetrapeptide-3, Caesalpinia Spinosa Fruit Extract, Sphinganine, Caffeine, Helianthus Annuus (Sunflower) Extract, Coffea Robusta Seed Extract, Tocopheryl Acetate, Oryza Sativa (Rice) Bran Extract, Gaultheria Procumbens (Wintergreen) Leaf Extract, Oryza Sativa (Rice) Extract, Coco-Caprylate/Caprate, Butyrospermum Parkii (Shea) Butter, Camellia Sinensis Leaf Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Triheptanoin, Sodium Starch Octenylsuccinate, Beta Vulgaris (Beet) Root Extract, Dextran, Calcium Pantothenate, Sodium PCA, Xylitol, Trehalose, Sodium Lactate, Galactoarabinan, Castor Oil/IPDI Copolymer, Arginine, Jojoba Esters, Caprylyl/Capryl Glucoside, Aspartic Acid, PCA, Fructooligosaccharides, Amodimethicone, Hydrogenated Olive Oil Unsaponifiables, Propanediol, Caprylyl Glycol, Ethylhexylglycerin, Fragrance (Parfum), Polysorbate 60, Gluconolactone, Alanine, Serine, Valine, Threonine, Proline, Isoleucine, Caprylic Acid, Helianthus Annuus (Sunflower) Sprout Extract, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Zinc Chloride, Phenylalanine, Histidine, Butylene Glycol, Dilinoleic Acid/Butanediol Copolymer, Lactic Acid, Sodium Dilauramidoglutamide Lysine, Acetic Acid, Maltodextrin, Citric Acid, Silica, Calcium Gluconate, Hydroxyethylcellulose, C11-15 Alketh-7, Sodium Phytate, Trideceth-12, Potassium Lactate, Polyquaternium-37, Sodium Metabisulfite, Pyridoxine HCL, Ethyl Linoleate, Glycine, Ethyl Oleate, Sorbitan Oleate, Laureth-9, Sodium Phosphate, Phytic Acid, Disodium Phosphate, Phenoxyethanol, Benzyl Alcohol, Chlorphenesin, Polysorbate 20, Sodium Benzoate, Potassium Sorbate, Citronellol, Limonene, Linalool, Geraniol.",
        "n_loves": "3K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Masks"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-flourish-conditioner-for-thinning-hair-P480369",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:31:31",
        "product_name": "Flourish® Volumizing & Detangling Conditioner for Thinning Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$63.00"
                ],
                "sku": "Item 2536886"
            }
        ],
        "rating": "width:95.68199999999999%",
        "product_reviews": "88",
        "ingredients": "-Alpha Keratin 60ku CLINICAL® Protein: A protein duo that encourages growth with microbiome-balancing ingredients. -Probiotic Ferment: Scalp microbiome booster improves irritation and cellular oxygen consumption. -Biomimetic Signal Peptides: Nourish and calm the scalp to help create a healthy environment for growth. Aqua (Water, Eau), Cetearyl Alcohol, Dimethicone, Brassicamidopropyl Dimethylamine, Cetyl Esters, Cetyl Alcohol, Behentrimonium Chloride, Isododecane, Ethylhexylglycerin, PEG-100 Stearate, Glyceryl Stearate, Keratin, Acetyl Tetrapeptide-3, Biotin, Silybum Marianum Ethyl Ester, Saccharomyces Lysate Extract, Panthenol, Tocopheryl Nicotinate, Cyperus Esculentus Root Oil, Tocopherol, Madecassoside, Quercus Petraea Fruit Extract, Citrus Paradisi (Grapefruit) Fruit Extract, Asiaticoside, Hydrolyzed Adansonia Digitata Seed Extract, Amaranthus Hypochondriacus Leaf Extract, Trifolium Pratense (Clover) Flower Extract, Larix Europaea Wood Extract, Glycine, Hydrolyzed Vegetable Protein, Hydrolyzed Quinoa, Oryza Sativa (Rice) Extract, Hydrolyzed Linseed Extract, Camellia Sinensis Leaf Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Hydrogenated Ethylhexyl Olivate, Oryza Sativa (Rice) Bran Extract, Hydrogenated Olive Oil Unsaponifiables, Jojoba Esters, Helianthus Annuus (Sunflower) Seed Oil, Oryza Sativa (Rice) Seed Protein, Phytic Acid, Tetrasodium Glutamate Diacetate, Butylene Glycol, Sodium Dilauramidoglutamide Lysine, Dextran, Disodium Phosphate, Caprylyl Glycol, Propanediol, Parfum (Fragrance), Hydroxyethylcellulose, Polysorbate 60, Benzyl Alcohol, Polysorbate 20, Sorbic Acid, Benzoic Acid, Glycerin, Phenoxyethanol, Dimethiconol, Chlorphenesin, Sodium Metabisulfite, Gluconolactone, Zinc Chloride, Sodium Hydroxide, Alcohol, Citric Acid, Tetrasodium EDTA, Sodium Benzoate, Sodium Phosphate, Potassium Sorbate, Calcium Gluconate, BHT, Linalool, Citronellol, Geraniol, Limonene.",
        "n_loves": "5.2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-curl-conditioner-P468718",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:31:45",
        "product_name": "Hydrating Curl Conditioner with Jojoba Oil",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2436715"
            }
        ],
        "rating": "width:93.05600000000001%",
        "product_reviews": "72",
        "ingredients": " -Water-Soluble Jojoba Oil: Provides moisture and hydration to enhance shine and compatibility and detangle.-Vegetable-Derived Polymer: Facilitates curl formation and definition.-Specialty Rice Protein and Extract with Sunflower Seed Oil: Provides solar protection from the drying and damaging effects of UV rays.Aqua (Water, Eau), Cetearyl Alcohol, Brassicamidopropyl Dimethylamine, Heptyl Undecylenate, Cetyl Esters, Cetyl Alcohol, Behentrimonium Chloride, Undecane, Isododecane, Hydrogenated Ethylhexyl Olivate, PEG-100 Stearate, Glyceryl Stearate, Keratin, Quercus Petraea Fruit Extract, Citrus Paradisi (Grapefruit) Fruit Extract, Asiaticoside, Passiflora Edulis Seed Oil, Oryza Sativa (Rice) Bran Oil, Hydrolyzed Verbascum Thapsus Flower, Euterpe Oleracea Fruit Oil, Oryza Sativa (Rice) Bran Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Astrocaryum Vulgare Kernel Oil, Tocopherol, Madecassoside, Hydrolyzed Adansonia Digitata Seed Extract, Salvia Sclarea (Clary) Extract, Phytic Acid, Oryza Sativa (Rice) Seed Protein, Panthenol, Helianthus Annuus (Sunflower) Seed Oil, Jojoba Esters, Parfum (Fragrance), Glycerin, Ethylhexylglycerin, Oryza Sativa (Rice) Extract, Hydrogenated Olive Oil Unsaponifiables, Rosmarinus Officinalis (Rosemary) Leaf Extract, HydrolyzedVegetable Protein, Hydrolyzed Quinoa, Ceratonia Siliqua (Carob) Gum, Helianthus Annuus (Sunflower) Seed Wax, Hydrolyzed Linseed Extract, Calcium Gluconate, Caprylyl Glycol, Butylene Glycol, Sodium Dilauramidoglutamide Lysine, Propanediol, Tridecane, Polysorbate 60, Hydroxyethylcellulose, Polysorbate 20, Polyglycerin-3, Tetrasodium Glutamate Diacetate, Disodium Phosphate, Sodium Phosphate, Phenoxyethanol, Benzyl Alcohol, Chlorphenesin, Sorbic Acid, Benzoic Acid, Potassium Sorbate, Citric Acid, Alcohol, Sodium Hydroxide, Sodium Benzoate, Gluconolactone, Limonene.",
        "n_loves": "2.1K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-flourish-volumizing-styler-P480372",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:31:58",
        "product_name": "Flourish® Volumizing Styler",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 120 mL"
                ],
                "price": [
                    "$57.00"
                ],
                "sku": "Item 2536928"
            }
        ],
        "rating": "width:80%",
        "product_reviews": "8",
        "ingredients": "-Alpha Keratin 60ku CLINICAL® Protein: A protein duo that encourages growth with microbiome-balancing ingredients.-Panthenol (Pro-Vitamin B5): Provides heat protection and hold.-Microalgae Extract: Adds volume and strength to hair fiber making hair look and feel revitalized.Aqua (Water, Eau), AMP-Acrylates/Allyl Methacrylate Copolymer, Keratin, Biosaccharide Gum-4, Isochrysis Galbana Extract, Acetyl Tetrapeptide-3, Panthenol, Zingiber Officinale (Ginger) Root Extract, Pisum Sativum (Pea) Extract, Nasturtium Officinale Extract, Moringa Oleifera Seed Extract, Jasminum Officinale (Jasmine) Flower Extract, Hydrolyzed Linseed Extract, Hydrolyzed Hibiscus Esculentus Extract, Helianthus Annuus (Sunflower) Seed Extract, Daucus Carota Sativa (Carrot) Root Extract, Cynara Scolymus (Artichoke) Leaf Extract, Amaranthus Caudatus Seed Extract, Trifolium Pratense (Clover) Flower Extract, Sodium Metabisulfite, Larix Europaea Wood Extract, Glycine, Tocopherol, Zinc Chloride, Camellia Sinensis Leaf Extract, Sodium Cocoyl Glutamate, Trisodium Ethylenediamine Disuccinate, Butylene Glycol, Polyglyceryl-6 Oleate, Glyceryl Caprylate, Sodium Dilauramidoglutamide Lysine, Caprylyl/Capryl Glucoside, Ethylhexylglycerin, Parfum (Fragrance), Glycerin, Pentylene Glycol, Sodium Surfactin, Dextran, Phenoxyethanol, Benzophenone-4, Benzophenone-3, Alcohol, Citric Acid, Linalool, Geraniol, Limonene, Citronellol, Benzyl Benzoate, Citral, Hexyl Cinnamal.",
        "n_loves": "1.9K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-create-6-in-1-styler-P448739",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:32:13",
        "product_name": "6-in-1 Vitamin E Hair Smoothing Styler",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 4 oz/ 120 mL"
                ],
                "price": [
                    "$49.00"
                ],
                "sku": "Item 2277242"
            }
        ],
        "rating": "width:93.05999999999999%",
        "product_reviews": "219",
        "ingredients": " -Panthenol (Vitamin B5): Delivers moisture, softness, and shine.\n-Cypress: Rich in antioxidants, it provides light, soothing hydration. \n-Strengthening Polymers: Naturally-derived hair fixatives designed to help style hair. \nAqua (Water), Cyclopentasiloxane, Dimethicone, Glycerin, Phenyl Trimethicone, Dimethiconol, Alpha Keratin, Panthenol, Tocopherol, Ethylhexylglycerin, Polyacrylamide, Maltodextrin/VP Copolymer, PVP, Maltodextrin, Ammonium Acryloyldimethyltaurate/VP Copolymer, Parfum (Fragrance), Oleth-10, C13-14 Isoparaffin, Oleth-20, Laureth-7, Phenoxyethanol, Chlorphenesin, Cyclohexasiloxane, Citric Acid, Limonene, Linalool, Benzyl Salicylate, Citronellol, Citral, Eugenol.",
        "n_loves": "9.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Styling Products"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-topical-hair-scalp-supplement-P460412",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:32:27",
        "product_name": "Soothing Hyaluronic Acid Topical Scalp Supplement",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": "ONLY A FEW LEFT",
                "size": null,
                "name": [
                    "Size: 2.0 oz/ 60 mL",
                    "ONLY A FEW LEFT"
                ],
                "price": [
                    "$77.00"
                ],
                "sku": "Item 2376200"
            }
        ],
        "rating": "width:58.46199999999999%",
        "product_reviews": "13",
        "ingredients": " -Biomimetic Peptide: Enhances hair health. -Olive-Oil-Derived Ceramides: Improve overall scalp health and nutrition. -Specialty Watercress and Indian Cress Extracts: Support cell turnover. Aqua (Water, Eau), Dimethicone, Polysorbate 20, Glycerin, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Polymethylsilsesquioxane, Butylene Glycol, Dimethicone/Vinyl Dimethicone Crosspolymer, Methyl Gluceth-20, Bis-PEG-18 Methyl Ether Dimethyl Silane, Keratin, Panthenol, Caesalpinia Spinosa Fruit Pod Extract, Biotin, Palmitoyl Tetrapeptide-20, Acetyl Hexapeptide-1, Arginine, Aspartic Acid, Tocopherol, Ceramide NG, PCA, Quercus Petraea Fruit Extract, Furcellaria Lumbricalis Extract, Sodium Hyaluronate, Hydrolyzed Sodium Hyaluronate, Citrus Paradisi (Grapefruit) Fruit Extract, Helianthus Annuus (Sunflower) Sprout Extract, Glycine, Alanine, Serine, Tropaeolum Majus Extract, Nasturtium Officinale Extract, Valine, Threonine, Proline, Isoleucine, Phenylalanine, Histidine, Sorbic Acid, Dextran, Ricinus Communis (Castor) Seed Oil, Olea Europaea (Olive) Fruit Oil, Sodium PCA, Sodium Lactate, Ethylhexylglycerin, Alpha-Glucan Oligosaccharide, Maltodextrin, Caprylyl Glycol, Polyglyceryl-6 Laurate, Pentylene Glycol, Myristyl Glucoside, Lauryl Glucoside, Propanediol, Dimethiconol, Xanthan Gum, Carbomer, Silica, Isoceteth-10, Polyquaternium-10, Parfum (Fragrance), Disodium EDTA, Phenoxyethanol, Sodium Benzoate, Citric Acid, Aminomethyl Propanol, BHT, Linalool, Benzyl Salicylate, Coumarin, Geraniol, Limonene.",
        "n_loves": "2.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-healing-oil-P448865",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:32:43",
        "product_name": "Hydrating & Heat Protectant Healing Hair Oil",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 1.7 oz/ 50 mL"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2286235"
            }
        ],
        "rating": "width:94.762%",
        "product_reviews": "672",
        "ingredients": " -Tocopherol: Helps to fight free radicals created from exposure to UV light or pollution.-Tahitian Gardenia Flower Extract: Helps strengthen weak and damaged hair.-Kalahari Melon Seed Oil: Protects the hair from the damaging effects of environmental aggressors and works to nurture dry, brittle, and damaged hair, shielding it against moisture loss.Cyclopentasiloxane, Dimethiconol, Parfum (Fragrance), Alpha Keratin, Sclerocarya Birrea Seed Oil, Citrullus Lanatus (Watermelon) Seed Oil, Cocos Nucifera (Coconut) Oil, Gardenia Taitensis Flower Extract, Tocopherol, Polyglyceryl-4 Isostearate, Hexyl Laurate, Cetyl PEG/PPG-10/1 Dimethicone, Silicone Quaternium-3, Trideceth-12, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Benzyl Benzoate, Coumarin, Limonene, Geraniol, Hexyl Cinnamal, Linalool, Benzyl Salicylate.",
        "n_loves": "18.8K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Hair Oil"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-flourish-nightly-intensive-hair-rejuvenation-treatment-P480375",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:32:56",
        "product_name": "Flourish® Hair Rejuvenation Treatment Set for Volume",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 30 Day Supply"
                ],
                "price": [
                    "$90.00"
                ],
                "sku": "Item 2536977"
            },
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 90 Day Supply"
                ],
                "price": [
                    "$173.00"
                ],
                "sku": "Item 2536951"
            }
        ],
        "rating": "width:93.272%",
        "product_reviews": "214",
        "ingredients": "-Alpha Keratin 60ku CLINICAL® Protein: A protein duo that encourages growth with microbiome-balancing ingredients. -Biomimetic Signal Peptides: Nourish and calm the scalp to help create a healthy environment for growth. -Larch Wood Extract: Encourages the initiation of the anagen growth phase. Flourish® Shampoo: Aqua (Water, Eau), Sodium Lauroyl Methyl Isethionate, Sodium Cocoyl Isethionate, Lauryl Glucoside, Acrylates Copolymer, Keratin, Trifolium Pratense (Clover) Flower Extract, Camellia Sinensis Leaf Extract, Larix Europaea Wood Extract, Sodium Hyaluronate, Tocopherol, Acetyl Tetrapeptide-3, Rice Oil Glycereth-8 Esters, Sodium Phytate, Cocamide MIPA, Polysorbate 20, Hydrogenated Coconut Acid, Sodium Isethionate, Sodium Methyl Cocoyl Taurate, Caprylyl Glycol, Guar Hydroxypropyltrimonium Chloride, Trisodium Ethylenediamine Disuccinate, Ethylhexylglycerin, Hexylene Glycol, Glycerin, Butylene Glycol, Sodium Dilauramidoglutamide Lysine, Isopropanolamine, Coconut Acid, Dextran, Chondrus Crispus Extract, Ethylhexyl Salicylate, Sodium Metabisulfite, Glycine, Gluconolactone, Zinc Chloride, Phenoxyethanol, Parfum (Fragrance), Potassium Sorbate, Sodium Hydroxide, Citric Acid, Sodium Benzoate, Sodium Chloride, Linalool, Geraniol, Limonene, Citronellol.Flourish® Conditioner: Aqua (Water, Eau), Cetearyl Alcohol, Dimethicone, Brassicamidopropyl Dimethylamine, Cetyl Esters, Cetyl Alcohol, Behentrimonium Chloride, Isododecane, Ethylhexylglycerin, PEG-100 Stearate, Glyceryl Stearate, Keratin, Acetyl Tetrapeptide-3, Biotin, Silybum Marianum Ethyl Ester, Saccharomyces Lysate Extract, Panthenol, Tocopheryl Nicotinate, Cyperus Esculentus Root Oil, Tocopherol, Madecassoside, Quercus Petraea Fruit Extract, Citrus Paradisi (Grapefruit) Fruit Extract, Asiaticoside, Hydrolyzed Adansonia Digitata Seed Extract, Amaranthus Hypochondriacus Leaf Extract, Trifolium Pratense (Clover) Flower Extract, Larix Europaea Wood Extract, Glycine, Hydrolyzed Vegetable Protein, Hydrolyzed Quinoa, Oryza Sativa (Rice) Extract, Hydrolyzed Linseed Extract, Camellia Sinensis Leaf Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Hydrogenated Ethylhexyl Olivate, Oryza Sativa (Rice) Bran Extract, Hydrogenated Olive Oil Unsaponifiables, Jojoba Esters, Helianthus Annuus (Sunflower) Seed Oil, Oryza Sativa (Rice) Seed Protein, Phytic Acid, Tetrasodium Glutamate Diacetate, Butylene Glycol, Sodium Dilauramidoglutamide Lysine, Dextran, Disodium Phosphate, Caprylyl Glycol, Propanediol, Parfum (Fragrance), Hydroxyethylcellulose, Polysorbate 60, Benzyl Alcohol, Polysorbate 20, Sorbic Acid, Benzoic Acid, Glycerin, Phenoxyethanol, Dimethiconol, Chlorphenesin, Sodium Metabisulfite, Gluconolactone, Zinc Chloride, Sodium Hydroxide, Alcohol, Citric Acid, Tetrasodium EDTA, Sodium Benzoate, Sodium Phosphate, Potassium Sorbate, Calcium Gluconate, BHT, Linalool, Citronellol, Geraniol, Limonene.Density Booster: Aqua (Water, Eau), Keratin, Methyl Nicotinate, Acetyl Tetrapeptide-3, Zingiber Officinale (Ginger) Root Extract, Pisum Sativum (Pea) Extract, Nasturtium Officinale Extract, Moringa Oleifera Seed Extract, Jasminum Officinale (Jasmine) Flower Extract, Hydrolyzed Linseed Extract, Hydrolyzed Hibiscus Esculentus Extract, Helianthus Annuus (Sunflower) Seed Extract, Daucus Carota Sativa (Carrot) Root Extract, Cynara Scolymus (Artichoke) Leaf Extract, Amaranthus Caudatus Seed Extract, Saccharomyces Lysate Extract, Larix Europaea Wood Extract, Trifolium Pratense (Clover) Flower Extract, Camellia Sinensis Leaf Extract, Isochrysis Galbana Extract, Tocopherol, Mentha Piperita (Peppermint) Oil, Dextran, Pentylene Glycol, Sodium Phytate, Sodium Dilauramidoglutamide Lysine, Quaternium-51, Ethylhexylglycerin, Sodium Metabisulfite, Glycine, Parfum (Fragrance), Biosaccharide Gum-4, Butylene Glycol, Glycerin, Zinc Chloride, PPG-26-Buteth-26, Propanediol, Polyacrylate Crosspolymer-6, PEG-40 Hydrogenated Castor Oil, t-Butyl Alcohol, Alcohol, Tetrasodium EDTA, Sodium Benzoate, Potassium Sorbate, Disodium EDTA, Phenoxyethanol, Citric Acid, Linalool, Geraniol, Limonene, Citronellol, Benzyl Benzoate, Citral, Hexyl Cinnamal.",
        "n_loves": "5.5K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-curl-shampoo-P468717",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:33:11",
        "product_name": "Hydrating Curl Shampoo with Jojoba Oil",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 240 mL"
                ],
                "price": [
                    "$58.00"
                ],
                "sku": "Item 2436707"
            }
        ],
        "rating": "width:92.75399999999999%",
        "product_reviews": "69",
        "ingredients": " -Water-Soluble Jojoba Oil: Provides moisture and hydration to enhance shine and compatibility and detangle.-Vegetable-Derived Polymer: Facilitates curl formation and definition.-Specialty Rice Protein and Extract with Sunflower Seed Oil: Provides solar protection from the drying and damaging effects of UV rays.Aqua (Water, Eau), Sodium Cocoyl Isethionate, Sodium Lauroyl Methyl Isethionate, Lauryl Glucoside, Polyglyceryl-3 Laurate, Isoamyl Laurate, Acrylates Copolymer, Coconut Acid,Ethylhexylglycerin, Keratin, Panthenol, Asiaticoside, Quercus Petraea Fruit Extract, Salvia Hispanica Seed Extract, Hydrolyzed Quinoa, Hydrolyzed Adansonia Digitata Seed Extract, Xylitol, Salvia Sclarea (Clary) Extract, Gluconolactone, Camellia Sinensis Leaf Extract, Trehalose, Oryza Sativa (Rice) Seed Protein, Citrus Paradisi (Grapefruit) Fruit Extract, Galactoarabinan, Phytic Acid, Oryza Sativa (Rice) Bran Extract, Linum Usitatissimum (Linseed) Seed Extract, Sodium Dilauramidoglutamide Lysine, Helianthus Annuus (Sunflower) Seed Oil, Maltodextrin, Madecassoside, Tocopherol, Sodium Phytate,Rosmarinus Officinalis (Rosemary) Leaf Extract, Oryza Sativa (Rice) Extract, Butylene Glycol, Sodium Phosphate, Ethyl Linoleate, Caesalpinia Spinosa Fruit Extract, Ethyl Oleate, Ceratonia Siliqua Gum, Sorbitan Oleate, Polyquaternium-37, Helianthus Annuus (Sunflower) Sprout Extract, Caprylyl/Capryl Glucoside, Caprylyl Glycol, Caprylic Acid, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Calcium Gluconate, Parfum (Fragrance), Glycol Distearate, Propanediol, Jojoba Oil Glycereth-8 Esters, Disteareth-75 IPDI, Sodium Isethionate, Guar Hydroxypropyltrimonium Chloride, Glycerin, Hydroxypropyl Methylcellulose Stearoxy Ether, Trisodium Ethylenediamine Disuccinate, Stearic Acid, Polysorbate 80, Phenoxyethanol, Sodium Benzoate, Benzyl Alcohol, Chlorphenesin, Potassium Sorbate, Potassium Hydroxide, Citric Acid, Alcohol, Limonene, Linalool.",
        "n_loves": "2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-full-conditioner-P448730",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:33:25",
        "product_name": "Volumizing Full Conditioner for Fine Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 6.7 oz/ 200 mL"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2277135"
            }
        ],
        "rating": "width:92.70400000000001%",
        "product_reviews": "233",
        "ingredients": "Pink Pomelo: A nutrient-rich citrus fruit full of vitamins A, C, and B1 and zinc to give hair a shot of vitality.-Artichoke Leaf: A nurturing botanical loaded with lipids and protein that helps seal and strengthen hair’s cuticle.Aqua (Water, Eau), Cetearyl Alcohol, Dimethicone, Stearamidopropyl Dimethylamine, Behentrimonium Chloride, Cetyl Alcohol, Glyceryl Stearate, Peg-100 Stearate, Peg-8 Dimethicone, Isododecane, Ethylhexylglycerin, Cetyl Esters, Parfum (Fragrance), Alpha Keratin, Panthenol, Quercus Petraea Fruit Extract, Biotin, Hydrogenated Ethylhexyl Olivate, Oryza Sativa (Rice) Bran Extract, Hydrogenated Olive Oil Unsaponifiables, Glycerin, Cyperus Esculentus Root Oil, Zea Mays (Corn) Starch, Helianthus Annuus (Sunflower) Seed Oil, Serenoa Serrulata Fruit Extract, Madecassoside, Amaranthus Caudatus Seed Extract, Tocopherol, Rosmarinus Officinalis (Rosemary) Leaf Extract, Hydrolyzed Adansonia Digitata Seed Oil, Asiaticoside, Citrus Paradisi (Grapefruit) Fruit Extract, Cynara Scolymus (Artichoke) Leaf Extract, Jojoba Esters, Hydrolyzed Lupine Protein, Hydrolyzed Quinoa, Hydrolyzed Pea Protein Pg-Propyl Silanetriol, Caprylyl Glycol, Propanediol, Polysorbate 60, Hydroxyethylcellulose, Dimethiconol, Polysorbate 20, Polysilicone-15, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Sodium Dilauramidoglutamide Lysine, Methoxy Peg/Ppg-7/3 Aminopropyl Dimethicone, Cystine Bis-Pg-Propyl Silanetriol, Alcohol, Butylene Glycol, Phenoxyethanol, Isopropyl Alcohol, Benzyl Alcohol, Benzoic Acid, Sorbic Acid, Disodium Edta, Bht, Citric Acid, Sodium Nitrate, Glyoxal, Sodium Chloride, Chlorphenesin, Gluconolactone, Sodium Benzoate, Potassium Sorbate, Phenethyl Alcohol, Calcium Gluconate, Limonene, Linalool, Benzyl Salicylate, Cital, Hydroxycitronellal.",
        "n_loves": "5.2K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-mini-recovery-conditioner-P455002",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:33:39",
        "product_name": "Mini Hydrating Recovery Conditioner for Dry, Damaged & Colored Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Mini size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 2 oz/ 60 mL"
                ],
                "price": [
                    "$23.50"
                ],
                "sku": "Item 2329811"
            }
        ],
        "rating": "width:92.85799999999999%",
        "product_reviews": "378",
        "ingredients": "-Hydrolyzed Quinoa: This plant-based protein that enhances color, helps moisture retention, and adds shine. -Baobab Seed Oil: From the African Tree of Life (known for its ability to store water), this rich, silky oil helps act as an intense emollient for dry, damaged hair.  -Grapefruit Extract: Loaded with vitamin C and antioxidants, this refreshing fruit helps revitalize the scalp and returns hair’s vibrance and shine.",
        "n_loves": "2.8K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Conditioner"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-flourish-shampoo-for-thinning-hair-P480368",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:33:53",
        "product_name": "Flourish® Volumizing Keratin Shampoo for Thinning Hair",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 8 oz/ 240 mL"
                ],
                "price": [
                    "$60.00"
                ],
                "sku": "Item 2536878"
            }
        ],
        "rating": "width:90.392%",
        "product_reviews": "102",
        "ingredients": "-Alpha Keratin 60ku CLINICAL® Protein: A protein duo that encourages growth with microbiome-balancing ingredients. -Sodium Hyaluronate and Red Algae Extract: For lightweight hydration and moisture to thicken hair and keep fibers supple. -Biomimetic Signal Peptides: Nourish and calm the scalp to help create a healthy environment for growth.  Aqua (Water, Eau), Sodium Lauroyl Methyl Isethionate, Sodium Cocoyl Isethionate, Lauryl Glucoside, Acrylates Copolymer, Keratin, Trifolium Pratense (Clover) Flower Extract, Camellia Sinensis Leaf Extract, Larix Europaea Wood Extract, Sodium Hyaluronate, Tocopherol, Acetyl Tetrapeptide-3, Rice Oil Glycereth-8 Esters, Sodium Phytate, Cocamide MIPA, Polysorbate 20, Hydrogenated Coconut Acid, Sodium Isethionate, Sodium Methyl Cocoyl Taurate, Caprylyl Glycol, Guar Hydroxypropyltrimonium Chloride, Trisodium Ethylenediamine Disuccinate, Ethylhexylglycerin, Hexylene Glycol, Glycerin, Butylene Glycol, Sodium Dilauramidoglutamide Lysine, Isopropanolamine, Coconut Acid, Dextran, Chondrus Crispus Extract, Ethylhexyl Salicylate, Sodium Metabisulfite, Glycine, Gluconolactone, Zinc Chloride, Phenoxyethanol, Parfum (Fragrance), Potassium Sorbate, Sodium Hydroxide, Citric Acid, Sodium Benzoate, Sodium Chloride, Linalool, Geraniol, Limonene, Citronellol.",
        "n_loves": "7.9K",
        "categories": [
            "Hair",
            "Shampoo & Conditioner",
            "Shampoo"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-exfoliating-scalp-treatment-P460411",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:34:05",
        "product_name": "Clarifying & Exfoliating  Scalp Treatment",
        "brand_name": "Virtue",
        "options": [
            {
                "swatch_group": "Standard size",
                "flag_label": null,
                "size": null,
                "name": [
                    "Size: 5.0 oz/ 150 mL"
                ],
                "price": [
                    "$66.00"
                ],
                "sku": "Item 2376218"
            }
        ],
        "rating": "width:90.99999999999999%",
        "product_reviews": "80",
        "ingredients": " -Papain and Bromelain: Fruit enzymes that gently slough off dead skin cells.-Beta Hydroxy Acid (BHA): Gently exfoliates dead skin cells.  -Coconut, Jojoba, and Kalahari Melon Oils: Provide essential hydration for hair and Aqua (Water, Eau), Cetearyl Alcohol, Oryza Sativa (Rice) Powder, Brassicamidopropyl Dimethylamine, Dimethicone, Cetyl Esters, Cetyl Alcohol, Hydrogenated Ethylhexyl Olivate, Behentrimonium Chloride, Isododecane, Ceteareth-20, Keratin, Panthenol, Salicylic Acid, Helianthus Annuus (Sunflower) Seed Oil, Coffea Robusta Seed Extract, Citrullus Lanatus (Watermelon) Seed Oil, Biotin, Hydrolyzed Quinoa, Hydrolyzed Adansonia Digitata Seed Extract, Oryza Sativa (Rice) Seed Protein, Papain, Simmondsia Chinensis (Jojoba) Seed Oil, Cocos Nucifera (Coconut) Oil, Caffeine, Jojoba Esters, Glucose, Tocopherol, Madecassoside, Rosmarinus Officinalis (Rosemary) Leaf Extract, Bromelain, Quercus Petraea Fruit Extract, Epilobium Angustifolium Flower/Leaf/Stem Extract, Citrus Paradisi (Grapefruit) Fruit Extract, Asiaticoside, Phytic Acid, Oryza Sativa (Rice) Extract, Oryza Sativa (Rice) Bran Extract, Hydrogenated Olive Oil Unsaponifiables, Glyceryl Stearate, Caprylyl Glycol, Glycerin, Ethylhexylglycerin, Parfum (Fragrance), Amodimethicone, Hydroxyethylcellulose, Sodium Phytate, Sodium Dilauramidoglutamide Lysine, Acetic Acid, Propanediol, Polysorbate 60, Polysorbate 20, Trideceth-12, Butylene Glycol, Citric Acid, Sodium Metabisulfite, Calcium Gluconate, Laureth-9, C11-15 Pareth-7, Sodium Nitrate, Maltodextrin, Alcohol, Glyoxal, Gluconolactone, Phenoxyethanol, Benzyl Alcohol, Chlorphenesin, Sodium Benzoate, Potassium Sorbate, BHT, Linalool, Benzyl Salicylate, Limonene.",
        "n_loves": "6.7K",
        "categories": [
            "Hair",
            "Hair Styling & Treatments",
            "Scalp Treatments"
        ]
    },
    {
        "url": "https://www.sephora.com/ca/en/product/virtue-flourish-manta-brush-P480373",
        "error": "",
        "scrape_timestamp": "08/22/2023, 21:34:17",
        "product_name": "FLOURISH® X MANTA®  Healthy Hair Brush",
        "brand_name": "Virtue",
        "options": [],
        "rating": "width:88.18199999999999%",
        "product_reviews": "22",
        "ingredients": "Unknown Ingredients",
        "n_loves": "6.4K",
        "categories": [
            "Hair",
            "Tools",
            "Brushes & Combs"
        ]
    }
]